{"title": "Accelerate AI agent development with the Nova Act IDE extension", "url": "https://aws.amazon.com/blogs/aws/accelerate-ai-agent-development-with-the-nova-act-ide-extension/", "published": "2025-09-23T16:01:04+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "The Nova Act extension is a new IDE-integrated tool that enables developers to create browser automation agents using natural language through the Nova Act model, offering features like Builder Mode, chat capabilities, and predefined templates while streamlining the development process without leaving their preferred development environment.", "company": "aws.amazon.com", "_k": "80acac47a0c25d4b2a7edf6a53341fe8dd23182fbcf4b74d8154672e05a65470"}
{"title": "AWS Weekly Roundup: Amazon Q Developer, AWS Step Functions, AWS Cloud Club Captain deadline, and more (September 22, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-q-developer-aws-step-functions-aws-cloud-club-captain-deadline-and-more-september-22-2025/", "published": "2025-09-22T16:21:44+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Three weeks ago, I published a post about the new AWS Region in New Zealand (ap-southeast-6). This led to an incredible opportunity to visit New Zealand, where I met passionate builders and presented at several events including Serverless and Platform Engineering meetup, AWS Tools and Programming meetup, AWS Cloud Clubs in Auckland, and AWS Community […]", "company": "aws.amazon.com", "_k": "5479738a53c64d24f42e4c63df8aa09585481bb03c6d0ba0a87dd06eded041ed"}
{"title": "Qwen models are now available in Amazon Bedrock", "url": "https://aws.amazon.com/blogs/aws/qwen-models-are-now-available-in-amazon-bedrock/", "published": "2025-09-18T22:02:11+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Amazon Bedrock has expanded its model offerings with the addition of Qwen 3 foundation models enabling users to access and deploy them in a fully managed, serverless environment. These models feature both mixture-of-experts (MoE) and dense architectures to support diverse use cases including advanced code generation, multi-tool business automation, and cost-optimized AI reasoning.", "company": "aws.amazon.com", "_k": "9049d4718a9e0da8c62418d4d379ba38a30109b1b04c71393ea38700abe28b10"}
{"title": "DeepSeek-V3.1 model now available in Amazon Bedrock", "url": "https://aws.amazon.com/blogs/aws/deepseek-v3-1-now-available-in-amazon-bedrock/", "published": "2025-09-18T21:49:48+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS launches DeepSeek-V3.1 as a fully managed models in Amazon Bedrock. DeepSeek-V3.1 is a hybrid open weight model that switches between thinking mode for detailed step-by-step analysis and non-thinking mode for faster responses.", "company": "aws.amazon.com", "_k": "955628bd1e980adfea382bed8dbf03d7a9695c22f04b7bba2e4ae645dacce484"}
{"title": "AWS named as a Leader in 2025 Gartner Magic Quadrant for Cloud-Native Application Platforms and Container Management", "url": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-2025-gartner-magic-quadrant-for-cloud-native-application-platforms-and-container-management/", "published": "2025-09-15T17:53:48+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS was named as a Leader in the 2025 Gartner Magic Quadrant for Cloud-Native Application Platforms in two consecutive years positioned highest on \"Ability to Execute\", and for Container Management in three years positioned furthest for \"Completeness of Vision\".", "company": "aws.amazon.com", "_k": "821be6a2ce7fbee898e5250a3a366027386008e226337c0528a98623be263058"}
{"title": "AWS Weekly Roundup: Strands Agents 1M+ downloads, Cloud Club Captain, AI Agent Hackathon, and more (September 15, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-strands-agents-1m-downloads-cloud-club-captain-ai-agent-hackathon-and-more-september-15-2025/", "published": "2025-09-15T16:45:14+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Last week, Strands Agents, AWS open source for agentic AI SDK just hit 1 million downloads and earned 3,000+ GitHub Stars less than 4 months since launching as a preview in May 2025. With Strands Agents, you can build production-ready, multi-agent AI systems in a few lines of code. We’ve continuously improved features including support […]", "company": "aws.amazon.com", "_k": "48f0560e08964aa2c8941d1180f8a05aa7184d3d9ef78cb9fc0cf2aa0cdf74ea"}
{"title": "Announcing Amazon EC2 M4 and M4 Pro Mac instances", "url": "https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-m4-and-m4-pro-mac-instances/", "published": "2025-09-12T16:30:25+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS has launched new EC2 M4 and M4 Pro Mac instances based on Apple M4 Mac mini, offering improved performance over previous generations and featuring up to 48GB memory and 2TB storage for iOS/macOS development workloads.", "company": "aws.amazon.com", "_k": "f700ba4f878a532c247812e467cd500a03fed09f16d017f47a74bf2f70840939"}
{"title": "Accelerate serverless testing with LocalStack integration in VS Code IDE", "url": "https://aws.amazon.com/blogs/aws/accelerate-serverless-testing-with-localstack-integration-in-vs-code-ide/", "published": "2025-09-11T18:06:05+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS is announcing integrated LocalStack support in the AWS Toolkit for Visual Studio Code that makes it easier than ever for developers to test and debug serverless applications locally. This enhancement builds upon our recent improvements to the Lambda development experience, including the console to IDE integration and remote debugging capabilities we launched in July 2025, continuing our commitment to simplify serverless development on AWS.", "company": "aws.amazon.com", "_k": "7e92a16a22fd27c4165679432e0f8635d313ffa72a447169d974a8196802cb9c"}
{"title": "AWS Weekly Roundup: AWS Transform, Amazon Neptune, and more (September 8, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-aws-transform-amazon-neptune-and-more-september-8-2025/", "published": "2025-09-08T17:20:32+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Summer has drawn to a close here in Utrecht, where I live in the Netherlands. In two weeks, I’ll be attending AWS Community Day 2025, hosted at the Kinepolis Jaarbeurs Utrecht on September 24. The single-day event will bring together over 500 cloud practitioners from across the Netherlands, featuring 25 breakout sessions across five technical […]", "company": "aws.amazon.com", "_k": "ec18f8ec90b8c828a91cc6a9d040b810427858d2313a813c5655f055192c1b30"}
{"title": "Now Open — AWS Asia Pacific (New Zealand) Region", "url": "https://aws.amazon.com/blogs/aws/now-open-aws-asia-pacific-new-zealand-region/", "published": "2025-09-01T22:06:17+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS has launched its first New Zealand Region with three Availability Zones, marking its 16th Region in Asia Pacific and enabling local data residency for New Zealand organizations.", "company": "aws.amazon.com", "_k": "be4cb71db618902a3975c25be0636fddc9e133c66673f072f95e60610e077fd2"}
{"title": "AWS Weekly Roundup: Amazon EC2, Amazon Q Developer, IPv6 updates, and more (September 1, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-ec2-amazon-q-developer-ipv6-updates-and-more-september-1-2025/", "published": "2025-09-01T12:59:02+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "My LinkedIn feed was absolutely packed this week with pictures from the AWS Heroes Summit event in Seattle. It was heartwarming to see so many familiar faces and new Heroes coming together. For those not familiar with the AWS Heroes program, it’s a global community recognition initiative that honors individuals who make outstanding contributions to […]", "company": "aws.amazon.com", "_k": "dddff0e18fee5f33c8d297142b9f96f533aca23aefed73b538426a37d52c5ef2"}
{"title": "New general-purpose Amazon EC2 M8i and M8i-flex instances are now available", "url": "https://aws.amazon.com/blogs/aws/new-general-purpose-amazon-ec2-m8i-and-m8i-flex-instances-are-now-available/", "published": "2025-08-28T19:35:40+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "M8i and M8i-flex instances powered by Intel Xeon processors offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.", "company": "aws.amazon.com", "_k": "6bbb6956092eec55e103612dab67c193dd9f110c98ea4315bd7ebadab7ad135b"}
{"title": "AWS services scale to new heights for Prime Day 2025: key metrics and milestones", "url": "https://aws.amazon.com/blogs/aws/aws-services-scale-to-new-heights-for-prime-day-2025-key-metrics-and-milestones/", "published": "2025-08-26T16:06:28+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Amazon Prime Day 2025 achieved record-breaking sales with enhanced AI shopping features, while AWS infrastructure handled unprecedented volumes of data—including 1.7 trillion Lambda invocations per day, DynamoDB peaking at 151 million requests per second, and a 77% increase in Fargate container tasks—showcasing the massive scalability required to power the four-day shopping event.", "company": "aws.amazon.com", "_k": "f255951a3c29b955cdef45789d8e564724c53b5b5256c790f2700d2ed18a7be9"}
{"title": "AWS Weekly Roundup: Amazon Aurora 10th anniversary, Amazon EC2 R8 instances, Amazon Bedrock and more (August 25, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-aurora-10th-anniversary-amazon-ec2-r8-instances-amazon-bedrock-and-more-august-25-2025/", "published": "2025-08-25T16:30:43+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "As I was preparing for this week’s roundup, I couldn’t help but reflect on how database technology has evolved over the past decade. It’s fascinating to see how architectural decisions made years ago continue to shape the way we build modern applications. This week brings a special milestone that perfectly captures this evolution in cloud […]", "company": "aws.amazon.com", "_k": "c4fae625db2d10e83f9a029017c4a0e8faaa532cda28ef0ea80f01d1a63b4636"}
{"title": "Best performance and fastest memory with the new Amazon EC2 R8i and R8i-flex instances", "url": "https://aws.amazon.com/blogs/aws/best-performance-and-fastest-memory-with-the-new-amazon-ec2-r8i-and-r8i-flex-instances/", "published": "2025-08-19T19:16:24+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "R8i and R8i-flex instances powered by Intel Xeon processors offer up to 15% better price performance, 20% higher performance, and 2.5 times more memory throughput compared to previous generations.", "company": "aws.amazon.com", "_k": "c52b0d19ee673cab3439059877670c27ae3c72eb7c50b8799851325a5c87bf1c"}
{"title": "AWS Weekly Roundup: Single GPU P5 instances, Advanced Go Driver, Amazon SageMaker HyperPod and more (August 18, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-single-gpu-p5-instances-advanced-go-driver-amazon-sagemaker-hyperpod-and-more-august-18-2025/", "published": "2025-08-18T15:39:10+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Let me start this week’s update with something I’m especially excited about – the upcoming BeSA (Become a Solutions Architect) cohort. BeSA is a free mentoring program that I host along with a few other AWS employees on a volunteer basis to help people excel in their cloud careers. Last week, the instructors’ lineup was […]", "company": "aws.amazon.com", "_k": "068559c31c9db0d67fd288d10a473457367c0fd1e2ad53afba69acf4547df7c3"}
{"title": "AWS named as a Leader in 2025 Gartner Magic Quadrant for Strategic Cloud Platform Services for 15 years in a row", "url": "https://aws.amazon.com/blogs/aws/aws-named-as-a-leader-in-2025-gartner-magic-quadrant-for-strategic-cloud-platform-services-for-15-years-in-a-row/", "published": "2025-08-15T16:59:11+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS is recognized as a Leader in the 2025 Gartner Magic Quadrant for Strategic Cloud Platform Services for the fifteenth consecutive year. In the report, Gartner once again placed AWS highest on the “Ability to Execute” axis. We believe this reflects our ongoing commitment to giving customers the broadest and deepest set of capabilities to accelerate innovation as well as unparalleled security, reliability, and performance they can trust for their most critical applications.", "company": "aws.amazon.com", "_k": "49d26fa3bd2c574d62be5915fd3ea45c2ee6315e63765af3eb3d45c335691460"}
{"title": "Celebrating 10 years of Amazon Aurora innovation", "url": "https://aws.amazon.com/blogs/aws/celebrating-10-years-of-amazon-aurora-innovation/", "published": "2025-08-15T16:01:02+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Amazon Aurora is celebrating its 10th anniversary with a livestream event on August 21, 2025, highlighting a decade of database innovation since its groundbreaking architecture that decoupled storage from compute.", "company": "aws.amazon.com", "_k": "96cf4af94a49820de7cee2fda0692938ce1c9d26b7043dd73b3dbd02a62c9cc0"}
{"title": "Meet our newest AWS Heroes — August 2025", "url": "https://aws.amazon.com/blogs/aws/meet-our-newest-aws-heroes-august-2025/", "published": "2025-08-13T16:17:05+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "We are excited to announce the latest cohort of AWS Heroes, recognized for their exceptional contributions and technical leadership. These passionate individuals represent diverse regions and technical specialties, demonstrating notable expertise and dedication to knowledge sharing within the AWS community. From AI and machine learning to serverless architectures and security, our new Heroes showcase the […]", "company": "aws.amazon.com", "_k": "4a7f6d780884c612d1b3c7c443bf9cb9c2dcc7cafb98e130d6db58ce63226923"}
{"title": "AWS Weekly Roundup: OpenAI models, Automated Reasoning checks, Amazon EVS, and more (August 11, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-openai-models-automated-reasoning-checks-amazon-evs-and-more-august-11-2025/", "published": "2025-08-11T16:05:01+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS Summits in the northern hemisphere have mostly concluded but the fun and learning hasn’t yet stopped for those of us in other parts of the globe. The community, customers, partners, and colleagues enjoyed a day of learning and networking last week at the AWS Summit Mexico City and the AWS Summit Jakarta. Last week’s […]", "company": "aws.amazon.com", "_k": "a95a8d3663999b04483452880921eb2881f2a5d62956ac72ca3775fa8eeda08e"}
{"title": "Amazon Neptune Analytics is now available in AWS Asia Pacific (Mumbai) Region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-neptune-analytics-available-mumbai/", "published": "2025-09-26T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://docs.aws.amazon.com/neptune-analytics/latest/userguide/what-is-neptune-analytics.html\">Amazon Neptune Analytics</a> is now available in the Asia Pacific (Mumbai) Region. You can now create and manage Neptune Analytics graphs in the Asia Pacific (Mumbai) Region and run advanced graph analytics.<br /> <br /> Neptune Analytics is a memory-optimized graph database engine for analytics. With Neptune Analytics, you can get insights and find trends by processing large amounts of graph data in seconds. To analyze graph data quickly and easily, Neptune Analytics stores large graph datasets in memory. It supports a library of optimized graph analytic algorithms, low-latency graph queries, and vector search capabilities within graph traversals. Neptune Analytics is an ideal choice for investigatory, exploratory, or data-science workloads that require fast iteration for data, analytical and algorithmic processing, or vector search on graph data. It complements Amazon Neptune Database, a popular managed graph database. To perform intensive analysis, you can load the data from a Neptune Database graph or snapshot into Neptune Analytics. You can also load graph data that's stored in Amazon S3.<br /> <br /> To get started, you can create a new Neptune Analytics graphs using the <a href=\"https://ap-south-1.console.aws.amazon.com/neptune/home?region=ap-south-1#analytics-graphs:\">AWS Management Console</a>, or AWS CLI. For more information on pricing and region availability, refer to the <a href=\"https://aws.amazon.com/neptune/pricing/\">Neptune pricing page</a>.</p>", "company": "aws.amazon.com", "_k": "7072c2b4aac91986d85ac073d188f29c333728fa978808e575f9f9ab845d1d65"}
{"title": "Local file redirection is now available on Amazon AppStream 2.0 multi-session fleets", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/local-file-redirection-amazon-appstream-multi-session-fleets/", "published": "2025-09-26T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon AppStream 2.0 is enhancing the end-user experience by introducing support for local files redirection on multi-session fleets. While this feature is already available on single-session fleets, this launch extends it to multi-session fleets, helping administrators to leverage the cost benefits of the multi-session model while providing an enhanced end-user experience.<br /> <br /> Local file redirection on AppStream helps deliver benefits by enabling seamless access to local files directly from streaming applications, enhancing user productivity and experience. This feature reduces the need for manual file uploads and downloads, providing a natural, desktop-like experience with intuitive drag-and-drop functionality. Users can more efficiently manage their workflows while helping to maintain security through controlled access to local resources and secure file handling between environments.<br /> <br /> This feature is available at no additional cost in all the AWS <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">Regions</a> where Amazon AppStream 2.0 is available. AppStream 2.0 offers pay-as-you go <a href=\"https://aws.amazon.com/appstream2/pricing/\">pricing</a>. To get started with AppStream 2.0, see <a href=\"https://aws.amazon.com/appstream2/getting-started/\">Getting Started with Amazon AppStream 2.0</a>.<br /> <br /> To enable this feature for your users, you must use an AppStream 2.0 image that uses latest&nbsp;<a href=\"https://docs.aws.amazon.com/appstream2/latest/developerguide/base-images-agent.html\">AppStream 2.0 agent</a>&nbsp;or has been updated using&nbsp;<a href=\"https://docs.aws.amazon.com/appstream2/latest/developerguide/administer-images.html#keep-image-updated-managed-image-updates\">Managed AppStream 2.0 image updates</a> released on or after September 05, 2025.</p>", "company": "aws.amazon.com", "_k": "50835c3ea5dd083e072ba1e58dfab15ff015a8f8390de4ba55caae6979593bd3"}
{"title": "Amazon MSK Connect is now available in five additional AWS Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-msk-connect-five-additional-regions/", "published": "2025-09-26T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon MSK Connect is now available in five additional AWS Regions: Asia Pacific (Thailand), Asia Pacific (Taipei), Mexico (Central), Canada West (Calgary), and Europe (Spain). MSK Connect enables you to run fully managed Kafka Connect clusters with Amazon Managed Streaming for Apache Kafka (Amazon MSK). With a few clicks, MSK Connect allows you to easily deploy, monitor, and scale connectors that move data in and out of Apache Kafka and Amazon MSK clusters from external systems such as databases, file systems, and search indices. MSK Connect eliminates the need to provision and maintain cluster infrastructure. Connectors scale automatically in response to increases in usage and you pay only for the resources you use. With full compatibility with Kafka Connect, it is easy to migrate workloads without code changes. MSK Connect will support both Amazon MSK-managed and self-managed Apache Kafka clusters.<br /> <br /> You can get started with MSK Connect from the Amazon MSK console or the Amazon CLI. Visit the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">AWS Regions page</a> for all the regions where Amazon MSK is available. To get started visit, the MSK Connect <a href=\"https://aws.amazon.com/msk/features/msk-connect/\" target=\"_blank\">product page</a>, <a href=\"https://aws.amazon.com/msk/pricing/\" target=\"_blank\">pricing page</a>, and the <a href=\"https://docs.aws.amazon.com/msk/latest/developerguide/msk-connect.html\" target=\"_blank\">Amazon MSK Developer Guide</a>.</p>", "company": "aws.amazon.com", "_k": "dc3442ab33a584dddf1ed90604f3f2894372085332fbb91de26c8003782d0716"}
{"title": "AWS Clean Rooms supports incremental ID mapping with AWS Entity Resolution", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-clean-rooms-incremental-id-mapping-entity-resolution/", "published": "2025-09-26T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Clean Rooms now supports incremental processing of rule-based ID mapping workflows with AWS Entity Resolution. This helps you perform real-time data synchronization across collaborators’ datasets with the privacy-enhancing controls of AWS Clean Rooms. With this launch, you can populate ID mapping tables in a Clean Rooms collaboration with only the new, modified, or deleted records since the last analysis. Data collaborators can enable incremental processing for rule-based ID mapping workflows in AWS Entity Resolution, and then update an existing ID mapping table in a collaboration. For example, a measurement provider can maintain up-to-date offline purchase data in a collaboration with an advertiser and a publisher, enabling always-on measurement of campaign outcomes, reduced costs, and maintained privacy controls for all collaboration members.<br /> <br /> AWS Entity Resolution is natively integrated within AWS Clean Rooms to help you and your partners more easily prepare and match related customer records. Using rule-based or data service provider-based matching can help you improve data matching for enhanced advertising campaign planning, targeting, and measurement. For more information about the AWS Regions where AWS Clean Rooms is available, see the <a href=\"https://docs.aws.amazon.com/general/latest/gr/clean-rooms.html#clean-rooms_region\" target=\"_blank\">AWS Regions</a> table. To learn more about AWS Clean Rooms, visit <a href=\"https://aws.amazon.com/clean-rooms/\" target=\"_blank\">AWS Clean Rooms</a>.</p>", "company": "aws.amazon.com", "_k": "01ad411b32ef9130529877067e3dfefe8ac62f3e270740d9eb2ad82f0a1ce936"}
{"title": "Amazon EBS increases the maximum size and provisioned performance of General Purpose (gp3) volumes", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ebs-size-provisioned-performance-gp3-volumes/", "published": "2025-09-26T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Elastic Block Store (Amazon EBS) now supports higher volume-level limits for its General Purpose (gp3) volumes. With this update, gp3 volumes can scale up to 64 TiB in size (4X the previous 16 TiB limit), up to 80,000 IOPS (5X the previous 16,000 IOPS limit), and up to 2,000 MiB/s throughput (2X the previous 1,000 MiB/s limit).<br /> <br /> These expanded limits help reduce operational complexity for storage-intensive workloads by enabling gp3 volumes with larger capacity and higher performance. You can consolidate multiple striped volumes into a single gp3 volume, streamline architectures, and lower management overhead. The increased limits particularly benefit customers running containerized workloads with limited support for striping multiple volumes, applications that rely on single-volume architectures, and growing workloads approaching current gp3 limits. The pricing model remains unchanged: you pay for storage plus any additional IOPS and throughput provisioned beyond the baseline performance.<br /> <br /> The new gp3 limits are available in all AWS Commercial Regions and AWS GovCloud (US) Regions where gp3 volumes are available. To get started and learn more, please visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/ebs/latest/userguide/general-purpose.html\" style=\"cursor: pointer;\">Amazon EBS user guide</a>.</p>", "company": "aws.amazon.com", "_k": "57004e1f7395aac73ce83fd85b99bc6ca3c6a17d1f3dbd803b728f17ad869ca8"}
{"title": "AWS Compute Optimizer now supports 99 new Amazon EC2 instance types", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-compute-optimizer-99-new-amazon-ec2-instance-types/", "published": "2025-09-26T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Compute Optimizer now supports 99 additional Amazon Elastic Compute Cloud (Amazon EC2) instance types. These enhancements help you identify additional savings opportunities across your EC2 instances without specialized knowledge or manual analysis.<br /> <br /> Compute Optimizer has expanded support to include the latest generation Compute Optimized (C8gn, C8gd), General Purpose (M8i, M8i-flex, M8gd), Memory Optimized (R8i, R8i-flex, R8gd), and Storage Optimized (I8ge) instance types. This expansion enables Compute Optimizer to help you take advantage of the price-to-performance improvements offered by the newest instance types.<br /> <br /> This new feature is available in all <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Regions</a> where Compute Optimizer is available except the AWS GovCloud (US) and the China Regions. For more information about Compute Optimizer, visit our <a contenteditable=\"false\" href=\"https://aws.amazon.com/compute-optimizer/\" style=\"cursor: pointer;\">product page</a> and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/compute-optimizer/latest/ug/view-ec2-recommendations.html\" style=\"cursor: pointer;\">documentation</a>. You can start using Compute Optimizer through the AWS Management Console, AWS CLI, or AWS SDK.</p>", "company": "aws.amazon.com", "_k": "367a63426c4e9807a3e796826cafeca99991a3dc68bea6a103a41a044a014e8a"}
{"title": "Amazon RDS for Db2 now offers Reserved Instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-db2-offers-reserved-instances/", "published": "2025-09-26T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/db2/\" style=\"cursor: pointer;\" target=\"_blank\">Amazon Relational Database Service (RDS) for Db2</a> now offers Reserved Instances with up to 47% cost savings compared to On-Demand prices. The option to use Reserved Instances is available for all <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Db2.Concepts.General.InstanceClasses.html\" style=\"cursor: pointer;\" target=\"_blank\">supported instance types</a>.<br /> <br /> Amazon RDS for Db2 Reserved Instances provide size flexibility for both Bring Your Own License (BYOL) and Db2 license purchased through AWS Marketplace. With Reserved Instances size flexibility, the discounted rate for Reserved Instances automatically applies to usage of any size in the same instance family. For example, if you purchase a db.r7i.2xlarge Reserved Instance in US East (N. Virginia), the discounted rate of this Reserved Instance can automatically apply to 2 db.r7i.xlarge instances. For information on RDS Reserved Instances, refer to<a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/reserved-instances/\" style=\"cursor: pointer;\" target=\"_blank\"> Reserved DB instances for Amazon RDS.</a><br /> <br /> You can purchase Reserved Instances through the AWS Management Console, AWS CLI, or AWS SDK. For detailed pricing information and purchase options, refer to <a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/db2/pricing/\" style=\"cursor: pointer;\" target=\"_blank\">Amazon RDS for Db2 Pricing</a>.</p>", "company": "aws.amazon.com", "_k": "ea0fce527fca76e9347619d08c7b2e248f69c3086c1d201fa046527cefef441b"}
{"title": "AWS WAF Targeted Bot Control, Fraud & DDoS Prevention Rule Group available in 3 more regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-waf-targeted-bot-control-fraud-ddos-regions-expansion/", "published": "2025-09-26T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, AWS WAF’s Targeted Bot Control, Fraud, and DDoS Prevention Rule Group are available in the AWS Asia Pacific (Taipei), Asia Pacific (Bangkok), and Mexico (Central) regions. These features help customers to stay protected against sophisticated bots, application layer DDoS and account takeover attacks.</p> \n<p>AWS WAF is a web application firewall that helps you protect your web application resources against common web exploits and bots that can affect availability, compromise security, or consume excessive resources. </p> \n<p>To see the full list of regions where AWS WAF is currently available, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\" target=\"_blank\">AWS Region Table</a>. For more information about the service, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/waf/\" style=\"cursor: pointer;\" target=\"_blank\">AWS WAF</a> page. For more information about pricing, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/waf/pricing/\" style=\"cursor: pointer;\" target=\"_blank\">AWS WAF Pricing page</a>.</p>", "company": "aws.amazon.com", "_k": "1ef7060cad84df56122d74638cc3b43c1b9bc1233e79a69c6b5969a537c210ec"}
{"title": "Amazon Bedrock AgentCore Runtime, Browser, and Code Interpreter add support for VPC, AWS PrivateLink, CloudFormation, and tagging", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-bedrock-agentcore-runtime-browser-code-interpreter-vpc-privatelink-cloudformation-tagging/", "published": "2025-09-25T18:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Bedrock AgentCore Runtime, Browser, and Code Interpreter services now support Amazon Virtual Private Cloud (VPC) connectivity, AWS PrivateLink, AWS CloudFormation, and resource tagging, enabling developers to deploy AI agents with enhanced enterprise security and infrastructure automation capabilities. AgentCore Runtime enables you to deploy and scale dynamic AI agents securely using any framework, protocol, or model. AgentCore Browser enables web-based interactions such as form filling, data extraction, and QA testing, while AgentCore Code Interpreter provides secure execution of agent-generated code.<br /> <br /> With VPC support, you can now securely connect AgentCore Runtime, Browser, and Code Interpreter services to private resources such as databases, internal APIs, and services within your VPC without internet exposure. AWS PrivateLink provides private connectivity between your VPC and Amazon Bedrock AgentCore services, while CloudFormation support enables automated resource provisioning through infrastructure as code. Resource tagging allows you to implement comprehensive cost allocation, access control, and resource organization across your AgentCore deployments.<br /> <br /> Amazon Bedrock AgentCore is currently in preview and available in the following AWS Regions: US East (N. Virginia), US West (Oregon), Asia Pacific (Sydney), and Europe (Frankfurt).<br /> <br /> To learn more, see <a href=\"https://docs.aws.amazon.com/bedrock-agentcore/latest/devguide/agentcore-vpc.html\">Configuring VPC for AgentCore</a> and<a href=\"https://docs.aws.amazon.com/bedrock-agentcore/latest/devguide/vpc-interface-endpoints.html\"> Use Interface VPC endpoints (AWS PrivateLink)</a> with AgentCore. For CloudFormation resources, visit the <a href=\"https://docs.aws.amazon.com/AWSCloudFormation/latest/TemplateReference/AWS_BedrockAgentCore.html\">AgentCore CloudFormation Reference</a>, and to get started with tagging, see the <a href=\"https://docs.aws.amazon.com/bedrock-agentcore/latest/devguide/tagging.html\">Tagging AgentCore resources</a>.</p>", "company": "aws.amazon.com", "_k": "8409ec6d056c37ea4a4854916a9c6e4865a99b7ab3dae294abf76be25af051cb"}
{"title": "Amazon EC2 I7i instances now available in AWS Europe (Milan) and AWS US West (N. California)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-i7i-instances-available-in-milan-california/", "published": "2025-09-25T17:01:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS is announcing the availability of high performance Storage optimized Amazon EC2 I7i instances in AWS Europe (Milan) and US West (N. California) regions. Powered by 5th Gen Intel Xeon Processors with an all-core turbo frequency of 3.2 GHz, these new instances deliver up to 23% better compute performance and more than 10% better price performance over previous generation I4i instances. Powered by 3rd generation AWS Nitro SSDs, I7i instances offer up to 45TB of NVMe storage with up to 50% better real-time storage performance, up to 50% lower storage I/O latency, and up to 60% lower storage I/O latency variability compared to I4i instances.<br /> <br /> I7i instances offer compute and storage performance for x86-based storage optimized instances in Amazon EC2 ideal for I/O intensive and latency-sensitive workloads that demand very high random IOPS performance with real-time latency to access the small to medium size datasets. Additionally, torn write prevention feature support up to 16KB block sizes, enabling customers to eliminate database performance bottlenecks.<br /> <br /> I7i instances are available in eleven sizes - nine virtual sizes up to 48xlarge and two bare metal sizes - delivering up to 100Gbps of network bandwidth and 60Gbps of Amazon Elastic Block Store (EBS) bandwidth. To learn more, visit the I7i instances <a href=\"https://aws.amazon.com/ec2/instance-types/i7i/\" target=\"_blank\">page</a>.</p>", "company": "aws.amazon.com", "_k": "5cdff77bc47deeaca5f7f2bb540eba018e992008e41a37a5af54554ed7129c0c"}
{"title": "Amazon Redshift Concurrency Scaling is now available in 10 additional AWS regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-concurrency-scaling-additional-aws-regions/", "published": "2025-09-25T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Redshift Concurrency Scaling is now available in the AWS Africa (Cape Town), Asia Pacific (Hong Kong), Asia Pacific (Hyderabad), Asia Pacific (Jakarta), Asia Pacific (Osaka), Asia Pacific (Thailand), Europe (Milan), Middle East (Bahrain), Mexico (Central) and AWS GovCloud (US-West) regions. With the Amazon Redshift Concurrency Scaling feature, you can now support thousands of concurrent users and concurrent queries, with consistently fast query performance.<br /> <br /> Amazon Redshift Concurrency Scaling elastically scales query processing power to provide consistently fast performance for hundreds of concurrent queries. Concurrency Scaling resources are added to your Redshift cluster transparently in seconds, allowing for increased concurrency to process queries with minimal wait time. Amazon Redshift customers with an active Redshift cluster earn up to one hour of free Concurrency Scaling credits, which is sufficient for the concurrency needs of most customers. Concurrency scaling enables you to specify usage control, providing customers with predictable month-to-month costs, even during periods of fluctuating analytical demand.<br /> <br /> To enable Amazon Redshift Concurrency Scaling, set the Concurrency Scaling Mode to Auto in your <a href=\"https://console.aws.amazon.com/\" target=\"_blank\">Amazon Web Services Management Console</a>. You can allocate Concurrency Scaling usage to specific user groups and workloads, control the number of Concurrency Scaling clusters that can be used, and monitor Amazon CloudWatch performance and usage metrics.<br /> <br /> To learn more about concurrency scaling including regional-availability, see our <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/concurrency-scaling.html\" target=\"_blank\">documentation</a> and <a href=\"https://aws.amazon.com/redshift/pricing/\" target=\"_blank\">pricing page</a>.</p>", "company": "aws.amazon.com", "_k": "de69967d05d123f4b116e1c89658464114e863c5dec025ed2d053d7581771081"}
{"title": "AWS Network Firewall enhances application layer traffic controls", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-enhances-application-layer-traffic-controls/", "published": "2025-09-25T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/network-firewall/\">AWS Network Firewall</a>, a managed service that makes it easy to deploy essential network protections for your Amazon VPCs, now provides enhanced default rules to handle TLS client hellos, and HTTP requests split across multiple packets. This update introduces new application layer drop and alert established default stateful actions, enabling customers to maintain security controls while supporting modern TLS implementations and large HTTP requests.<br /> <br /> These enhancements help customers implement robust security policies without writing complex custom rules. Security teams can now effectively inspect and filter traffic where key information is segmented across multiple packets, while maintaining visibility through detailed logging options, making it easier to secure applications using modern protocols and encryption standards.<br /> <br /> This capability is available in all <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Regions</a> where AWS Network Firewall is supported.<br /> <br /> To learn more, refer to AWS Network Firewall service <a href=\"https://docs.aws.amazon.com/network-firewall/\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "c071021f9520259935e4b48f35b754d0cb63ad4755937bce0efcb68d0202a4c0"}
{"title": "Amazon EC2 C8gn instances are now available in additional regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-c8gn-instances-additional-regions/", "published": "2025-09-25T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, Amazon Elastic Compute Cloud (Amazon EC2) C8gn instances, powered by the latest-generation AWS Graviton4 processors, are available in the AWS Region Europe (Frankfurt, Stockholm), Asia Pacific (Singapore). The new instances provide up to 30% better compute performance than Graviton3-based Amazon EC2 C7gn instances. Amazon EC2 C8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.<br /> <br /> Take advantage of the enhanced networking capabilities of C8gn to scale performance and throughput, while optimizing the cost of running network-intensive workloads such as network virtual appliances, data analytics, CPU-based artificial intelligence and machine learning (AI/ML) inference.<br /> <br /> For increased scalability, C8gn instances offer instance sizes up to 48xlarge, up to 384 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). C8gn instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.<br /> <br /> C8gn instances are available in the following AWS Regions: US East (N. Virginia), US West (Oregon, N.California), Europe (Frankfurt, Stockholm), Asia Pacific (Singapore)<br /> <br /> To learn more, see <a href=\"https://aws.amazon.com/ec2/instance-types/c8g/\" target=\"_blank\">Amazon C8gn Instances</a>. To begin your Graviton journey, visit the <a href=\"https://aws.amazon.com/ec2/graviton/level-up-with-graviton/\" target=\"_blank\">Level up your compute with AWS Graviton page</a>. To get started, see <a href=\"https://console.aws.amazon.com/\" target=\"_blank\">AWS Management Console</a>, <a href=\"https://aws.amazon.com/cli/\" target=\"_blank\">AWS Command Line Interface (AWS CLI)</a>, and <a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\" target=\"_blank\">AWS SDKs</a>.</p>", "company": "aws.amazon.com", "_k": "187f474fd8a5db4338d3a36ef988aed60fd20f9cb74bb86e9022b2b7b8718a68"}
{"title": "Research and Engineering Studio on AWS 2025.09 is now available", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/research-engineering-studio-aws-2025-09-now-available/", "published": "2025-09-25T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today we’re announcing Research and Engineering Studio (RES) on AWS 2025.09, which brings support for fractional GPUs, simplified AMI management, and enhanced deployment flexibility. This release also expands regional availability to include four additional AWS commercial Regions.<br /> <br /> Research and Engineering Studio on AWS is an open source solution that provides a web-based portal for administrators to create and manage secure cloud-based research and engineering environments. RES enables scientists and engineers to access powerful Windows and Linux virtual desktops with pre-installed applications and shared resources, without requiring cloud expertise.<br /> <br /> Version 2025.09 adds support for Amazon EC2 g6f instances, <a href=\"https://aws.amazon.com/about-aws/whats-new/2025/07/amazon-ec2-g6f-instances-fractional-gpus/\" target=\"_blank\">enabling GPU fractionalization</a> for more efficient resource utilization in graphics-intensive workloads. The release also introduces Systems Manager Parameter Alias support for AMI IDs, simplifying the management of project-specific images, and enables integration with existing Amazon Cognito user pools for streamlined authentication setup during deployment. Administrators can now also customize CIDR ranges in the AWS CloudFormation external resources template for better network planning and integration with existing resources.<br /> <br /> This release expands regional availability to include Asia Pacific (Osaka), Asia Pacific (Jakarta), Middle East (UAE), and South America (São Paulo). To learn more about RES 2025.09, including detailed release notes and deployment instructions, visit the <a href=\"https://docs.aws.amazon.com/res/\" target=\"_blank\">Research and Engineering Studio documentation</a> or check out the <a href=\"https://github.com/aws/res/releases\" target=\"_blank\">RES GitHub repository</a>.</p>", "company": "aws.amazon.com", "_k": "d8c52b03ed4f414fdf6742448972a40c15b1304afb082fc09593e9ef0829494a"}
{"title": "Billing View now supports cost management data from multiple organizations", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/billing-view-cost-management-multiple-organizations/", "published": "2025-09-25T12:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the general availability of new capabilities within AWS Billing and Cost Management that enable customers to manage their AWS spend across multiple organizations through a single AWS account. Customers can now share custom billing views containing cost management data with other AWS accounts outside their organization. Additionally, customers can combine multiple custom billing views to create new consolidated views. These features enable FinOps teams to create custom billing views containing cost management data for multiple organizations. These views can then be used to access cost management data across multiple organizations through Cost Explorer or set up budgets to monitor AWS costs.</p> \n<p>With the new custom billing view capabilities, you can create consolidated views of cost management data spanning multiple organizations that can be accessed using AWS Cost Explorer and AWS Budgets, allowing you to monitor, analyze, and forecast spending patterns across multiple organizations. This helps customers operating multiple subsidiaries or business units as separate organizations on AWS manage their AWS spend through a single AWS account.</p> \n<p>Support for custom billing views containing cost management data for multiple organizations is available in all AWS Regions, excluding AWS GovCloud Regions and the AWS China Regions. To get started with custom billing views, visit Billing View within the Cost Management Preferences page in the AWS Billing and Cost Management console and create a new custom billing view.&nbsp;To get started visit the <a href=\"https://docs.aws.amazon.com/cost-management/latest/userguide/billing-view.html\" target=\"_blank\">Billing View user guide</a>.</p>", "company": "aws.amazon.com", "_k": "872fa5faab380492bbb39c875e45a17d4a6cdb9b2090883a0a0830c8df5123c6"}
{"title": "Amazon CloudWatch now supports resource tags when monitoring vended metrics", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-cloudwatch-tags-observability/", "published": "2025-09-25T09:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon CloudWatch announces support for a new tag-based telemetry experience to help customers monitor their metrics and set up their alarms using AWS resources tags. This new capability simplifies monitoring cloud infrastructure at scale by automatically adapting alarms and metrics analysis as resources change. DevOps engineers and cloud administrators can now create dynamic monitoring views that align with their organizational structure using their existing AWS resource tags.<br /> <br /> Tag-based querying filtering eliminates the manual overhead of updating alarms and dashboards after deployments, freeing teams to focus on innovation rather than maintenance. This provides faster, targeted insights that match how teams organize their systems. Teams can query AWS default metrics using their existing resource tags, making it easier to troubleshoot issues and maintain operational visibility while focusing on core business initiatives.<br /> <br /> CloudWatch tag-based filtering is available in the following regions: US East (N. Virginia); US East (Ohio); US West (N. California); US West (Oregon); Asia Pacific (Tokyo); Asia Pacific (Seoul); Asia Pacific (Singapore); Asia Pacific (Sydney); Asia Pacific (Mumbai); Asia Pacific (Osaka); Canada (Central); Europe (Frankfurt); Europe (Ireland); Europe (London); Europe (Paris); Europe (Stockholm) and South America (São Paulo).<br /> <br /> To get started, simply enable tag enriched telemetry with one click in the <a href=\"https://console.aws.amazon.com/cloudwatch/\" target=\"_blank\">Amazon CloudWatch</a> Settings, or through the <a href=\"https://aws.amazon.com/cli/\" target=\"_blank\">AWS Command Line Interface (AWS CLI)</a>, and <a href=\"https://aws.amazon.com/tools/\" target=\"_blank\">AWS SDKs</a> to use your existing AWS resource tags to monitor your infrastructure. Learn more on the <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/monitoring/query_with_cloudwatch-metrics-insights.html\" target=\"_blank\">Amazon CloudWatch documentation</a> page.</p>", "company": "aws.amazon.com", "_k": "716ebb3fbd2a76ecbd825c1fe7aab232ccde19f87d1b637cbf4a78615a40650a"}
{"title": "AWS X-Ray introduces Adaptive Sampling for automatic optimized error detection", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-x-ray-adaptive-sampling-automatic-error/", "published": "2025-09-25T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a contenteditable=\"false\" href=\"https://aws.amazon.com/xray/\" style=\"cursor: pointer;\">AWS X-Ray</a>, a service that helps developers analyze and debug distributed applications by providing request tracing capabilities, now offers adaptive sampling to solve a common challenge for DevOps teams, Site Reliability Engineers (SREs), and application developers. These customers often face a difficult trade-off: setting sampling rates too low risks missing critical traces during incidents, while setting them too high unnecessarily increases observability costs during normal operations.&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br /> Today, with adaptive sampling, you can automatically adjust sampling rates within user-defined limits to ensure you capture the most important traces precisely when you need them. This helps development teams reduce mean time to resolution (MTTR) during incidents by providing comprehensive trace data for root cause analysis, while maintaining cost-efficient sampling rates during normal operations. Adaptive sampling supports two approaches, Sampling Boost and Anomaly Span Capture. These can be applied independently or can be combined together. Customers can use Sampling Boost to temporarily increase sampling rates when anomalies are detected to capture complete traces and Anomaly Span Capture to ensures anomaly-related spans are always captured, even when the full trace isn't sampled.<br /> Adaptive sampling is currently available in all commercial regions where AWS X-Ray is offered. For more information, see the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/xray/latest/devguide/xray-adaptive-sampling.html\" style=\"cursor: pointer;\">X-Ray documentation.</a> and CloudWatch <a contenteditable=\"false\" href=\"https://aws.amazon.com/cloudwatch/pricing/\" style=\"cursor: pointer;\">pricing page</a> for X-ray pricing details.</p>", "company": "aws.amazon.com", "_k": "65202780f306b2828805225729d231018783a4f70e3cf26416d92c27db8a20c0"}
{"title": "Amazon EC2 Allowed AMIs setting adds new parameters for enhanced AMI governance", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-allowed-amis-setting-parameters-ami-governance/", "published": "2025-09-25T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Allowed AMIs, the Amazon EC2 account-wide setting that enables you to limit the discovery and use of Amazon Machine Images (AMIs) within your Amazon Web Services accounts, adds support for four new parameters — marketplace codes, deprecation time, creation date and AMI names.<br /> <br /> Previously, you could specify accounts or owner aliases that you trust in your Allowed AMIs setting. Starting today, you can use the four new parameters to define additional criteria to further reduce risk of inadvertently launching instances with non-compliant or unauthorized AMIs. Marketplace codes can be provided to limit the use of Marketplace AMIs, the deprecation time and creation date parameters can be used to limit the use of outdated AMIs, and AMI name parameter can be used to restrict usage to AMIs with specific naming pattern. You can also leverage Declarative Policies to configure these parameters to perform AMI governance across your organization.<br /> <br /> These additional parameters are now supported in all AWS regions including AWS China (Beijing) Region, operated by Sinnet, and AWS China (Ningxia) Region, operated by NWCD, and AWS GovCloud (US). To learn more, please visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-allowed-amis.html\" style=\"cursor: pointer;\" target=\"_blank\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "b6b7086916cb8cddf8bdfe437fe478b678140eaf89609cdb358257a5944987cc"}
{"title": "You can now preview Amazon S3 Tables in the S3 console", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/preview-amazon-s3-tables-console/", "published": "2025-09-25T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>You can now preview your Amazon S3 Tables directly in the S3 console without having to write a SQL query. You can view the schema and sample rows of your tables stored in S3 Tables to better understand and gather key information about your data quickly, without any setup.</p> \n<p>You can preview tables in the S3 console in <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables-regions-quotas.html\" style=\"cursor: pointer;\" target=\"_blank\">all AWS Regions where S3 Tables are available</a>. You only pay for S3 requests to read a portion of your table. See <a contenteditable=\"false\" href=\"https://aws.amazon.com/s3/pricing/\" style=\"cursor: pointer;\" target=\"_blank\">Amazon S3 pricing</a> and the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/s3-tables.html\" style=\"cursor: pointer;\" target=\"_blank\">S3 User Guide</a> for pricing details and to learn more.</p>", "company": "aws.amazon.com", "_k": "f24aa44c7ddeb92697b1b91d5c9901469f5ad23e3614159678892e9e51275c57"}
{"title": "PostgreSQL 18.0 is now available in Amazon RDS Database Preview Environment", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/postgresql-180-amazon-rds-database-preview-environment/", "published": "2025-09-25T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/rds/postgresql/\">Amazon RDS for PostgreSQL</a> 18.0 is now available in the<a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/create-db-instance-in-preview-environment.html\"> Amazon RDS Database Preview Environment,</a> allowing you to evaluate the latest PostgreSQL features while leveraging the benefits of a fully managed database service. This preview environment provides you a sandbox where you can test applications and explore new PostgreSQL 18.0 capabilities before they become generally available.</p> \n<p>PostgreSQL 18.0 includes \"skip scan\" support for multicolumn B-tree indexes and improves WHERE clause handling for OR and IN conditions. It introduces parallel Generalized Inverted Index (GIN) builds and updates join operations. It now supports Universally Unique Identifiers Version 7 (UUIDv7), which combines timestamp-based ordering with traditional UUID uniqueness to boost performance in high-throughput distributed systems. Observability improvements show buffer usage counts and index lookups during query execution, along with per-connection I/O utilization metric. Please refer to the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/PostgreSQLReleaseNotes/postgresql-versions.html#postgresql-version18\">RDS PostgreSQL release documentation</a> for more details.</p> \n<p>Amazon RDS Database Preview Environment database instances are retained for a maximum period of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots that are created in the preview environment can only be used to create or restore database instances within the preview environment. You can use the PostgreSQL dump and load functionality to import or export your databases from the preview environment.</p> \n<p>Amazon RDS Database Preview Environment database instances are priced as per the <a href=\"https://aws.amazon.com/rds/postgresql/pricing/\">pricing</a> in the US East (Ohio) Region.</p>", "company": "aws.amazon.com", "_k": "c74d455f736fcee79bb30983797b33ad0f65d7a9f523423882c0c5ac6e273d9b"}
{"title": "Announcing AWS Lambda Support for Code Signing in GovCloud Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-lambda-code-signing-govcloud/", "published": "2025-09-24T20:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Lambda now offers Code Signing in GovCloud Regions (AWS GovCloud (US-West) and AWS GovCloud (US-East)), which allows administrators to ensure that only trusted and verified code is deployed to Lambda functions. This feature uses AWS Signer, a managed code signing service. When code is deployed, Lambda checks the signatures to confirm the code hasn't been altered and is signed by trusted developers.<br /> <br /> Administrators can create Signing Profiles in AWS Signer and use AWS Identity and Access Management (IAM) to manage user access. Within Lambda, they can specify allowed signing profiles for each function and configure whether to warn or reject deployments if signature checks fail.<br /> <br /> There is no extra charge for using this feature. For more details, you can refer to <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">the AWS Region table</a>, <a href=\"https://aws.amazon.com/blogs/aws/new-code-signing-a-trust-and-integrity-control-for-aws-lambda/\" target=\"_blank\">the AWS blog</a>, <a href=\"https://aws.amazon.com/blogs/aws/new-code-signing-a-trust-and-integrity-control-for-aws-lambda/\" target=\"_blank\">the Lambda developer guide</a>, or <a href=\"https://docs.aws.amazon.com/signer/latest/developerguide/lambda-workflow.html\" target=\"_blank\">the Signer developer guide</a>.</p>", "company": "aws.amazon.com", "_k": "9e9da18b08a5c0fe455e75b5e22f407015296f87510b876ec010f65345e83e2d"}
{"title": "Application Recovery Controller Region switch is now available in Asia Pacific (New Zealand)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/application-recovery-controller-region-switch-new-zealand/", "published": "2025-09-24T15:03:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Region switch in Amazon Application Recovery Controller (ARC) is now available in the Asia Pacific (New Zealand) Region. Region switch allows you to orchestrate the specific steps to operate your cross-AWS account application resources out of another AWS Region. It provides dashboards for real-time visibility into the recovery process and gathers data from across resources and accounts required for reporting to regulators and compliance teams. Region switch supports failover and failback for active/passive multi-Region approaches, and shift-away and return for active/active multi-Region approaches. When you create a Region switch plan, it is replicated to all the Regions your application operates in. This removes dependencies on the Region you are leaving for your recovery.<br /> <br /> To get started, build a Region switch plan using the ARC console, API, or CLI. To learn more, visit the <a href=\"https://docs.aws.amazon.com/r53recovery/latest/dg/region-switch.html\">ARC Region switch documentation</a> and <a href=\"https://aws.amazon.com/application-recovery-controller/pricing/\">pricing page</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "2d7c886aad2eb3c444f73441b7fdce3919806f42533a1c71688d2df65026dcf8"}
{"title": "Amazon Route 53 Resolver Query Logging now available in Asia Pacific (New Zealand)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-route-53-resolver-query-logging-available-asia-pacific-nz/", "published": "2025-09-24T07:34:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, we are announcing the availability of Route 53 Resolver Query Logging in&nbsp;Asia Pacific (New Zealand), enabling you to log DNS queries that originate in your Amazon Virtual Private Cloud (Amazon VPC). With query logging enabled, you can see which domain names have been queried, the AWS resources from which the queries originated - including source IP and instance ID - and the responses that were received.&nbsp;<br /> <br /> Route 53 Resolver is the Amazon provided DNS server that is available by default in all Amazon VPCs. Route 53 Resolver responds to DNS queries from AWS resources within a VPC for public DNS records, Amazon VPC-specific DNS names, and Amazon Route 53 private hosted zones. With Route 53 Resolver Query Logging, customers can log DNS queries and responses for queries originating from within their VPCs, whether those queries are answered locally by Route 53 Resolver, or are resolved over the public internet, or are forwarded to on-premises DNS servers via&nbsp;<a href=\"https://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resolver.html\" target=\"_blank\">Resolver Endpoints</a>. You can share your query logging configurations across multiple accounts using&nbsp;<a href=\"https://aws.amazon.com/ram/\" target=\"_blank\">AWS Resource Access Manager (RAM)</a>. You can also choose to send your query logs to Amazon S3, Amazon CloudWatch Logs, or Amazon Data Firehose.&nbsp;<br /> <br /> There is no additional charge to use Route 53 Resolver Query Logging, although you may incur usage charges from Amazon S3, Amazon CloudWatch, or Amazon Data Firehose. To learn more about Route 53 Resolver Query Logging or to get started, visit the&nbsp;<a href=\"https://aws.amazon.com/route53/resolver/\" target=\"_blank\">Route 53 Resolver product page</a>&nbsp;or the&nbsp;<a href=\"https://docs.aws.amazon.com/Route53/latest/DeveloperGuide/resolver-query-logs.html\" target=\"_blank\">Route 53 documentation</a>.</p>", "company": "aws.amazon.com", "_k": "31e57196fca706b98125ec9b2ff864fdaf2005fa592f409d181750a4a7cb2ebb"}
{"title": "Amazon GameLift Servers launches a new Local Zone in Dallas, Texas", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-gamelift-servers-local-zone-dallas-texas/", "published": "2025-09-24T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon GameLift Servers now supports a new AWS Local Zone in Dallas, Texas (us-east-1-dfw-2). You can use this Local Zone to deploy GameLift Fleets with EC2 C6gn, C6i, C6in, M6g, M6i, M6in, M8g, and R6i instances. Local Zones place AWS services closer to major player population and IT centers where no AWS region exists. From the Amazon GameLift Servers Console, you can enable the Dallas Local Zone and add it to your fleets, just as you would with any other Region or Local Zone.<br /> <br /> With this launch, game studios can run latency-sensitive workloads such as real-time multiplayer gaming, responsive AR/VR experiences, and competitive tournaments closer to players in the Dallas metro area. Local Zones help deliver single-digit millisecond latency, giving players a smoother, more responsive experience by reducing network distance between your servers and players.<br /> <br /> For more information on AWS Local Zones, please see <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/\" style=\"cursor: pointer;\">here</a>. To see a complete list of supported regions and local zones for Amazon GameLift Servers, visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/gameliftservers/latest/developerguide/gamelift-regions.html#gamelift-regions-hosting-home\" style=\"cursor: pointer;\">Amazon GameLift Servers documentation</a>. For pricing, please visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/gamelift/servers/pricing/instance-pricing/\" style=\"cursor: pointer;\">Amazon GameLift Servers Instance Pricing page</a>.</p>", "company": "aws.amazon.com", "_k": "d32e17aeb5f1dae84e4c3a37a766d2fda32645c071a98c1eb9f4c3ed5d7ec3f0"}
{"title": "AWS announces unlimited network burst duration on EC2 I8g and I7i instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-announces-unlimited-network-burst-duration-i8g-i7i/", "published": "2025-09-24T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS eliminated the networking bandwidth burst duration limitations for Amazon EC2 I7i and I8g instances on sizes larger than 4xlarge. This update doubles the Network Bandwidth available at all times for i7i and i8g instances on sizes larger than 4xlarge. Previously, these instance sizes had a baseline bandwidth and used a network I/O credit mechanism to <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/ec2/latest/instancetypes/so.html#so_network\" style=\"cursor: pointer;\">burst beyond their baseline bandwidth</a> on a best effort basis. Today these instance sizes can sustain their maximum performance indefinitely. With this improvement, customers running memory and network intensive workloads on larger instance sizes can now consistently maintain their maximum network bandwidth without interruption, delivering more predictable performance for applications that require sustained high-throughput network connectivity. This change applies only to instance sizes larger than 4xlarge, while smaller instances will continue to operate with their existing baseline and burst bandwidth configurations.</p> \n<p>Amazon EC2 I7i and I8g instances are designed for I/O intensive workloads that require rapid data access and real-time latency from storage. These instances excel at handling transactional, real-time, distributed databases, including MySQL, PostgreSQL, Hbase and NoSQL solutions like Aerospike, MongoDB, ClickHouse, and Apache Druid. They're also optimized for real-time analytics platforms such as Apache Spark, data lakehouse, and AI LLM pre-processing for training. These instances have up to 1.5 TiB of memory, and 45 TB local instance storage. They deliver up to 100 Gbps of network performance bandwidth, and 60 Gbps of dedicated bandwidth for Amazon Elastic Block Store (EBS).</p> \n<p>To learn more, see Amazon EC2 <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/i7i/\" style=\"cursor: pointer;\">I7i</a> and <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/i8g/\" style=\"cursor: pointer;\">I8g</a> instances. To get started, see <a contenteditable=\"false\" href=\"https://console.aws.amazon.com/\" style=\"cursor: pointer;\">AWS Management Console</a>, <a contenteditable=\"false\" href=\"https://aws.amazon.com/cli/\" style=\"cursor: pointer;\">AWS Command Line Interface (AWS CLI)</a>, and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\" style=\"cursor: pointer;\">AWS SDKs</a>.</p>", "company": "aws.amazon.com", "_k": "2876e2bc00e420f064bb35b78a4a55e907eea57837a29054007fb8acbd135a69"}
{"title": "Amazon EC2 Auto Scaling now supports forced cancellation of instance refreshes", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-auto-scaling-forced-cancellation-instance/", "published": "2025-09-24T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon EC2 Auto Scaling now enables customers to force cancel instance refreshes immediately, without waiting for in-progress instance launches or terminations to complete. This enhancement provides greater control over Auto Scaling group (ASG) updates, especially during emergency situations such as when needing to rapidly roll forward to a new application deployment when the current deployment is causing service disruptions. Customers can now quickly abort ongoing deployments and immediately start new instance refreshes when needed.<br /> <br /> Instance refreshes are used to update instances within an ASG, typically when configuration changes require instance replacement. To use this feature, set the WaitForTransitioningInstances to false when calling the CancelInstanceRefresh API. This enables faster cancellation of the instance refresh, bypassing the wait for any pending instance activities such as instance lifecycle hooks.<br /> <br /> This feature is available in all AWS regions, including AWS GovCloud (US) Regions. To get started, please visit <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/autoscaling/ec2/userguide/cancel-instance-refresh.html#cancel-instance-refresh-cli\" style=\"cursor: pointer;\">Amazon EC2 Auto Scaling user guide</a>.</p>", "company": "aws.amazon.com", "_k": "b58a1af69122434f2f09ee96a51675d541e88cbe58e6d9c6f312e57d95fd4a93"}
{"title": "Amazon DataZone is now available in 3 additional commercial regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-datazone-additional-regions/", "published": "2025-09-23T18:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon DataZone is now available in AWS Asia Pacific (Hong Kong), Asia Pacific (Malaysia) and Europe (Zurich) Regions.<br /> <br /> Amazon DataZone is a fully managed data management service to catalog, discover, analyze, share, and govern data between data producers and consumers in your organization. With Amazon DataZone, data producers populate the business data catalog with structured data assets from AWS Glue Data Catalog and Amazon Redshift tables. Data consumers search and subscribe to data assets in the data catalog and share with other collaborators working on the same business use case. Consumers can analyze their subscribed data assets with tools—such as Amazon Redshift or Amazon Athena query editors—that are directly accessed from the Amazon DataZone portal. The integrated publishing and subscription workflow provides access to auditing capabilities across projects.<br /> <br /> For more information on AWS Regions where Amazon DataZone is available in preview, see <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">supported regions</a>.</p> \n<p>Additionally, Amazon DataZone powers governance in the next generation of Amazon SageMaker, which simplifies the discovery, governance, and collaboration of data and AI across your lakehouse, AI models, and GenAI applications. With Amazon SageMaker Catalog (built on Amazon DataZone), users can securely discover and access approved data and models using semantic search with generative AI–created metadata, or they could just ask Amazon Q Developer using natural language to find their data. For more information on AWS Regions where the next generation of SageMaker is available, see <a href=\"https://docs.aws.amazon.com/sagemaker-unified-studio/latest/adminguide/supported-regions.html\">supported regions</a>. To learn more about the next generation of SageMaker, visit the <a href=\"https://aws.amazon.com/sagemaker/\">product webpage</a>.</p>", "company": "aws.amazon.com", "_k": "56943fec62dc0b1a9fa674f1236a453fd2254f4af85142db23294da07809f0c3"}
{"title": "AWS License Manager now supports shared AWS Managed Active Directory", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-license-manager-shared-managed-active-directory/", "published": "2025-09-23T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS License Manager announces support for shared AWS Managed Active Directory across multiple AWS accounts, simplifying Microsoft license management on AWS. Customers can now centralize user subscriptions of Microsoft Office, Visual Studio, and Remote Desktop Service instances running in their AWS Organization while maintaining clear visibility across AWS accounts.<br /> <br /> With this launch, customers are no longer required to setup a Managed Active Directory instance for each AWS Account, reducing duplicate directories and IT overhead. Customers can now manage licenses through a single admin account where users subscribe once, and their subscriptions will extend to directory consumer accounts. The new feature is available in <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">all commercial regions</a> where License Manager user subscription is supported.<br /> <br /> To get started, customers can onboard their shared AWS Managed Active Directory through AWS License Manager console. For more information and to begin using this feature, visit the <a href=\"https://aws.amazon.com/license-manager/\" target=\"_blank\">AWS License Manager page</a> or <a href=\"https://docs.aws.amazon.com/license-manager/\" target=\"_blank\">AWS License Manager User Guide</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "9290f303cff5e407c77507c0d7e17bcd8e44541b5e8fa4249095a2c48050d2b8"}
{"title": "AWS IAM Identity Center organization instances now support customer-managed KMS keys for encryption at rest", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-iam-identity-center-organization-customer-managed-kms-keys-encryption-at-rest/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>IAM Identity Center now supports customer-managed AWS Key Management Service (KMS) keys for encrypting workforce identity data, including user and group attributes. While AWS-owned keys are used by default, customer-managed keys (CMKs) provide granular control over identity data access, enhancing security and compliance capabilities. IAM Identity Center helps you securely create, or connect, your workforce identities and manage their access centrally across AWS applications and accounts.<br /> <br /> You create a CMK and manage its lifecycle and usage permissions in AWS KMS. You can configure the CMK in your IAM Identity Center instance either while enabling a new organization instance or on an existing one. You can then use AWS CloudTrail to monitor and audit the usage of your CMK for access to identity data in IAM Identity Center.<br /> <br /> Support for CMKs in organization instances of IAM Identity Center is now available for access to accounts and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/awsapps-that-work-with-identity-center.html\" style=\"cursor: pointer;\">select AWS applications</a> in all <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Regions</a> where IAM Identity Center is available. Standard AWS KMS <a contenteditable=\"false\" href=\"https://aws.amazon.com/kms/pricing/\" style=\"cursor: pointer;\">charges</a> apply to storing and using CMKs. IAM Identity Center is provided at no additional cost.<br /> <br /> To learn more about IAM Identity Center, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/iam/identity-center/\" style=\"cursor: pointer;\">product detail page</a>. To get started with using CMKs, please refer to the IAM Identity Center <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/encryption-at-rest.html\" style=\"cursor: pointer;\">User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "46f653f625ba70c8c3b87ae7aa0225d8aed8d16fe61ed0518f066c68c4cb1432"}
{"title": "Amazon Nova Act extension: Build and test AI agents within your IDE", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-nova-act-extension-build-test-ai-agents-ide/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>We’re excited today to announce the Amazon Nova Act extension - a tool that transforms how you build with Nova Act by bringing the entire agent development experience directly into IDEs like Visual Studio Code, Kiro, and Cursor. The Nova Act extension consolidates natural language based script creation, granular scripting precision, and robust browser testing into a single, unified user interface, eliminating the need to switch between multiple tools across development, validation, and iteration.<br /> <br /> The Nova Act extension is built on top of the Nova Act SDK, available in research preview since March 2025. The Nova Act extension addresses feedback we have received from developers and consolidates the agent development lifecycle, from ideation to production, into one unified user interface within your IDE.<br /> <br /> The Nova Act extension is available today from your IDE’s extension marketplace. The <a contenteditable=\"false\" href=\"https://github.com/aws/nova-act-extension\" style=\"cursor: pointer;\">Nova Act GitHub repository</a> includes documentation and examples to get started.<br /> <br /> Learn more about the Nova Act extension and see the Nova Act extension in action <a contenteditable=\"false\" href=\"https://aws.amazon.com/blogs/aws/accelerate-ai-agent-development-with-the-nova-act-ide-extension\" style=\"cursor: pointer;\">at our blog post</a>.</p>", "company": "aws.amazon.com", "_k": "3d6dda349dcc001e968d77a44f83c81330f46f59f791f6ebb4636bcc037dce0b"}
{"title": "Amazon RDS announces cross-Region and cross-account snapshot copy", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-cross-region-cross-account-snapshot-copy/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon RDS now supports cross-Region and cross-account copying of Amazon RDS and Amazon Aurora snapshots. This launch allows you to copy snapshots across Regions and accounts directly without performing it sequentially as two separate copies.</p> \n<p>Customers use cross-Region and cross-account snapshot copies for managing the risk of incidents such as ransomware attacks and region outages affecting their production accounts or primary Regions. Previously, customers that copied snapshots cross-Region and cross-account did so in a two step process that involved first copying the snapshot to a different Region and then to a different account or vice versa. Now, by performing this action in a single step, customers eliminate an intermediate snapshot copy, thereby meeting a high recovery point objective (RPO) as well as saving costs associated with the intermediate copy. Additionally, customers that currently use custom scripts or services such as a Lambda for monitoring the status of the intermediate copy, to then trigger the second copy, can simplify these workflows by eliminating this process.</p> \n<p>Cross-Region and cross-account snapshot copy is available on all Amazon RDS and Amazon Aurora engines in all AWS Regions, including the AWS China Regions and AWS GovCloud (US) Regions. You can start using this feature today through the AWS Management Console, AWS Command Line Interface (CLI), or AWS SDKs. To get started, refer the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_CopySnapshot.html\">Amazon RDS</a> or <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/aurora-copy-snapshot.html\">Amazon Aurora</a> documentation.&nbsp;</p>", "company": "aws.amazon.com", "_k": "049f700c18ce6cc189ca3f5299eb20dfb62a944fdb7094c9c050a97a9e62932f"}
{"title": "AWS announces EC2 instance attestation", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-announces-ec2-instance-attestation/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS announces the general availability of EC2 instance attestation to make it easier for customers to validate that only trusted software is running on their EC2 instances, including instances with AI chips and GPUs.<br /> <br /> Before this, customers could configure their EC2 instances to remove operator access from their own administrators and users, but there was no way for customers to verify that a target EC2 instance had that configuration. With EC2 instance attestation, customers can cryptographically verify that their EC2 instances are running trusted configurations and software.<br /> <br /> EC2 instance attestation is powered by Nitro Trusted Platform Module (NitroTPM) and Attestable Amazon Machine Images (AMIs). Customers can build an AMI that includes a cryptographic measurement representing all the contents of that AMI. Using NitroTPM, customers can then verify whether a target EC2 instance has the same measurement as the reference measurement generated by the AMI. EC2 instance attestation integrates with AWS Key Management Service (KMS), allowing customers to restrict key operations to instances that pass specific attestation conditions.<br /> <br /> EC2 instance attestation is available in all AWS Commercial Regions, including the AWS GovCloud (US) Regions.<br /> <br /> To get started with EC2 instance attestation, see this <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/nitrotpm-attestation.html\" style=\"cursor: pointer;\">user guide</a>. To build an Amazon Linux 2023 Attested AMI, see this <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/attestable-ami.html\" style=\"cursor: pointer;\">user guide</a>.</p>", "company": "aws.amazon.com", "_k": "b2e044943ad84089e7ad8f4062e7134aac462d460be3d2336b1eef71e1927f9b"}
{"title": "Amazon EC2 R8gb instances are now generally available", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-r8gb-instances/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the general availability of the new Amazon Elastic Block Storage (Amazon EBS) optimized Amazon Elastic Compute Cloud (Amazon EC2) R8gb instances. These instances are powered by AWS Graviton4 processors to deliver up to 30% better compute performance than AWS Graviton3 processors. At up to 150 Gbps of EBS bandwidth, these instances offer higher EBS performance compared to same-sized equivalent Graviton4-based instances. Take advantage of the higher block storage performance offered by these new EBS optimized EC2 instances to scale the performance and throughput of workloads such as high performance databases and NoSQL databases, while optimizing the cost of running your workloads.</p> \n<p>For increased scalability, these instances offer instance sizes up to 24xlarge, including one metal size, up to 768 GiB of memory, up to 150 Gbps of EBS bandwidth, up to 200 Gbps of networking bandwidth. These instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, and metal-24xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.</p> \n<p>The new R8gb instances are available in US East (N. Virginia) and US West (Oregon) regions. Metal sizes are only available in US East (N. Virginia) region.</p> \n<p>To learn more, see Amazon <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/r8g\" style=\"cursor: pointer;\">R8gb</a> Instances. To begin your Graviton journey, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/graviton/level-up-with-graviton/\" style=\"cursor: pointer;\">Level up your compute with AWS Graviton page</a>. To get started, see <a contenteditable=\"false\" href=\"https://console.aws.amazon.com/\" style=\"cursor: pointer;\">AWS Management Console</a>, <a contenteditable=\"false\" href=\"https://aws.amazon.com/cli/\" style=\"cursor: pointer;\">AWS Command Line Interface (AWS CLI)</a>, and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\" style=\"cursor: pointer;\">AWS SDKs</a>.</p>", "company": "aws.amazon.com", "_k": "cb99c8186346e7f159f3b6a4d0bcc1ca59cc1f060b3b13f341ccb9a533d70a48"}
{"title": "Amazon Connect now supports you to associate custom attributes with interaction segments", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-associate-custom-attributes-interaction-segments/", "published": "2025-09-23T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect now supports you to associate custom attributes with interaction segments, ensuring reporting and analytics always reflect the true customer journey. Attributes such as business unit name, account type, or contact reason can be centrally managed with predetermined values and applied to contact records through flows or the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/connect/latest/APIReference/API_UpdateContact.html\" style=\"cursor: pointer;\">UpdateContact API</a>. This approach preserves accurate business context throughout customer journeys, particularly during transfers and multi-party communications. For example, a customer engagement that originates in the Support business unit and transitions to Sales: each distinct interaction segment maintains its precise business unit name, creating an accurate and comprehensive record of the customer journey.<br /> <br /> This feature is available in all <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS regions</a> where Amazon Connect is available. To learn more about using predefined attributes as contact segment attributes, see the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/connect/latest/adminguide/use-contact-segment-attributes.html\" style=\"cursor: pointer;\" target=\"_blank\">Amazon Connect Administrator Guide.</a> To learn more about Amazon Connect, the AWS contact center as a service solution on the cloud, please visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/connect/\" style=\"cursor: pointer;\">Amazon Connect website</a>.</p>", "company": "aws.amazon.com", "_k": "48a36b078da6b385a5722f2505e548be20ce6714f215e9d21ccc82ed88938217"}
{"title": "Amazon Redshift Serverless is now available in the AWS Asia Paciﬁc (Taipei) region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-serverless-asia-pacific-taipei/", "published": "2025-09-23T04:01:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/redshift/redshift-serverless/\">Amazon Redshift Serverless</a>, which allows you to run and scale analytics without having to provision and manage data warehouse clusters, is now generally available in the AWS Asia Paciﬁc(Taipei) region. With Amazon Redshift Serverless, all users, including data analysts, developers, and data scientists, can use Amazon Redshift to get insights from data in seconds. Amazon Redshift Serverless automatically provisions and intelligently scales data warehouse capacity to deliver high performance for all your analytics. You only pay for the compute used for the duration of the workloads on a per-second basis. You can benefit from this simplicity without making any changes to your existing analytics and business intelligence applications.<br /> <br /> With a few clicks in the AWS Management Console, you can get started with querying data using the Query Editor V2 or your tool of choice with Amazon Redshift Serverless. There is no need to choose node types, node count, workload management, scaling, and other manual configurations. You can create databases, schemas, and tables, and load your own data from Amazon S3, access data using Amazon Redshift data shares, or restore an existing Amazon Redshift provisioned cluster snapshot. With Amazon Redshift Serverless, you can directly query data in open formats, such as Apache Parquet, in Amazon S3 data lakes. Amazon Redshift Serverless provides unified billing for queries on any of these data sources, helping you efficiently monitor and manage costs.<br /> <br /> To get started, see the Amazon Redshift Serverless <a href=\"https://aws.amazon.com/redshift/redshift-serverless/\">feature page</a>, <a href=\"https://docs.aws.amazon.com/redshift/latest/mgmt/working-with-serverless.html\">user documentation</a>, and <a href=\"https://docs.aws.amazon.com/redshift-serverless/latest/APIReference/Welcome.html\">API Reference</a>.</p>", "company": "aws.amazon.com", "_k": "bbb0d403a6bcf2803f9ac521449be4ce8a3f4bd5d7f348447db759911cd4b4ed"}
{"title": "Amazon Connect Contact Lens now provides sensitive data redaction in 7 additional languages", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-contact-lens-redaction-7-languages/", "published": "2025-09-22T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect Contact Lens now provides sensitive data redaction from voice and chat conversational analytics in French (France, Canada), Portuguese (Portugal, Brazil), Italian, German, and Spanish (Spain). Automatic redaction of sensitive data redaction helps you protect your customer's privacy by removing personally identifiable information (PII), financial account numbers and PINs, and Internet access details (URLs, usernames, passwords) from conversation transcripts and audio files. You can choose to redact selected or all sensitive data entities, and whether they are replaced with a generic placeholder (e.g., [PII]) or an entity-specific placeholder (e.g., [NAME]) to indicate the type of information redacted.<br /> <br /> Amazon Connect is an AI-powered application that provides one seamless experience for your contact center customers and users. Contact Lens provides conversational analytics that enable you to monitor, measure, and continuously improve contact quality and agent performance for a better overall customer experience.<br /> <br /> Sensitive data redaction is available in all <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/regions.html#contactlens_region\">AWS Regions</a> where Amazon Connect is available. For more information, refer to the following list of resources:<br /> </p> \n<ul> \n <li><a href=\"https://aws.amazon.com/connect/contact-lens/\">Amazon Connect Contact Lens</a> and <a href=\"https://aws.amazon.com/connect/pricing/\">pricing</a></li> \n <li><a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/enable-analytics.html#enable-redaction\">Enable redaction of sensitive information</a></li> \n <li><a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/supported-languages.html#supported-languages-contact-lens\">Supported languages</a></li> \n</ul>", "company": "aws.amazon.com", "_k": "ac9f1375f1223eceb4eb4a3e079b70d48f9ee020bedb1aac8a384e7548d8a57f"}
{"title": "Amazon Connect flow designer now supports analytics mode", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-flow-designer-analytics-mode/", "published": "2025-09-22T16:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect now offers new enhanced analytics in the drag-and-drop flow designer that help you make data-driven decisions when building and optimizing your flows. Amazon Connect flows allow you to create end-to-end <a href=\"https://aws.amazon.com/connect/self-service/\">self-service and automated customer</a> experiences such as interactive voice response (IVR), step-by-step guides, and back office processes and tasks. With this launch, you can now view aggregate metrics on how customers move through each step in the flow including where they run into errors or abandon the experience. For example, you can see how many conversational AI interactions result in transfers to agent queues or when customers end up in the wrong queue because an error in the flow configuration. These new capabilities help you identify behavioral patterns and evaluate root causes, allowing you to deliver better outcomes for customers.<br /> <br /> This new capability is included with Amazon Connect (with unlimited AI)<a href=\"https://aws.amazon.com/connect/pricing/#Amazon_Connect_with_unlimited_AI\"> pricing</a>. To learn more about this feature, see the <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/monitor-flow-performance.html\">Amazon Connect Administrator Guide</a>. This feature is available in <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">all AWS regions</a> that offers Amazon Connect. To learn more about Amazon Connect, the AWS cloud-based contact center, please visit the <a href=\"https://aws.amazon.com/connect/\">Amazon Connect website</a>.</p>", "company": "aws.amazon.com", "_k": "4575fc55be0736be5c5bb891b049b36bca23807b0b29645c1706a83aa45e151f"}
{"title": "Amazon OpenSearch Ingestion now supports cross-account ingestion", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-ingestion-cross-account-ingestion/", "published": "2025-09-19T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon OpenSearch Ingestion now supports cross-account ingestion for push-based sources such as HTTP and OpenTelemetry (OTel). With this launch, customers can easily share OpenSearch Ingestion pipelines across AWS accounts without relying on additional configurations like VPC peering or AWS Transit Gateway.</p> \n<p>This capability makes it simpler for organizations with multiple accounts to centralize observability and analytics workflows. For example, a central logging team can create ingestion pipelines and grant access to development teams across different accounts, enabling them to ingest logs, metrics, and traces directly into OpenSearch domains or OpenSearch Serverless collections. This reduces operational overhead and lowers the cost of sharing ingestion pipelines across accounts.</p> \n<p>Cross-account ingestion for Amazon OpenSearch Ingestion is available today in all AWS regions where OpenSearch Ingestion is <a href=\"https://docs.aws.amazon.com/general/latest/gr/opensearch-service.html#opensearch-service-regions\" target=\"_blank\">offered</a>. Customers can get started by creating resource policies in the AWS Management Console or using the AWS CLI, and then enabling pipeline endpoints from their VPCs to ingest data seamlessly.</p> \n<p>To learn more about this feature, see the&nbsp;<a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/cross-account-pipelines.html\" target=\"_blank\">Amazon OpenSearch Service Developer Guide</a>&nbsp;and the launch&nbsp;<a href=\"https://aws.amazon.com/blogs/big-data/announcing-cross-account-ingestion-for-amazon-opensearch-service/\" target=\"_blank\">blog</a>.</p>", "company": "aws.amazon.com", "_k": "493d2cd70f2217e1d0fba1f3eb5577a0589387d2ece0c9cbfb6be91c1771220e"}
{"title": "Amazon RDS for MySQL announces Innovation Release 9.4 in Amazon RDS Database Preview Environment", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-mysql-innovation-release-94-database-preview-environment/", "published": "2025-09-19T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/rds/mysql/\">Amazon RDS for MySQL</a> now supports community MySQL Innovation Release 9.4 in the <a href=\"https://aws.amazon.com/rds/databasepreview/\">Amazon RDS Database Preview Environment</a>, allowing you to evaluate the latest Innovation Release on Amazon RDS for MySQL. You can deploy MySQL 9.4 in the Amazon RDS Database Preview Environment which provides the benefits of a fully managed database, making it simpler to set up, operate, and monitor databases.<br /> <br /> MySQL 9.4 is the latest Innovation Release from the MySQL community. MySQL Innovation releases include bug fixes, security patches, as well as new features. MySQL Innovation releases are supported by the community until the next innovation minor, whereas MySQL Long Term Support (LTS) Releases, such as MySQL 8.0 and MySQL 8.4, are supported by the community for up to eight years. Please refer to the <a href=\"https://dev.mysql.com/doc/relnotes/mysql/9.4/en/\">MySQL 9.4 release notes</a> and <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/MySQL.Concepts.VersionMgmt.html#mysql-preview-environment-version-9-4\">Amazon RDS MySQL release notes</a> for more details.<br /> <br /> Amazon RDS Database Preview Environment supports both Single-AZ and Multi-AZ deployments on the latest generation of instance classes. Amazon RDS Database Preview Environment database instances are retained for a maximum of 60 days and are automatically deleted after the retention period. Amazon RDS database snapshots created in the Preview Environment can only be used to create or restore database instances within the Preview Environment.<br /> <br /> Amazon RDS Database Preview Environment database instances are <a href=\"https://aws.amazon.com/rds/mysql/pricing/\">priced the same as production RDS instances created in the US East (Ohio) Region</a>. For further information, see <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/MySQL.Concepts.VersionMgmt.html#mysql-working-with-the-database-preview-environment\">Working with the Database Preview Environment</a>. To get started with the Preview Environment from the RDS console, navigate <a>here</a>.</p>", "company": "aws.amazon.com", "_k": "d22a6468598893c1bcf1fa7e7edb80f07629a47907ff5d303b5adc96b3da0c51"}
{"title": "Amazon Redshift announces the general availability of Multidimensional Data Layouts", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-redshift-multidimensional-data-layouts/", "published": "2025-09-19T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Redshift announces the general availability of Multidimensional Data Layouts (MDDL) that dynamically sort data based on actual query filters, accelerating query performance. Unlike traditional sorting methods that sort data based on fixed columns, MDDL sorts data based on query filters (for example, Sales in US), achieving up to 10x better end-to-end performance compared to using only optimal single-column sort keys for query workloads with repetitive query filters.<br /> <br /> For each table with an AUTO sort key, which is the default for tables without an explicit sort key, Redshift analyzes the table’s query history and automatically selects either a single-column sort key or MDDL for your table, depending on potential performance improvements for your workload. Redshift with MDDL automatically constructs a multidimensional virtual sort key<i> </i>that co-locates rows typically accessed by the same queries. This virtual column, equivalent to a new sort key for the table, is subsequently used during query execution to skip data blocks and even skip scanning entire predicate columns. Redshift with MDDL provides a more expressive generalization of existing compound and interleaved sort keys that significantly improves the performance of table scans, especially when your query workload contains repetitive query filters. For pre-existing tables with manually defined sort keys, you can take advantage of MDDL by altering the sortkey of the table to AUTO.<br /> <br /> MDDL is available in all <a href=\"https://docs.aws.amazon.com/lake-formation/latest/dg/supported-regions.html\">AWS commercial regions</a> where Redshift is available. To get started, read the <a href=\"https://docs.aws.amazon.com/redshift/latest/dg/t_Sorting_mutidimensional-sort-key.html\">documentation</a>, <a href=\"https://aws.amazon.com/blogs/big-data/improve-performance-of-workloads-containing-repetitive-scan-filters-with-multidimensional-data-layout-sort-keys-in-amazon-redshift/\">blog</a>, and Amazon Science <a href=\"https://www.amazon.science/publications/automated-multidimensional-data-layouts-in-amazon-redshift\">publication</a> to learn more about benchmarks on query performance improvements.&nbsp;</p>", "company": "aws.amazon.com", "_k": "c4c58811b9c4f5c26e8cf420e27bedc8f130de5dd55a8db073a3e1b0f224420f"}
{"title": "Announcing AWS Neuron SDK 2.26.0", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-neuron-2-26-announce/", "published": "2025-09-19T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the general availability of Neuron SDK 2.26.0, delivering improvements for deep learning workloads on AWS Inferentia and Trainium-based instances. This release introduces support for PyTorch 2.8 and JAX 0.6.2, along with enhanced inference capabilities on Trainium2 (Trn2) instances. These updates enable developers to leverage the latest frameworks while benefiting from improved model deployment flexibility and performance optimizations.<br /> <br /> With Neuron SDK 2.26.0, customers can now deploy FLUX.1-dev image generation model, along with Llama 4 Scout and Maverick variants (beta) on Trn2 instances. The release introduces expert parallelism support (beta) for efficient distribution of Mixture-of-Experts (MoE) models across multiple NeuronCores, and adds new capabilities through new Neuron Kernel Interface (NKI) APIs. The updated Neuron Profiler provides improved capabilities, including system profile grouping for distributed workloads.<br /> <br /> The new SDK version is available in all AWS Regions supporting Inferentia and Trainium instances, offering enhanced performance and monitoring capabilities for machine learning workloads.<br /> <br /> To learn more and for a full list of new features and enhancements, see:<br /> </p> \n<ul> \n <li><a contenteditable=\"false\" href=\"https://awsdocs-neuron.readthedocs-hosted.com/en/latest/release-notes/2.26.0/\" style=\"cursor: pointer;\">AWS Neuron 2.26.0 release notes</a></li> \n <li><a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/trn2/\" style=\"cursor: pointer;\">Trn2 Instances</a></li> \n <li><a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/trn1/\" style=\"cursor: pointer;\">Trn1 Instances</a></li> \n <li><a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/inf2/\" style=\"cursor: pointer;\">Inf2 Instances</a></li> \n</ul>", "company": "aws.amazon.com", "_k": "f54ecce7e410b77c4a3f4fb224befedf658ab30573f26f9f0e948f63ac1a1568"}
{"title": "AWS Organizations supports full IAM policy language for service control policies (SCPs)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-organizations-iam-language-service-control-policies/", "published": "2025-09-19T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Organizations now offers full IAM policy language support for service control policies (SCPs), enabling you to write SCPs with the same flexibility as IAM managed policies. With this launch, SCPs now support use of conditions, individual resource ARNs, and the NotAction element with Allow statements. Additionally, you can now use wildcards at the beginning or middle of Action element strings and the NotResource element.<br /> <br /> With these policy language enhancements, you can now create more concise and precise policies to implement sophisticated permissions guardrails across your organization. For example, you can restrict access to specific resources with condition statements. The enhanced functionality maintains backward compatibility with existing SCPs, so no changes to current policies are required.<br /> <br /> This feature is now available in all AWS commercial and AWS GovCloud (US) Regions.<br /> <br /> To learn more about the enhanced SCP capabilities, see <a href=\"https://docs.aws.amazon.com/organizations/latest/userguide/orgs_manage_policies_scps.html\">service control policies </a>in the AWS Organizations User Guide and <a href=\"https://aws.amazon.com/blogs/security/unlock-new-possibilities-aws-organizations-service-control-policy-now-supports-full-iam-language/\">AWS blog</a>.</p>", "company": "aws.amazon.com", "_k": "4c5892a5bd6a26b9e44f4457b28778bedd0fc4316ef2fd1362dd2da5a7aa313c"}
{"title": "AWS launches SiteWise MCP Server for Simplified Modeling", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-sitewise-mcp-server-modeling/", "published": "2025-09-19T06:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS announces Model Context Protocol (MCP) server for AWS IoT SiteWise in the <a href=\"https://github.com/awslabs/mcp/tree/main/src/aws-iot-sitewise-mcp-server\">AWS Labs MCP open-source repository</a>. This MCP server simplifies industrial data modeling by providing built-in domain validation and automated modeling capabilities, eliminating the need for extensive API knowledge. The server supports existing AWS IoT SiteWise functionality through familiar tools while adding new conversational interfaces for enhanced user interaction.</p> \n<p>The server comes with built-in industrial knowledge and best practices, automatically applying proper units, data types, and quality indicators. This means your industrial models are production-ready from the start, saving valuable time and resources that would otherwise be spent on multiple iterations and corrections. This foundation enables you to easily implement advanced capabilities like anomaly detection and streamlined asset onboarding, while seamlessly integrating with your existing industrial systems.</p> \n<p><br /> Download SiteWise MCP server from AWS Labs MCP open-source repository. To get started, visit:<br /> <a href=\"https://github.com/awslabs/mcp/tree/main/src/aws-iot-sitewise-mcp-server\">AWS Labs MCP repository on GitHub</a><br /> <a href=\"https://github.com/awslabs/mcp/blob/main/src/aws-iot-sitewise-mcp-server/README.md\">SiteWise MCP server documentation</a></p>", "company": "aws.amazon.com", "_k": "444fb82c04b1ec05f0bac09cf892d7e8b3a655a789cc4324b093b75fb3e24c50"}
{"title": "Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in seven additional AWS Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-vpc-reachability-network-access-analyzer-seven-regions/", "published": "2025-09-18T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>With this launch, Amazon VPC Reachability Analyzer and Amazon VPC Network Access Analyzer are now available in Asia Pacific (New Zealand), Asia Pacific (Hyderabad), Asia Pacific (Melbourne), Asia Pacific (Taipei), Canada West (Calgary), Israel (Tel Aviv) and Mexico (Central).<br /> <br /> VPC Reachability Analyzer allows you to diagnose network reachability between a source resource and a destination resource in your virtual private clouds (VPCs) by analyzing your network configurations. For example, Reachability Analyzer can help you identify a missing route table entry in your VPC route table that could be blocking network reachability between an EC2 instance in Account A that is not able to connect to another EC2 instance in Account B in your AWS Organization.<br /> <br /> VPC Network Access Analyzer allows you to identify unintended network access to your AWS resources, helping you meet your security and compliance guidelines. For example, you can create a scope to verify that all paths from your web-applications to the internet, traverse the firewall, and detect any paths that bypass the firewall.<br /> <br /> For more information, visit documentation for <a href=\"https://docs.aws.amazon.com/vpc/latest/reachability/what-is-reachability-analyzer.html\">VPC Reachability Analyzer</a> and <a href=\"https://docs.aws.amazon.com/vpc/latest/network-access-analyzer/what-is-network-access-analyzer.html\">VPC Network Access Analyzer.</a> For pricing, refer to the Network Analysis tab on the <a href=\"https://aws.amazon.com/vpc/pricing/\">Amazon VPC Pricing Page</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "f71626e788f6f08db2d0640ec15db7da0d18c58fca960018d3a89700eab2698e"}
{"title": "Amazon Kinesis Data Streams expands Internet Protocol version 6 support to the AWS GovCloud (US) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-kinesis-data-streams-ipv6-govcloud/", "published": "2025-09-18T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Kinesis Data Streams now allows customers to make API requests over Internet Protocol version 6 (IPv6) in the AWS GovCloud (US) Regions. Customers have the option of using either IPv6 or IPv4 when sending requests over dual-stack public or VPC endpoints. The new endpoints have also been validated under the Federal Information Processing Standard (FIPS) 140-3 program.<br /> <br /> Kinesis Data Streams allows users to capture, process, and store data streams in real time at any scale. IPv6 increases the number of available addresses by several orders of magnitude, so customers will no longer need to manage overlapping address spaces. Many devices and networks today already use IPv6, and now they can easily write to and read from data streams. FIPS-compliant endpoints help companies contracting with the US federal governments meet the FIPS security requirement to encrypt sensitive data in supported Regions.<br /> <br /> Support for IPv6 with Kinesis Data Streams is now available in all Regions where Kinesis Data Streams is available, including AWS GovCloud (US) and China Regions. See <a href=\"https://docs.aws.amazon.com/general/latest/gr/ak.html\">here</a> for a full listing of our Regions. To learn more about Kinesis Data Streams, please refer to our <a href=\"https://docs.aws.amazon.com/streams/latest/dev/introduction.html\">Developer Guide</a>.</p>", "company": "aws.amazon.com", "_k": "15991d1bdd6c2b254601fa73a1a302efc17621a0fea1ce904f6f1b110173f525"}
{"title": "Amazon Q Developer CLI announces support for remote MCP servers", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-q-developer-remote-mcp-servers/", "published": "2025-09-18T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Q Developer CLI announces support for remote MCP servers. Remote MCP servers improve scalability and security of the tools you use within your development tasks. Not only does it reduce the use of compute resources by moving to a centralized server, it also helps you better manage access and security. You can now integrate with MCP servers such as Atlassian, and GitHub that support HTTP and support OAuth based authentication.<br /> <br /> To configure a remote MCP server, specify the transport type as HTTP, the URL where users will get authentication credentials, and any optional headers to include when making the request. You can configure remote MCP servers in your custom agent configuration or in mcp.json. When a CLI session is initiated, you will see the list of MCP servers to load and can query the list for the authentication URL. Once you successfully complete the authentication steps, Q Developer CLI will query the tools available from the MCP server and make it available to the agent.<br /> <br /> Remote MCP servers are available in Amazon Q Developer CLI and Amazon Q Developer IDE plugins. For more information, check out the&nbsp;<a href=\"https://docs.aws.amazon.com/amazonq/latest/qdeveloper-ug/command-line-mcp-config-CLI.html\">documentation</a>.</p> \n<p>&nbsp;</p>", "company": "aws.amazon.com", "_k": "2a8a8c01ee59369018792cbeef9d2009f4887259c721bc063993d57e14260205"}
{"title": "Second-generation AWS Outposts racks now supported in the AWS Canada (Central) and US West (N. California) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/second-generation-outposts-racks-canada-us-west-regions/", "published": "2025-09-18T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Second-generation AWS Outposts racks are now supported in the AWS Canada (Central) and US West (N. California) Regions. Outposts racks extend AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises data center or colocation space for a truly consistent hybrid experience.</p> \n<p>Organizations from startups to enterprises and the public sector in and outside of Canada and the US can now order their Outposts racks connected to these two new supported Regions, optimizing for their latency and data residency needs. Outposts allows customers to run workloads that need low-latency access to on-premises systems locally while connecting back to their home Region for application management. Customers can also use Outposts and AWS services to manage and process data that needs to remain on-premises to meet data residency requirements. This regional expansion provides additional flexibility in the AWS Regions that customers’ Outposts can connect to.</p> \n<p>To learn more about second-generation Outposts racks, read <a href=\"https://aws.amazon.com/blogs/aws/announcing-second-generation-aws-outposts-racks-with-breakthrough-performance-and-scalability-on-premises/\" target=\"_blank\"><u>this blog post</u></a> and <a href=\"https://docs.aws.amazon.com/outposts/latest/network-userguide/what-is-outposts.html\" target=\"_blank\"><u>user guide</u></a>. For the most updated list of countries and territories and the AWS Regions where second-generation Outposts racks are supported, check out the <a href=\"https://aws.amazon.com/outposts/rack/faqs/\" target=\"_blank\"><u>Outposts racks FAQs page</u></a>.</p>", "company": "aws.amazon.com", "_k": "8c6e455753c5915e3e20642cef1bec27564bb8413d78674ec74683360997b57e"}
{"title": "Stability AI Image Services now available in Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/stability-ai-image-services-generally-available-amazon-bedrock/", "published": "2025-09-18T16:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Bedrock announces the availability of Stability AI Image Services, a comprehensive suite of 9 specialized image editing tools designed to accelerate professional creative workflows. Stability AI Image Services enable granular control over image editing with a range of tools designed to work with your creative process, allowing you to take a single concept from ideation to finished product with precision and flexibility.<br /> <br /> Stability AI Image Services offers two categories of image editing capabilities: Edit tools: Remove Background, Erase Object, Search and Replace, Search and Recolor, and Inpaint let you make targeted modifications to specific parts of your images. Control tools: Structure, Sketch, Style Guide, and Style Transfer give you powerful ways to generate variations based on existing images or sketches.<br /> <br /> Stability AI Image Services is now available in Amazon Bedrock through the API and is supported in US West (Oregon), US East (N. Virginia), and US East (Ohio). For more information on supported regions, visit the<a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-regions.html\"> Amazon Bedrock Model Support by Regions guide. </a>For more details about Stability AI Image Services and its capabilities, visit the <a href=\"https://aws.amazon.com/bedrock/stability-ai/\">Stability AI product page</a> and <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/model-parameters-stability-diffusion.html\">Stability AI documentation page</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "29fa207e6358d512d1dee938d69eb906c036242e701f4c09b25867ee5b1f6a25"}
{"title": "OpenAI open weight models expand to new regions on Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/open-ai-open-weight-models-new-regions-amazon-bedrock/", "published": "2025-09-18T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the expansion of OpenAI open weight models on Amazon Bedrock to eight new regions. This expansion brings these powerful AI models closer to customers in various parts of the world, enabling lower latency and improved performance for a wide range of AI-powered applications.<br /> <br /> With this expansion, the OpenAI open weight models are now available in the following AWS Regions: US East (N. Virginia), Asia Pacific (Tokyo), Europe (Stockholm), Asia Pacific (Mumbai), Europe (Ireland), South America (São Paulo), Europe (London), and Europe (Milan), in addition to the previously supported region of US West (Oregon). This broader availability allows more customers to leverage these state-of-the-art AI models while keeping their data within their preferred geographic locations, helping to address data residency requirements and reduce network latency.<br /> <br /> To learn more about OpenAI open weight models on Amazon Bedrock and how to get started, visit the <a href=\"https://console.aws.amazon.com/bedrock/?trk=e61dee65-4ce8-4738-84db-75305c9cd4fe&amp;sc_channel=el\" target=\"_blank\">Amazon Bedrock console</a> or check out our <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/model-parameters-openai.html\" target=\"_blank\">documentation</a>. For more information about the initial release of these models on Amazon Bedrock, refer to our previous <a href=\"https://aws.amazon.com/blogs/aws/openai-open-weight-models-now-available-on-aws/\" target=\"_blank\">blog post</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "bb64c1850193fb225a8d36c56f3fc272bdf9995d32008d9112442c3321d3ceeb"}
{"title": "AWS Step Functions expands data source options and improves observability for Distributed Map", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-step-functions-data-source-options-observability-distributed-map/", "published": "2025-09-18T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Step Functions now supports additional data sources and new observability metrics for Distributed Map. <a href=\"https://aws.amazon.com/step-functions/\" target=\"_blank\">AWS Step Functions</a> is a visual workflow service capable of orchestrating over 14,000+ API actions from over 220 AWS services to build distributed applications and data processing workloads. Distributed Map is a task state of Step Functions that runs the same process for multiple entries in a data set.<br /> <br /> With this update, Distributed Map now supports additional data inputs, so you can orchestrate large-scale analytics and ETL workflows. You can now process AWS Athena data manifest and Parquet files directly, iterate over S3 objects under a specified prefix using S3ListObjectsV2, read from JSON objects and natively extract array data from JSON object from Amazon S3 or state input, eliminating the need for custom pre-processing. You also now get visibility into your Distributed Map usage with the following metrics, such as Approximate Open Map Runs Count, Open Map Run Limit, and Approximate Map Runs Backlog Size.<br /> <br /> New input sources and improved observability for Distributed Map are available in all commercial AWS Regions where AWS Step Functions is available. To get started, you can use the Distributed Map mode today in the <a href=\"https://console.aws.amazon.com/states/home/\" target=\"_blank\">AWS Step Functions console</a>. To learn more, visit the Step Functions <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/input-output-fields-dist-map.html\" target=\"_blank\">developer guide.</a></p>", "company": "aws.amazon.com", "_k": "2f0293c6d197cfef4a01ad79eb94031c1708e01ae71d17d7d96b9bcc96fc9518"}
{"title": "Amazon Lex provides enhanced confirmation and currency built-in slots to 10 additional languages", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-lex-enhanced-confirmation-currency-slots-to-languages/", "published": "2025-09-18T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Lex now provides support for confirmation and currency slot types in 10 additional languages: Portuguese, Catalan, French, Italian, German, Spanish, Mandarin, Cantonese, Japanese, and Korean. Built-in slots help you build more natural and efficient conversations by understanding synonyms of what you user says and resolving those inputs to a standard format. The confirmation slot helps understand various expressions of user acknowledgement and converts them into ‘Yes’, ‘No’, “Don’t know’‘, or ‘Maybe’. The currency slot helps identify currency and represents the input in a structured way. For example, when a user says “nope” or “absolutely not”, the confirmation slot resolves to ‘No’ or when the user says “1 dollar’, the currency slot resolves it to ”USD 1.00“. These built-in slots help you build more natural and efficient conversational experiences.<br /> <br /> This feature is available in all commercial AWS Regions where Amazon Lex operates. To learn more about these features, visit <a href=\"https://docs.aws.amazon.com/lexv2/latest/dg/built-in-slots.html\">Amazon Lex documentation</a> or to learn how Amazon Connect and Amazon Lex deliver cloud-based conversational AI experiences for contact centers, please visit the Amazon Connect <a href=\"https://aws.amazon.com/connect/self-service/\">website</a>.</p>", "company": "aws.amazon.com", "_k": "f81db05b284bfc459aa10e0a878f28f7a16a2f3c40dc17cb3b65667eb6357bf9"}
{"title": "Qwen3 models are now available fully managed in Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/qwen3-models-fully-managed-amazon-bedrock/", "published": "2025-09-18T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Bedrock continues to expand model choice by adding four Qwen3 open weight foundation models, now available as fully managed, serverless offerings. The lineup includes: Qwen3-Coder-480B-A35B-Instruct, Qwen3-Coder-30B-A3B-Instruct, Qwen3-235B-A22B-Instruct-2507, and Qwen3-32B for efficient dense computation. These models feature both dense and Mixture-of-Experts (MoE) architectures, providing flexible options for various development needs.<br /> <br /> These open weight models enable you to build powerful AI applications with advanced agentic capabilities, without managing any infrastructure. The two Qwen3-Coder models excel at agentic coding and complex software engineering tasks, offering state-of-the-art performance for function calling and tool use. The 235B model delivers efficient general reasoning and instruction following across diverse tasks, while the 32B dense model provides a more traditional architecture suitable for a wide range of computational tasks.<br /> <br /> Qwen3 models (32B, Coder-30B) are available today in the US East (N. Virginia), US West (Oregon), Asia Paciﬁc (Mumbai, Tokyo), Europe (Ireland, London, Milan, Stockholm), and South America (São Paulo) AWS Regions. Qwen 235B is available today in theUS West (Oregon), Asia Paciﬁc (Mumbai, Tokyo), and Europe (London, Milan, Stockholm) AWS Regions. Qwen Coder-480B is available today in the US West (Oregon), Asia Paciﬁc (Mumbai, Tokyo), and Europe (London, Stockholm) AWS Regions. Check the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-regions.html?trk=ba8b32c9-8088-419f-9258-82e9375ad130&amp;sc_channel=el\" target=\"_blank\">full Region list</a> for future updates. To learn more, read the <a href=\"https://aws.amazon.com/blogs/aws/qwen-models-are-now-available-in-amazon-bedrock\" target=\"_blank\">blog</a>, <a href=\"https://aws.amazon.com/bedrock/qwen/\" target=\"_blank\">product page</a>, <a href=\"https://aws.amazon.com/bedrock/pricing/\" target=\"_blank\">Amazon Bedrock pricing</a>, and <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/model-parameters.html\" target=\"_blank\">documentation</a>. To get started with Qwen in Amazon Bedrock, visit the <a href=\"https://console.aws.amazon.com/bedrock/\" target=\"_blank\">Amazon Bedrock console</a>.<br /> <br /> </p>", "company": "aws.amazon.com", "_k": "99fb030c6cd3da31c1c97cc06b00f31f683b4af309f1dea47472a52c34d05a5e"}
{"title": "DeepSeek-V3.1 model now available fully managed in Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/deepseek-v3-1-model-fully-managed-amazon-bedrock/", "published": "2025-09-18T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>DeepSeek-V3.1 is now available as a fully managed foundation model in Amazon Bedrock. This advanced open weight model allows you to switch between thinking mode for detailed step-by-step analysis and non-thinking mode for quicker responses. With comprehensive multilingual support, it delivers enhanced accuracy and reduced hallucinations compared to previous DeepSeek models, while maintaining visibility into its decision-making process.<br /> <br /> You can use DeepSeek-V3.1's enterprise-grade capabilities across critical business functions, from state-of-the-art software development to complex mathematical reasoning and data analysis. The model excels at sophisticated problem-solving tasks, demonstrating strong performance in coding benchmarks and technical challenges. Its enhanced tool-calling capabilities and seamless workflow integration make it ideal for building AI agents and automating enterprise processes, while its transparent reasoning approach helps teams understand and trust its outputs.<br /> <br /> <br /> DeepSeek-V3.1 is now available in the US West (Oregon), Asia Paciﬁc (Tokyo), Asia Paciﬁc (Mumbai), Europe (London), and Europe (Stockholm) AWS Regions. To learn more, read the <a href=\"https://aws.amazon.com/blogs/aws/deepseek-v3-1-now-available-in-amazon-bedrock/\" target=\"_blank\">blog</a>, <a href=\"https://aws.amazon.com/bedrock/deepseek/\" target=\"_blank\">product page</a>, <a href=\"https://aws.amazon.com/bedrock/pricing/\" target=\"_blank\">Amazon Bedrock pricing</a>, and <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/model-parameters-deepseek.html\" target=\"_blank\">documentation</a>. To get started with DeepSeek in Amazon Bedrock, visit the <a href=\"https://console.aws.amazon.com/bedrock/\" target=\"_blank\">Amazon Bedrock console</a>.<br /> </p>", "company": "aws.amazon.com", "_k": "df3d4c3f93f0799628c5a9f68837fe4732e744827ff05bf7f8797445a5a76174"}
{"title": "AWS Step Functions now supports IPv6 with dual-stack endpoints", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-step-functions-ipv6-dual-stack-endpoints/", "published": "2025-09-18T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Step Functions adds supports for IPv6. You can now send IPV6 traffic to AWS Step Functions via new dual-stack IPv4 and IPv6 endpoints. <a href=\"https://aws.amazon.com/step-functions/\">AWS Step Functions</a> is a visual workflow service that enables customers to build distributed applications, automate IT and business processes, and build data and machine learning pipelines using AWS services. This enhancement addresses the growing need for IP addresses as the internet continues to expand, providing a larger address space than the traditional IPv4 format.<br /> <br /> With IPv6 support, organizations modernizing their applications can now build serverless workflows without being constrained by limited IPv4 address space. The new dual-stack endpoints support both IPv4 and IPv6 protocols while maintaining backwards compatibility with existing IPv4 endpoints. Step Functions also supports IPv6 connectivity through PrivateLink interface Virtual Private Cloud (VPC) endpoints, enabling you to access the service privately without traversing the public internet. This enables organizations operating in IPv6 environments to natively integrate with Step Functions without requiring complex translation mechanisms between IPv6 and IPv4.<br /> <br /> IPv6 support for AWS Step Functions is now generally available in US East (Ohio), US East (N. Virginia), US West (Oregon), US West (N. California) as well as AWS GovCloud (US-East), and AWS GovCloud (US-West) Regions, where AWS Step Functions is available.<br /> <br /> To learn more about IPv6 support on AWS, visit the <a href=\"https://docs.aws.amazon.com/whitepapers/latest/ipv6-on-aws/IPv6-on-AWS.html\">documentation</a> page.</p>", "company": "aws.amazon.com", "_k": "abae0048f942f8f24a15d96fad68338d6f29efd5fda9d47ee4ec0d711d9a2c13"}
{"title": "Amazon OpenSearch Serverless now supports Disk-Optimized Vectors", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/opensearch-serverless-disk-optimized-vectors/", "published": "2025-09-18T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>We are excited to announce the launch of disk-optimized vector support for Amazon OpenSearch Serverless, offering customers a cost-effective solution for vector search operations without compromising on accuracy and recall rates. This new feature enables organizations to implement high-quality vector search capabilities while significantly reducing operational costs.<br /> <br /> With the introduction of Disk Optimized Vectors, customers can now choose between memory-optimized and disk-optimized vector storage options. The disk-optimized option delivers the same high accuracy and recall rates as memory-optimized vectors at lower cost. While this option may introduce slightly higher latency, it's ideal for use cases where sub-millisecond response times aren't critical such as semantic search applications, recommendation systems, and other AI-powered search scenarios.<br /> <br /> Amazon OpenSearch Serverless, our fully managed deployment option, eliminates the complexities of infrastructure management for search and analytics workloads. The service automatically scales compute capacity, measured in OpenSearch Compute Units (OCUs), based on your workload demands.</p> \n<p>Please refer to the <a href=\"https://docs.aws.amazon.com/general/latest/gr/opensearch-service.html#opensearch-service-regions\">AWS Regional Services List</a> for more information about Amazon OpenSearch Service availability. To learn more about OpenSearch Serverless, <a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/serverless.html\">see the documentation.</a></p>", "company": "aws.amazon.com", "_k": "39ab67cd40f9a36310481c3d0b25e7103da4bddae7e68620bbac9575a4cab74e"}
{"title": "Amazon SageMaker HyperPod now supports autoscaling using Karpenter", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/sagemaker-hyperpod-autoscaling/", "published": "2025-09-18T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon SageMaker HyperPod now supports managed node autoscaling using Karpenter, enabling customers to automatically scale their clusters to meet dynamic inference and training demands. Real-time inference workloads require automatic scaling to address unpredictable traffic patterns and maintain service level agreements, while optimizing costs. However, organizations often struggle with the operational overhead of installing, configuring, and maintaining complex autoscaling solutions. HyperPod-managed node autoscaling eliminates the undifferentiated heavy lifting of Karpenter setup and maintenance, while providing integrated resilience and fault tolerance capabilities.<br /> <br /> Autoscaling on HyperPod with Karpenter enables customers to achieve just-in-time provisioning that rapidly adapts GPU compute for inference traffic spikes. Customers can scale to zero nodes during low-demand periods without maintaining dedicated controller infrastructure and benefit from workload-aware node selection that optimizes instance types and costs. For inference workloads, this provides automatic capacity scaling to handle production traffic bursts, cost reduction through intelligent node consolidation during idle periods, and seamless integration with event-driven pod autoscalers like KEDA. Training workloads also benefit from automatic resource optimization during model development cycles. You can enable autoscaling on HyperPod using the UpdateCluster API with AutoScaling mode set to \"Enable\" and AutoScalerType set to \"Karpenter\".<br /> <br /> This feature is available in all AWS Regions where Amazon SageMaker HyperPod EKS clusters are supported. To learn more about autoscaling on SageMaker HyperPod with Karpenter, see the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/sagemaker-hyperpod-eks-autoscaling.html\" style=\"cursor: pointer;\">user guide</a> and <a href=\"https://aws.amazon.com/blogs/machine-learning/introducing-auto-scaling-on-amazon-sagemaker-hyperpod/\" style=\"cursor: pointer;\">blog</a>.</p>", "company": "aws.amazon.com", "_k": "c1e386ba2438ea92292d0f8b1a1b6a05340156f908cbe8912feeb3bdc56b0b75"}
{"title": "Amazon EVS now supports HCX migration over public internet", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-evs-hxc-migration-public-internet/", "published": "2025-09-18T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a contenteditable=\"false\" href=\"https://aws.amazon.com/evs/\" style=\"cursor: pointer;\">Amazon Elastic VMware Service</a> (Amazon EVS) now allows you to securely migrate and stretch your layer 2 networks from your on-premises data centers to Amazon EVS environments over the public internet. This launch adds to the existing capability of migrating workloads to Amazon EVS through dedicated private connectivity such as AWS Direct Connect or Virtual Private Networks (VPNs).<br /> <br /> By enabling internet connectivity, Amazon EVS uses Elastic IP Addresses (EIPs) to provide a stable endpoint and a faster setup for performing workload migrations using VMware HCX. You now have the option to use internet connectivity for your migration projects when you might not have access to private connectivity options or are looking for a cost-effective alternative for the type of applications or projects that do not require the high network performance characteristics of a private connection during the migration.</p> \n<p>Public HCX connectivity is available in all <a contenteditable=\"false\" href=\"https://aws.amazon.com/evs/faqs/#topic-0\" style=\"cursor: pointer;\">AWS Regions</a> where Amazon EVS is available. To learn more about EVS migration options with HCX visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/evs/latest/userguide/migrate-evs-hcx.html\" style=\"cursor: pointer;\">AWS User Guide</a>. To learn more about Amazon EVS, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/evs/\" style=\"cursor: pointer;\">product detail page</a>.</p>", "company": "aws.amazon.com", "_k": "1e913f48d081ba1f07a235dae02ecbe504ad1bf24f23d4c51585be7259b96e4e"}
{"title": "AWS Lambda Now Supports Cross-Account Container Images in AWS GovCloud (US) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-lambda-cross-account-container-images-govcloud/", "published": "2025-09-17T18:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Lambda now supports creating or updating functions using container images stored in an Amazon Elastic Container Registry (ECR) repository located in a different AWS account than the Lambda function in all AWS GovCloud Regions (US) (AWS GovCloud (US-West) and AWS GovCloud (US-East)). Previously, users could only access container images within the same AWS account as their Lambda function. This often required copying images to a local ECR repository if they were stored in a centralized account.<br /> <br /> This enhancement streamlines the process by allowing access to container images across different accounts. To achieve this, you need to grant necessary permissions to the Lambda resource and the Lambda service principal. This functionality is available in all AWS Regions where both Lambda and ECR are available. See <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">the AWS Region table</a> for more info. Visit <a href=\"https://docs.aws.amazon.com/lambda/latest/dg/images-create.html\" target=\"_blank\">the AWS Lambda documentation</a> for further details on configuring these permissions<br /> </p> \n<p>&nbsp;</p>", "company": "aws.amazon.com", "_k": "c9f70f52a54c31cc40578b5696d4268b4320bbfb06494d6ba8327524ea2e4c67"}
{"title": "Amazon Corretto 25 is now generally available", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-corretto-25-generally-available/", "published": "2025-09-17T17:18:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Corretto 25, a Long Term Support (LTS) version, is now generally available. <a href=\"https://aws.amazon.com/corretto/\" style=\"cursor: pointer;\">Amazon Corretto</a> is a no-cost, multi-platform, production-ready distribution of <a href=\"https://aws.amazon.com/blogs/opensource/amazon-corretto-no-cost-distribution-openjdk-long-term-support/\" style=\"cursor: pointer;\">OpenJDK</a>. You can download Corretto 25 for Linux, Windows, and macOS from our <a href=\"https://docs.aws.amazon.com/corretto/latest/corretto-25-ug/downloads-list.html\" style=\"cursor: pointer;\">downloads page</a>.<br /> <br /> Amazon Corretto 25 new features include:<br /> </p> \n<ul> \n <li>Two features that were initially released as experimental in JDK 24 are now LTS production-ready in JDK 25:<br /> <b>Compact Object Headers:</b> designed to lower heap memory usage by shrinking object headers from 96-128 bits down to 64 bits.<br /> <b>Generational Shenandoah GC:</b> engineered to provide sustainable throughput and lower p99 pause times or similar pause times with a smaller heap and reduced CPU usage.</li> \n <li><b>Ahead-of-Time (AOT) Caching:</b> designed to improve cold-start and warm-up time by reusing pre-parsed pre-linked classes and compilation profiles between training and production runs.</li> \n <li><b>Language improvements: </b>primitive types in patterns, flexible constructors, module‑wide imports, compact source files, scoped values for thread-local variables, stable values for immutable data, all designed to cut boilerplate, keep everyday code shorter and safer.</li> \n <li><b>Observability: </b>JDK Flight Recorder gains CPU‑time sampling, cooperative sampling and method‑trace events for low‑overhead production profiling.</li> \n <li><b>Structured Concurrency:</b> designed to provide coordinated task management, allowing related tasks fail or finish together.</li> \n <li><b>Vector API:</b> developed to provide computations that compile to optimal vector instructions on supported CPUs.</li> \n <li><b>Virtual Thread pinning improvements: </b>reduces thread pinning in synchronized blocks for better scalability.</li> \n</ul> \n<p>A detailed description of these features can be found on the <a href=\"https://openjdk.org/projects/jdk/25/\" style=\"cursor: pointer;\">OpenJDK 25 Project page</a>. Amazon Corretto 25 is distributed by Amazon under an <a href=\"https://openjdk.org/legal/gplv2+ce.html\" style=\"cursor: pointer;\">open source license</a> and will be supported through October 2032.</p>", "company": "aws.amazon.com", "_k": "a48da2066878fd461a462e729abf1a6f518017b88ae9f79f5ff6d3e293db9e1d"}
{"title": "Amazon EC2 I8ge instances now available in AWS Europe (Frankfurt)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-i8ge-instances-in-europe-frankfurt/", "published": "2025-09-17T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, Amazon Elastic Compute Cloud (Amazon EC2) storage optimized I8ge instances are available in AWS Europe (Frankfurt) region. I8ge instances are powered by AWS Graviton4 processors to deliver up to 60% better compute performance compared to previous generation Graviton2-based storage optimized Amazon EC2 instances. I8ge instances use the latest third generation AWS Nitro SSDs, local NVMe storage that deliver up to 55% better real-time storage performance per TB while offering up to 60% lower storage I/O latency and up to 75% lower storage I/O latency variability compared to previous generation Im4gn instances. At 120 TB, I8ge instances have the highest storage density among AWS Graviton-based storage optimized Amazon EC2 instances. These instances are built on the&nbsp;AWS Nitro System, which oﬄoads CPU virtualization, storage, and networking functions to dedicated hardware and software enhancing the performance and security for your workloads.</p> \n<p>I8ge instances offer instance sizes up to 48xlarge&nbsp;including two metal sizes, 1,536 GiB of memory, and 120 TB instance storage. At 300 Gbps, these instances have the highest networking bandwidth among storage optimized Amazon EC2 instances. They are ideal for real-time applications&nbsp;that require much larger storage density such as relational databases, non-relational databases, streaming databases, search queries and data analytics.</p> \n<p>To learn more, see&nbsp;<a href=\"https://aws.amazon.com/ec2/instance-types/i8g/\">Amazon EC2 I8ge instances</a>. To begin your Graviton journey, visit the&nbsp;<a href=\"https://aws.amazon.com/ec2/graviton/level-up-with-graviton/\">Level up your compute with AWS Graviton page</a>. To get started, see&nbsp;<a href=\"https://console.aws.amazon.com/\">AWS Management Console</a>,&nbsp;<a href=\"https://aws.amazon.com/cli/\">AWS Command Line Interface (AWS CLI)</a>, and&nbsp;<a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\">AWS SDKs</a>.</p>", "company": "aws.amazon.com", "_k": "904c2d51b00d1c3687ebcfbf261797ee1921463c329b3902a7c32a02de406d0a"}
{"title": "Amazon Connect launches the ability to search contacts using agent hierarchy filters", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-search-contacts-agent-hierarchy-filters/", "published": "2025-09-17T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect now provides you with agent hierarchy filters on the contact search page in the Amazon Connect UI. This launch enables contact center leaders to drill-down into their hierarchy to review contacts handled by specific contact center sites, departments or teams, for assessing contact quality or agent performance. This also enables centralized teams within contact centers, such as quality management and regulatory compliance, to efficiently locate and review contacts handled by specific teams or departments, streamlining their workflow for performance evaluation and compliance auditing.<br /> <br /> This feature is available in all regions where <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/regions.html#amazonconnect_region\">Amazon Connect</a> is offered. To learn more, please visit our <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/contact-search.html\">documentation</a> and our <a href=\"https://aws.amazon.com/connect/contact-lens/\">webpage</a>.</p>", "company": "aws.amazon.com", "_k": "9d25d41430599847942992ef8997fa4b35d90129df8895efb9b0ba5c61eb2f39"}
{"title": "Announcing availability of second-generation AWS Outposts racks in 52 more countries", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/second-generation-aws-outposts-racks-more-countries/", "published": "2025-09-17T16:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Second-generation AWS Outposts racks can now be shipped and installed at your data center and on-premises locations in Australia, Bahrain, Brazil, Brunei, Chile, Costa Rica, Egypt, European Union countries, Iceland, Indonesia, Israel, Japan, Jordan, Kenya, the Kingdom of Saudi Arabia, Kuwait, Malaysia, New Zealand, Peru, the Philippines, Singapore, Trinidad and Tobago, Türkiye, the United Arab Emirates (UAE), the United Kingdom, and Vietnam.</p> \n<p>Outposts racks extend AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises data center or colocation space for a truly consistent hybrid experience. Outposts racks are ideal for workloads that require low-latency access to on-premises systems, local data processing, and migration of applications with local system interdependencies. Outposts racks can also help meet data residency requirements. Second-generation Outposts racks support the latest generation of x86-powered Amazon Elastic Compute Cloud (Amazon EC2) instances, starting with C7i, M7i, and R7i instances. These instances provide up to 40% better performance compared to C5, M5, and R5 instances on first-generation Outposts racks. Second-generation Outposts racks also offer simplified network scaling and configuration, and support a new category of accelerated networking Amazon EC2 instances optimized for ultra-low latency and high throughput needs.</p> \n<p>With the availability of second-generation Outposts racks in the above countries, you can use AWS services to run your workloads and data in country in your on-premises facilities and connect to the nearest available AWS Region for management and operations.</p> \n<p>To learn more about second-generation Outposts racks, read <a href=\"https://aws.amazon.com/blogs/aws/announcing-second-generation-aws-outposts-racks-with-breakthrough-performance-and-scalability-on-premises/\" target=\"_blank\">this blog post</a> and the <a href=\"https://docs.aws.amazon.com/outposts/latest/network-userguide/what-is-outposts.html\" target=\"_blank\">user guide</a>. For the most updated list of countries and territories and the AWS Regions where second-generation Outposts racks are supported, check out the <a href=\"https://aws.amazon.com/outposts/rack/faqs/\" target=\"_blank\">Outposts racks FAQs page</a>.</p>", "company": "aws.amazon.com", "_k": "efadb620178abf41155be07f7ef7babf9363ac13ae810b813d26bf561ae311a1"}
{"title": "Amazon CloudWatch launches Cross-Account and Cross-Region Log Centralization", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-cloudwatch-cross-account-cross-region-log-centralization/", "published": "2025-09-17T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon CloudWatch now offers cross-account and cross-region log centralization, allowing customers to copy log data from multiple AWS accounts and regions into a single destination account. This capability seamlessly integrates with AWS Organizations, enabling efficient aggregation of logs from workloads that span multiple accounts and regions into a single account without the need to manage custom solutions.<br /> <br /> The log centralization feature provides the ability to scope the centralization rules to copy log data from their entire organization, specific organizational units, or selected accounts into a single account. To maintain source context and data lineage, log events are enriched with new system fields (@aws.account and @aws.region) that identify the original source account and region. Additional capabilities include selective log group copying, automatic merging of same-named log groups in the destination account, and optional backup region setup, simplifying centralized log management.<br /> <br /> Log centralization is available in US East (Ohio), US East (N. Virginia), US West (N. California), US West (Oregon), Asia Pacific (Mumbai), Asia Pacific (Osaka), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), Canada (Central), Europe (Frankfurt), Europe (Ireland), Europe (London), Europe (Paris), Europe (Stockholm), and South America (São Paulo).<br /> <br /> To learn more, visit the <a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs/CloudWatchLogs_Centralization.html\" target=\"_blank\">Amazon CloudWatch documentation</a>. Customers can centralize one copy of logs for free. Additional copies are charged at $0.05/GB of logs centralized (the backup region feature is considered an additional copy). For details, visit the <a href=\"https://aws.amazon.com/cloudwatch/pricing/\" target=\"_blank\">CloudWatch Pricing</a> page.</p>", "company": "aws.amazon.com", "_k": "4dcbfc982aabce09ceb9177d9dad42399ef587740ad3347091af6234ae2eef5b"}
{"title": "Amazon EventBridge extends Customer Managed Key support to rule filter patterns and input transformers", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-eventbridge-customer-managed-key-support-filter-patterns-input-transformers/", "published": "2025-09-17T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon EventBridge now extends AWS Key Management Service (KMS) customer managed key support to event bus rule filter patterns and input transformers. This capability enables you to use your own encryption keys to protect sensitive information in your event filtering and transformation logic to meet stringent security and compliance requirements while maintaining full control over your encryption keys.<br /> <br /> Amazon EventBridge is a serverless event router that enables you to create scalable event-driven applications by routing events between your applications, third-party SaaS applications, and AWS services. Filter patterns determine which events match your rules, while input transformers allow you to customize the event data before sending it to targets. By encrypting these components with customer managed keys, you can help meet your organization's compliance and governance requirements and use AWS <a href=\"https://aws.amazon.com/cloudtrail/\" target=\"_blank\">CloudTrail</a> to audit and track encryption key usage.<br /> <br /> This feature is available in all commercial AWS Regions. Using this feature incurs no additional cost, but standard AWS KMS pricing applies. To learn more, visit the EventBridge <a href=\"https://docs.aws.amazon.com/eventbridge/latest/userguide/eb-data-protection.html\" target=\"_blank\">documentation</a> and AWS KMS <a href=\"https://docs.aws.amazon.com/kms/latest/developerguide/overview.html\" target=\"_blank\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "75eb50c4e988bfc19479e331bbf2e8f849ec837ebac7752689e0916a4ca0b5b8"}
{"title": "AWS Budgets now supports custom time periods", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-budgets-custom-time-periods/", "published": "2025-09-17T13:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today AWS announced custom time periods for AWS Budgets, a new capability that lets you create budgets with flexible start and end dates. This enhancement allows you to define budget periods that align with your organization's specific needs, moving beyond traditional calendar-based periods like monthly, quarterly, or annual budgets.<br /> <br /> Custom time periods help you accurately monitor costs for projects with specific duration and funding limits. For example, if you have a three-month development project starting mid-month, you can create a single budget for that exact time frame and receive alerts when spending approaches your thresholds. This eliminates the need to calculate and split your project budget across multiple calendar months or maintain separate spreadsheets to track time-bound initiatives.<br /> <br /> Custom time periods in AWS Budgets is available today in all AWS commercial Regions, except the AWS GovCloud (US) Regions and the China Regions.<br /> <br /> To learn more about custom time periods in AWS Budgets, see&nbsp;<a href=\"https://docs.aws.amazon.com/cost-management/latest/userguide/budgets-managing-costs.html\" target=\"_blank\" title=\"AWS Budgets User Guide\">Managing your costs with AWS Budgets</a>&nbsp;in the AWS Billing User Guide.</p>", "company": "aws.amazon.com", "_k": "8f3923264c12b9e892799628ae96e08b730fc1364466574e193ed41442dda265"}
{"title": "AWS Network Firewall enhances console, monitoring, and security features", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-enhances-console-monitoring-security-features/", "published": "2025-09-17T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Network Firewall now offers enhancements to its console, monitoring dashboard, and security controls. These improvements include expanded monitoring insights and advanced TLS Inspection features. These updates provide customers with enhanced visibility into their firewall's performance and stronger security measures for outbound connections.<br /> <br /> The monitoring dashboard now provides deeper insights into traffic going to AWS services such as Amazon S3, Amazon DynamoDB, and AWS Backup, which can be sent over PrivateLink endpoints. The dashboard also gives visibility into top source and destination IP addresses based on packets and bytes processed. Customers can filter the dashboard based on IP addresses and protocol, enabling more targeted analysis of network traffic patterns.<br /> <br /> To further strengthen security, AWS Network Firewall has introduced session holding for TLS Inspection. This feature prevents any TCP and TLS establishment packets from reaching destination servers until TLS protocol rules matching on Server Name Indication (SNI) have been evaluated. This enhancement provides stronger security controls for outbound traffic and helps protect against connections to potentially malicious targets. These new features are available in all AWS Regions where AWS Network Firewall is offered.<br /> <br /> To learn more about these new features and other AWS Network Firewall capabilities, visit the AWS Network Firewall <a contenteditable=\"false\" href=\"https://aws.amazon.com/network-firewall/\" style=\"cursor: pointer;\">product page</a> and the service <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/network-firewall/latest/developerguide/\" style=\"cursor: pointer;\">documentation</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "80e0b9d442dfb51939e8779cf878179e2554e25eb83d28bca2829a146f9d3752"}
{"title": "AWS End User Messaging now supports CloudFormation for SMS", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-end-user-messaging-cloudformation-sms/", "published": "2025-09-17T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, <a href=\"https://aws.amazon.com/end-user-messaging/\">AWS End User Messaging</a> SMS announces support for AWS CloudFormation, enabling customers to deploy and manage SMS resources using AWS CloudFormation templates. Using AWS CloudFormation, customers can standardize how they setup and manage their SMS resources along side their other AWS resources in the development environment simplifying deployments and delivery pipelines. SMS resources supported via CloudFormation include phone numbers, sender IDs, configuration sets, protection configurations, opt-out lists, resource policies, and phone pools.<br /> <br /> AWS End User Messaging provides developers with a scalable and cost-effective messaging infrastructure without compromising the safety, security, or results of their communications. Developers can integrate messaging to support uses cases such as one-time passcodes (OTP) at sign-ups, account updates, appointment reminders, delivery notifications, promotions and more.<br /> <br /> Support for CloudFormation for SMS resources is available in all AWS Regions where End User Messaging is available, see the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Region</a> table.<br /> <br /> To learn more, see <a href=\"https://aws.amazon.com/end-user-messaging/\">AWS End User Messaging</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "b85e67987a6974646bd0481e3f8ea52801bd953eba0b77efe27e5f95c8644efd"}
{"title": "Amazon RDS for MySQL announces Extended Support minor 5.7.44-RDS.20250818", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-mysql-extended-support-minor-5744-rds/", "published": "2025-09-17T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/mysql/\" style=\"cursor: pointer;\">Amazon Relational Database Service (RDS) for MySQL</a> now supports new Amazon RDS Extended Support minor version 5.7.44-RDS.20250818. We recommend that you upgrade to this version to fix known security vulnerabilities and bugs in prior versions of MySQL. Learn more about upgrading your database instances, including minor and major version upgrades, in the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_UpgradeDBInstance.MySQL.html\" style=\"cursor: pointer;\">Amazon RDS User Guide</a>.<br /> <br /> Amazon RDS Extended Support provides you more time, up to three years, to upgrade to a new major version to help you meet your business requirements. During Extended Support, Amazon RDS will provide critical security and bug fixes for your MySQL databases on Aurora and RDS after the community ends support for a major version. You can run your MySQL databases on Amazon RDS with Extended Support for up to three years beyond a major version’s end of standard support date. Learn more about Extended Support in the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/extended-support.html\" style=\"cursor: pointer;\">Amazon RDS User Guide</a> and the <a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/mysql/pricing/#faqs:~:text=How%20can%20I%20estimate%20my%20RDS%20Extended%20Support%20charges%3F\" style=\"cursor: pointer;\">Pricing FAQs</a>.<br /> <br /> Amazon RDS for MySQL makes it simple to set up, operate, and scale MySQL deployments in the cloud. See <a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/mysql/pricing/\" style=\"cursor: pointer;\">Amazon RDS for MySQL Pricing</a> for pricing details and regional availability. Create or update a fully managed Amazon RDS database in the <a contenteditable=\"false\" href=\"https://console.aws.amazon.com/rds/home\" style=\"cursor: pointer;\">Amazon RDS Management Console</a>.</p>", "company": "aws.amazon.com", "_k": "6619fc4f3d196b6d1f4039ef3335035ccec4e55df2a70008ee06dfcd3bbdc2a1"}
{"title": "AWS Parallel Computing Service (PCS) now supports Amazon EC2 Capacity Blocks for ML", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-parallel-computing-service-ec2-capacity-blocks-ml/", "published": "2025-09-17T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Parallel Computing Service (PCS) now supports <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/capacityblocks/\" style=\"cursor: pointer;\">Amazon EC2 Capacity Blocks for ML</a>. You can now use Amazon EC2 instances reserved using EC2 Capacity Blocks natively in PCS clusters.<br /> <br /> Native support for EC2 Capacity Blocks in PCS simplifies capacity planning for cutting-edge GPU-based workloads in Slurm clusters, helping to ensure that GPU capacity is available when and where it’s needed. EC2 Capacity Blocks can be associated with PCS compute node groups via an EC2 Launch Template.<br /> <br /> PCS is a managed service that makes it easier for you to run and scale your high performance computing (HPC) workloads and build scientific and engineering models on AWS using Slurm. You can use PCS to build complete, elastic environments that integrate compute, storage, networking, and visualization tools. PCS simplifies cluster operations with managed updates and built-in observability features, helping to remove the burden of maintenance. You can work in a familiar environment, focusing on your research and innovation instead of worrying about infrastructure.<br /> <br /> PCS now supports EC2 Capacity Blocks in all AWS Regions where both services are available. Read more about PCS support for EC2 Capacity Blocks in the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/pcs/latest/userguide/capacity-blocks.html\" style=\"cursor: pointer;\">PCS User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "fd9f1bf16993be11899ca92b15f79fe09b146121c41aaea077464df8315df2ee"}
{"title": "Amazon EKS introduces a new catalog of community add-ons in the AWS GovCloud (US) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-eks-community-addons-govcloud/", "published": "2025-09-16T17:49:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon Elastic Kubernetes Service (EKS) announced a new catalog of community add-ons that includes metrics-server, kube-state-metrics, cert-manager, prometheus-node-exporter, fluent-bit, and external-dns. This enables you to easily find, select, configure, and manage popular open-source Kubernetes add-ons directly through EKS. Each add-on has been packaged, scanned, and validated for compatibility by EKS, with container images securely hosted in an EKS-owned private Amazon Elastic Container Registry (ECR) repository.<br /> <br /> To make Kubernetes clusters production-ready, you need to integrate various operational tools and add-ons. These add-ons can come from various sources including AWS and open-source community repositories. Now, EKS makes it easy for you to access a broader selection of add-ons, providing a unified management experience for <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/eks/latest/userguide/workloads-add-ons-available-eks.html\" style=\"cursor: pointer;\" target=\"_blank\">AWS</a> and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/eks/latest/userguide/community-addons.html\" style=\"cursor: pointer;\" target=\"_blank\">community</a>&nbsp;add-ons. You can view available add-ons, compatible versions, configuration options, and install and manage them directly through the EKS Console, API, CLI, eksctl, or IaC tools like AWS CloudFormation.<br /> <br /> This feature is available in all AWS GovCloud (US) Regions. To learn more visit the EKS <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/eks/latest/userguide/eks-add-ons.html\" style=\"cursor: pointer;\" target=\"_blank\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "2de2003ca1db505544b2c225504462f2e1b9bf425d9c4689042aaa0d46191a66"}
{"title": "Amazon EC2 I7i instances now available in South America (São Paulo), Canada West (Calgary) regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-i7i-instances-sao-paulo-calgary-regions/", "published": "2025-09-16T17:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Web Services (AWS) announces the availability of high performance Storage Optimized Amazon EC2 I7i instances in the AWS South America (São Paulo), Canada West (Calgary) regions. Powered by 5th generation Intel Xeon Scalable processors with an all-core turbo frequency of 3.2 GHz, these new instances deliver up to 23% better compute performance and more than 10% better price performance over previous generation I4i instances. Powered by 3rd generation AWS Nitro SSDs, I7i instances offer up to 45TB of NVMe storage with up to 50% better real-time storage performance, up to 50% lower storage I/O latency, and up to 60% lower storage I/O latency variability compared to I4i instances.<br /> <br /> I7i instances offer the best compute and storage performance for x86-based storage optimized instances in Amazon EC2, ideal for I/O intensive and latency-sensitive workloads that demand very high random IOPS performance with real-time latency to access the small to medium size datasets (multi-TBs). Additionally, torn write prevention feature support up to 16KB block sizes, enabling customers to eliminate database performance bottlenecks.<br /> <br /> I7i instances are available in eleven sizes - nine virtual sizes up to 48xlarge and two bare metal sizes - delivering up to 100Gbps of network bandwidth and 60Gbps of Amazon Elastic Block Store (EBS) bandwidth.<br /> To learn more, visit the I7i instances <a href=\"https://aws.amazon.com/ec2/instance-types/i7i/\" target=\"_blank\">page</a>.</p>", "company": "aws.amazon.com", "_k": "035141bc22e186ac7842ad3861c8082e3b1759f35d2e39a26e95073f2637316e"}
{"title": "Amazon Lex provides generative AI based enhanced natural language understanding in eight new languages", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-lex-generative-ai-natural-language-eight-languages/", "published": "2025-09-16T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Lex now allows you to leverage large language models (LLMs) to improve the natural language understanding of your deterministic conversational AI bots in eight new languages: Chinese, Japanese, Korean, Portuguese, Catalan, French, Italian, and German. With this capability, your voice- and chat-bots can better handle complex utterances, maintain accuracy despite spelling errors, and extract key information from verbose inputs to fulfill the customer’s request. For example, a customer could say ‘Hi I want to book a flight for my wife, my two kids and myself’, and the LLM will properly identify to book flight tickets for four people.</p> \n<p>This feature is available in 10 commercial AWS Regions where Amazon Connect is available: Europe (Ireland), Europe (Frankfurt), US East (N. Virginia), Asia Pacific (Seoul), Europe (London), Asia Pacific (Tokyo), US West (Oregon), Asia Pacific (Singapore), Asia Pacific (Sydney), Canada (Central). To learn more about this feature, visit <a href=\"https://docs.aws.amazon.com/lexv2/latest/dg/assisted-nlu.html\">Amazon Lex documentation</a> or to learn how Amazon Connect and Amazon Lex deliver cloud-based conversational AI experiences for contact centers, please visit the Amazon Connect <a href=\"https://aws.amazon.com/connect/self-service/\">website</a>.</p>", "company": "aws.amazon.com", "_k": "ee63103a5caebee358233091788c21ab34c22f0f9464481c4834bec7c8fa3276"}
{"title": "New fault action in AWS FIS to inject I/O latency on Amazon EBS volumes", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-fis-action-inject-io-latency-on-ebs/", "published": "2025-09-16T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon EBS announced a new latency injection action in AWS Fault Injection Service (FIS), a fully managed service for running fault injection experiments. You can now use this action to inject I/O latency on your volumes as part of a controlled testing experiment to understand how your mission-critical applications respond to storage faults. With the new fault action, you can test your architecture against elevated storage latency, allowing you to observe application behavior and fine-tune your monitoring and recovery processes to ensure high availability.<br /> <br /> EBS volumes are designed to meet the needs of highly available, latency-sensitive applications such as Oracle, SAP HANA, and Microsoft SQL Server. The latency injection action simulates degraded I/O performance on your volume to replicate the real-world signals, such as Amazon CloudWatch alarms and operating system timeouts, that occur during storage performance issues. Using this action, you can build confidence that your application can withstand and quickly recover from disruptions that cause high I/O latency on your EBS volume. To get started, you can directly use the pre-defined latency injection experiment templates available in the EBS and FIS consoles. Alternatively, you can customize these experiment templates or create your own experiment templates to meet your application-specific testing needs. You can integrate these latency injection experiments into your existing chaos engineering tests, continuous integration, and release testing, as well as combine multiple FIS actions in one experiment.<br /> <br /> This new action is available in all <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">AWS Regions</a> where AWS FIS is available. To learn more, visit the <a href=\"https://docs.aws.amazon.com/ebs/latest/userguide/ebs-fis.html\" target=\"_blank\">EBS FIS actions user guide</a>.</p>", "company": "aws.amazon.com", "_k": "73dffa5ebe0ecd98b87f36508ebc9f74cf3b5ea8e336a9168284d3d58156f5e2"}
{"title": "Amazon EC2 supports detailed performance stats on all NVMe local volumes", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-detailed-performance-stats-nvme-local-volumes/", "published": "2025-09-16T16:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon announced the availability of detailed performance statistics for Amazon EC2 instance store NVMe volumes. This new capability delivers real-time visibility into the performance of your AWS Nitro System-based EC2 instance store NVMe volumes, making it easier to monitor storage health and quickly resolve application performance issues.</p> \n<p>With EC2 detailed performance statistics, you can access 11 comprehensive metrics at one second granularity to monitor input/output (I/O) statistics of your locally attached NVMe volumes, including queue length measurements, IOPS, throughput, and detailed I/O latency histograms. These metrics are similar to the <a href=\"https://docs.aws.amazon.com/ebs/latest/userguide/nvme-detailed-performance-stats.html\" target=\"_blank\">detailed performance statistics available for EBS volumes</a>, providing a consistent monitoring experience across both storage types. The granular visibility provided by these metrics helps you identify specific workloads affected by performance variations, and optimize your application's IO patterns for maximum efficiency. Additionally, the metrics include latency histograms broken down by IO size, providing even more detailed insights into performance patterns.<br /> <br /> Detailed performance statistics for EC2 instance store NVMe volumes are available by default for all Nitro-based EC2 instances with locally attached NVMe volumes across all AWS Commercial and China Regions, at no additional charge.</p> \n<p>To learn more about the EC2 instance store NVMe detailed performance statistics and how to access them, please visit the documentation <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/nvme-detailed-performance-stats.html\" target=\"_blank\">here</a>.</p>", "company": "aws.amazon.com", "_k": "370290b24e980484dc7a21e8908d6bf26a43fd03415079b3d087cf3438ce0262"}
{"title": "Amazon AppStream 2.0 adds support for fractional GPU instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-appstream-fractional-gpu/", "published": "2025-09-16T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon AppStream 2.0 announces support for Graphics G6 instances with fractionalized GPU sizes, which are built on the <a href=\"https://aws.amazon.com/ec2/instance-types/g6/\">EC2 G6 family</a>, designed to cater to graphics applications that need smaller GPU fractions.<br /> <br /> Graphics G6 instances with fractionalized GPU sizes&nbsp;(G6f and Gr6f) allow users to utilize only the GPU resources they need, rather than provisioning full GPU instances. This approach helps enable better resource optimization through shared GPU capacity, offering flexibility to choose smaller GPU fractions (such as 1/2, 1/4, or 1/8) that align with specific workload requirements. Organizations can benefit from reduced costs by avoiding over-provisioning while maintaining access to GPU capabilities for applications that don't require full GPU power.<br /> <br /> These new instance types are available in 10 AWS Regions, including US East (N. Virginia, Ohio), US West (Oregon), Canada (Central), Europe (Frankfurt, London), Asia Pacific (Tokyo, Mumbai, Sydney), and South America (Sao Paulo). AppStream 2.0 offers pay-as-you-go pricing, see <a href=\"https://aws.amazon.com/appstream2/pricing/\">Amazon AppStream 2.0 Pricing</a> for more information.<br /> <br /> To get started, select an AppStream 2.0&nbsp;Graphics G6 instances with fractionalized GPU sizes when launching an image builder or creating a new fleet. You can launch&nbsp;Graphics G6 instances with fractionalized GPU sizes using either the AWS management console or the AWS SDK. To learn more, see <a href=\"https://docs.aws.amazon.com/appstream2/latest/developerguide/instance-types.html\">AppStream 2.0 Instance Families</a>.</p>", "company": "aws.amazon.com", "_k": "ca7516a33ad70ec17b25328b0f632a5c4da4c9dec2f1505b9969055aa410a44a"}
{"title": "AWS Storage Gateway now supports IPv6", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-storage-gateway-ipv6/", "published": "2025-09-16T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/storagegateway/\">AWS Storage Gateway</a> announces Internet Protocol version 6 (IPv6) support for AWS Storage Gateway endpoints, APIs, and gateway appliance interfaces. This enhancement enables both IPv6 and IPv4 access to our new dual-stack endpoints. The existing AWS Storage Gateway endpoints supporting IPv4 only will remain available for backwards compatibility.<br /> <br /> AWS Storage Gateway provides on-premises access to data stored in AWS storage. With this launch, customers can standardize their applications and workflows for managing their AWS Storage Gateway resources on IPv6 while maintaining backward compatibility with IPv4 clients. By using the new dual-stack capabilities in the Storage Gateway appliances, service endpoints, and APIs, customers can transition from IPv4 to IPv6 gradually without needed to switch all their networking at once.<br /> <br /> AWS Storage Gateway support for IPv6 is available in all <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Regions where the service is offered</a>. To learn more, visit the <a href=\"https://docs.aws.amazon.com/storagegateway/\">AWS Storage Gateway user guide</a>.</p>", "company": "aws.amazon.com", "_k": "40b6666c475ddaf88125be05898dcedcdb40857b4ec4a9730493dab3df8fd84a"}
{"title": "Amazon Aurora PostgreSQL Limitless Database is now available in the AWS GovCloud (US-East, US-West) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-aurora-postgresql-limitless-database-aws-govcloud-regions/", "published": "2025-09-16T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Aurora PostgreSQL Limitless Database,&nbsp;now available in AWS GovCloud (US-East, US-West) Regions, makes it easy for you to scale your relational database workloads by providing a serverless endpoint that automatically distributes data and queries across multiple Amazon Aurora Serverless instances while maintaining the transactional consistency of a single database. Aurora PostgreSQL Limitless Database offers capabilities such as distributed query planning and transaction management, removing the need for you to create custom solutions or manage multiple databases to scale. As your workloads increase, Aurora PostgreSQL Limitless Database adds additional compute resources while staying within your specified budget, so there is no need to provision for peak, and compute automatically scales down when demand is low.<br /> <br /> Aurora PostgreSQL Limitless Database is available with PostgreSQL 16.6, 16.8, and 16.9 compatibility in these regions.<br /> <br /> For pricing details and Region availability, visit <a href=\"https://aws.amazon.com/rds/aurora/pricing/\" target=\"_blank\">Amazon Aurora pricing</a>. To learn more, read the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/limitless.html\" target=\"_blank\">Aurora PostgreSQL Limitless Database</a> documentation and get started by creating an Aurora PostgreSQL Limitless Database in only a few steps in the <a href=\"https://console.aws.amazon.com/rds/home\" target=\"_blank\">Amazon RDS console</a>.</p>", "company": "aws.amazon.com", "_k": "51b63241180168e558be7ee384f959b7a6de5a0fa4ce805f8f81832d7809c01c"}
{"title": "Amazon S3 now supports conditional deletes in S3 general purpose buckets", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-s3-conditional-deletes-s3-general-purpose-buckets/", "published": "2025-09-16T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon S3 now supports conditional deletes in S3 general purpose buckets, which verify that an object is unchanged before deleting it. This helps you to prevent accidental deletions in high-concurrency, multiple-writer scenarios.<br /> <br /> You can now perform conditional deletes using the HTTP if-match header with an ETag value. Amazon S3 will only allow your delete request to succeed if the Etag provided matches that of the object. Additionally, you can use the s3:if-match condition key in your S3 bucket policies to enforce conditional delete operations. For example, you can require clients to use the HTTP if-match header in both S3 DeleteObject and S3 DeleteObjects API requests, helping you to minimize the risk of accidentally deleting objects in your bucket.<br /> <br /> Conditional deletes are available in S3 general purpose buckets at no additional cost in all AWS Regions. You can use the Amazon S3 API, SDKs, and CLI to perform conditional deletes. To learn more, visit the <a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/conditional-deletes.html\" target=\"_blank\">S3 User guide</a>.</p>", "company": "aws.amazon.com", "_k": "c079c4bb1043d616fa48345dc0734984cbb74ccaeca70094e0140d1f4f9ccf01"}
{"title": "Amazon EC2 R8i and R8i-flex instances are now available in additional regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-r8i-r8i-flex-additional-regions/", "published": "2025-09-16T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, Amazon Elastic Compute Cloud (Amazon EC2) R8i and R8i-flex instances are available in the Asia Pacific (Malaysia, Singapore) and Europe (Frankfurt) regions. These instances are powered by custom Intel Xeon 6 processors, available only on AWS, delivering the highest performance and fastest memory bandwidth among comparable Intel processors in the cloud. The R8i and R8i-flex instances offer up to 15% better price-performance, and 2.5x more memory bandwidth compared to previous generation Intel-based instances. They deliver 20% better performance than R7i instances, with even higher gains for specific workloads. They are up to 30% faster for PostgreSQL databases, up to 60% faster for NGINX web applications, and up to 40% faster for AI deep learning recommendation models compared to R7i.<br /> <br /> R8i-flex, our first memory-optimized Flex instances, are the easiest way to get price performance benefits for a majority of memory-intensive workloads. They offer the most common sizes, from large to 16xlarge, and are a great first choice for applications that don't fully utilize all compute resources.<br /> <br /> R8i instances are a great choice for all memory-intensive workloads, especially for workloads that need the largest instance sizes or continuous high CPU usage. R8i instances offer 13 sizes including 2 bare metal and the new 96xlarge size for the largest applications. <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/sap/latest/general/sap-hana-aws-ec2.html\" style=\"cursor: pointer;\">R8i instances are SAP-certified </a>and deliver 142,100 aSAPS, the highest among all comparable machines in on-premises and cloud environments, delivering exceptional performance for mission-critical SAP workloads.<br /> <br /> To get started, sign in to the <a contenteditable=\"false\" href=\"https://aws.amazon.com/console/\" style=\"cursor: pointer;\">AWS Management Console</a>. Customers can purchase these instances via Savings Plans, On-Demand instances, and Spot instances. For more information about the new <a contenteditable=\"false\" href=\"https://aws.amazon.com/ec2/instance-types/r8i\" style=\"cursor: pointer;\">R8i and R8i-flex </a>instances visit the AWS News <a contenteditable=\"false\" href=\"https://aws.amazon.com/blogs/aws/best-performance-and-fastest-memory-with-the-new-amazon-ec2-r8i-and-r8i-flex-instances/\" style=\"cursor: pointer;\" target=\"_blank\">blog</a>.</p>", "company": "aws.amazon.com", "_k": "da270f32a7df35cfcd6964a9bd8f3efd9414c829f34974a19e0d240158557c27"}
{"title": "AWS Transfer Family is now available in AWS Asia Pacific (Taipei) region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-transfer-family-asia-pacific-taipei-region/", "published": "2025-09-16T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Customers in AWS Asia Pacific (Taipei) Region can now use AWS Transfer Family for file transfers over Secure File Transfer Protocol (SFTP), File Transfer Protocol (FTP), FTP over SSL (FTPS) and Applicability Statement 2 (AS2).<br /> <br /> AWS Transfer Family provides fully managed file transfers for Amazon Simple Storage Service (Amazon S3) and Amazon Elastic File System (Amazon EFS) over SFTP, FTP, FTPS and AS2 protocols. In addition to file transfers, Transfer Family enables common file processing and event-driven automation for managed file transfer (MFT) workflows, helping customers to modernize and migrate their business-to-business file transfers to AWS.<br /> <br /> To learn more about AWS Transfer Family, visit our <a href=\"https://aws.amazon.com/aws-transfer-family/\">product page</a> and <a href=\"https://docs.aws.amazon.com/transfer/latest/userguide/what-is-aws-transfer-family.html\">user-guide</a>. See the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Region Table</a> for complete regional availability information.</p>", "company": "aws.amazon.com", "_k": "9c44d529aadd8480b967e937b087304dc0ed979396568147f930ccf81648c004"}
{"title": "Amazon OpenSearch Service announces Derived Source for storage optimization", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-derived-source/", "published": "2025-09-16T04:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon OpenSearch Service introduces support for Derived Source, a new feature that can help reduce the amount of storage required for your OpenSearch Service domains. With derived source support, you can skip storing source fields and dynamically derive them when required.&nbsp;<br /> <br /> OpenSearch stores each ingested document in the&nbsp;_source&nbsp;field and also indexes individual fields for search. The&nbsp;_source&nbsp;field can consume significant storage space. To reduce storage use, you can configure OpenSearch to skip storing the&nbsp;_source&nbsp;field and instead reconstruct it dynamically when needed, for example, during&nbsp;search,&nbsp;get,&nbsp;mget,&nbsp;reindex, or&nbsp;update&nbsp;operations.<br /> <br /> Derived Source is available in all regions where OpenSearch 3.1 is supported. The feature is opt-in and can be enabled at index creation using composite index settings.<br /> <br /> Please refer to the AWS Regional Services List for more information about Amazon OpenSearch Service availability. To learn more about Derived Source, see the&nbsp;<a href=\"https://docs.opensearch.org/latest/field-types/metadata-fields/source/#derived-source\">OpenSearch documentation</a>.</p>", "company": "aws.amazon.com", "_k": "eb8fb206cc3922f93f044f0430097044168c147e30044554fe534c78117e01bd"}
{"title": "Amazon OpenSearch Service announces Star-Tree Index", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-star-tree-index/", "published": "2025-09-16T04:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>OpenSearch has introduced&nbsp;Star-Tree Index, a new feature that significantly improves aggregation performance for high-cardinality and multi-dimensional queries. This index pre-aggregates data across configured dimensions and metrics at ingestion time, enabling sub-second response times for frequent aggregations like&nbsp;terms,&nbsp;histogram, and&nbsp;range.<br /> <br /> Star-Tree Index is designed for real-time analytics and requires no changes to query syntax; OpenSearch automatically uses the optimized path when supported queries are detected. Early benchmarks show faster aggregation performance on large datasets. This makes it ideal for use cases such as observability, personalization, and time-series dashboards. It works best with append-only data and builds during segment refresh/merge, with minimal impact on ingestion throughput.<br /> <br /> Star-Tree Index is available in all regions where OpenSearch 3.1 is supported. The feature is opt-in and can be enabled at index creation time using composite index settings.<br /> <br /> Please refer to the AWS Regional Services List for more information about Amazon OpenSearch Service availability. To learn more about Star-Tree Index, see the <a href=\"https://docs.opensearch.org/latest/search-plugins/star-tree-index/\">OpenSearch Documentation</a></p>", "company": "aws.amazon.com", "_k": "d8cb80706dd6ca7419c3bd9eb23363ed258826797cae30bc71cc7edeabd67e4d"}
{"title": "Amazon S3 Batch Operations now supports managing buckets or prefixes in a single step in AWS Management Console", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-s3-batch-operations-managing-buckets-console/", "published": "2025-09-15T21:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<h4><span style=\"font-weight: 300;\">Amazon S3 Batch Operations now supports managing objects within an S3 bucket, prefix, suffix, or more, in a single step in AWS Management Console. When creating an S3 Batch Operation, customers can specify the objects on which to perform the operation. With this feature, you have the option to instead specify an entire bucket, prefix, suffix, creation date, or storage class. Amazon S3 Batch Operations will then quickly apply the operation to all the matching objects and notify you when the job completes.</span></h4> \n<p>S3 Batch Operations lets you easily perform one-time or recurring batch workloads such as copying objects between staging and production buckets, restoring archived backups from S3 Glacier storage classes, or computing objects checksum to verify the content of stored datasets, at any scale. After starting your job, S3 Batch Operations automatically processes all of the objects that match your filtering criteria. You will receive a detailed completion report with the status of each object once the job completes.<br /> <br /> This feature of S3 Batch Operations is available in all AWS Regions. You can get started through AWS Management Console, AWS Command Line Interface (CLI), or the AWS Software Development Kit (SDK) client. For pricing information, please visit the Management &amp; Insights tab of the&nbsp;<a href=\"https://aws.amazon.com/s3/pricing/\">Amazon S3 pricing</a>&nbsp;page. To learn more about S3 Batch Operations, visit the&nbsp;<a href=\"https://docs.aws.amazon.com/AmazonS3/latest/userguide/batch-ops.html\">S3 User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "64f840a111311002cefb2e804f89ff0a097a7982624daef8c9a99c81411b2c6b"}
{"title": "Amazon SageMaker HyperPod announces health monitoring agent support for Slurm clusters", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sagemaker-hyperpod-health-monitoring-agent-slurm/", "published": "2025-09-15T18:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, Amazon SageMaker HyperPod announces the general availability of the health monitoring agent for Slurm clusters. SageMaker HyperPod helps you provision resilient clusters for running machine learning (ML) workloads and developing state-of-the-art models such as large language models (LLMs), diffusion models, and foundation models (FMs). The health monitoring agent performs passive, background health checks of instances to identify problems in key areas without impact on application behavior or performance, flags failures instantly, and replaces any unhealthy instances to keep your training jobs running smoothly.&nbsp;</p> \n<p>The agent runs continuously on all GPU- or Trainium-based nodes in your HyperPod cluster, watching for hardware issues such as unresponsive GPUs or NVLink error counters. When a fault is detected, it marks the node as unhealthy and automatically reboots or replaces it with a healthy node, keeping your jobs running without requiring manual intervention. The agent also follows a co-ordinated approach to handling failures with the job auto-resume functionality available with Slurm clusters. For example, jobs with auto-resume enabled will continue from the last saved checkpoint once nodes are replaced by the agent. This hands-free recovery—already available on HyperPod clusters orchestrated with Amazon EKS—now gives Slurm clusters the same resilient environment, helping teams train large models for weeks without disruption and reclaim time and costs that would otherwise be lost to mid-run failures. In addition, customers can now also reboot their nodes using a simple command in case of intermittent issues such as GPU driver issues requiring reset.&nbsp;</p> \n<p>Health monitoring agent for Slurm is available in all regions where HyperPod is generally available. The agent is auto-enabled on all newly created Slurm clusters; to enable it on an existing cluster, simply upgrade to the latest HyperPod AMI by calling the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/APIReference/API_UpdateClusterSoftware.html\">UpdateClusterSoftware API</a>. To learn more, visit the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/sagemaker-hyperpod-resiliency-slurm.html\">Amazon SageMaker HyperPod documentation</a>.</p>", "company": "aws.amazon.com", "_k": "72049ba088e3813e9af2a9f17b1e69db0f65e64efc3c0387395fb8f3edcf85f2"}
{"title": "Amazon OpenSearch Service now supports AI-powered forecasting", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-service-ai-forecasting/", "published": "2025-09-15T17:40:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>You can now generate AI-powered forecasts and visualizations on time-series data that has been indexed into Amazon OpenSearch domains.<br /> <br /> Forecasts can be used to enhance various analytics use cases to power insights into trending infrastructure utilization and events, application or business metrics, and more. They can help you anticipate upcoming changes in areas such as business metrics, website traffic, system performance, and more. You can easily get started with this feature by setting up forecasts within <a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/dashboards.html\">OpenSearch dashboards</a> or the <a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/application.html\">OpenSearch UI</a>. No data science or AI expertise is required.<br /> <br /> AI-powered forecasts are available in all Amazon OpenSearch Service regions that support OpenSearch 3.1+ domains. Learn more from the <a href=\"https://docs.opensearch.org/docs/latest/observing-your-data/forecast/index/\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "b4f491c5cc1992fa34f161bd7d83996b2b40f375469ebdf8b21efd07de63819a"}
{"title": "Amazon Connect Cases now supports date range filters in the case list view", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-cases-date-range-filters/", "published": "2025-09-15T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect Cases now supports filtering by date ranges in the case list view, enabling contact center managers and agents to efficiently manage their case workloads. For example, users can filter cases created in the last 30 days for monthly reporting, view cases modified in the last 24 hours to monitor recent activity, or surface cases with potential SLA breaches in the next 2 days to help prevent violations.<br /> <br /> Amazon Connect Cases is available in the following AWS regions: US East (N. Virginia), US West (Oregon), Canada (Central), Europe (Frankfurt), Europe (London), Asia Pacific (Seoul), Asia Pacific (Singapore), Asia Pacific (Sydney), Asia Pacific (Tokyo), and Africa (Cape Town) AWS regions. To learn more and get started, visit the Amazon Connect Cases <a href=\"https://aws.amazon.com/connect/cases/\">webpage</a> and <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/cases.html\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "0fb6de835241dc86ca496e019898ada63e106c66db9b49ba3e6234e055e8939c"}
{"title": "Amazon OpenSearch Service now supports OpenSearch version 3.1", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-opensearch-service-opensearch-version-3-1/", "published": "2025-09-15T14:30:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>You can now run OpenSearch version 3.1 in Amazon OpenSearch Service. OpenSearch 3.1 introduces several improvements in areas like search relevance and performance, and introduces features that simplify development of vector-driven applications for generative AI workloads.</p> \n<p>This launch incorporates Lucene 10 that enables optimized vector field indexing resulting in faster indexing times and reduced index sizes, sparse indexing for CPU and storage efficiency improvements, and vector quantization to reduce memory usage. Other key areas of improvement include improved range query performance, which benefits log analytics and time-series workloads, and reduced latency for high-cardinality aggregations.</p> \n<p>This launch also introduces a new <a href=\"https://docs.opensearch.org/latest/search-plugins/search-relevance/using-search-relevance-workbench/\" target=\"_blank\">Search Relevance Workbench</a>, which provides integrated tools for teams to evaluate and optimize search quality through experimentation. Additionally, this launch includes several improvements in vector search capabilities. First, <a href=\"https://opensearch.org/blog/introducing-the-z-score-normalization-technique-for-hybrid-search/\" target=\"_blank\">Z-score normalization</a> improves hybrid search reliability by reducing the impact of outliers and different score scales. Finally, you can now boost efficiency of searches using <a href=\"https://docs.opensearch.org/latest/vector-search/optimizing-storage/memory-optimized-search/\" target=\"_blank\">memory-optimized search</a> that enables the Faiss engine to operate efficiently by memory-mapping the index file and using the operating system's file cache to serve search requests.</p> \n<p>For information on upgrading to OpenSearch 3.1, please see the <a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/version-migration.html\" target=\"_blank\">documentation</a>. OpenSearch 3.1 is now available in all AWS Regions where Amazon OpenSearch Service is available.</p>", "company": "aws.amazon.com", "_k": "a3b7af681cb090e6d97583272cb698912d0f15960b7c6198e0ea52e581836e68"}
{"title": "Announcing on-demand deployment for custom Meta Llama models in Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/on-demand-deployment-custom-meta-llama-models-amazon-bedrock/", "published": "2025-09-15T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, customers can use the on-demand deployment option in Amazon Bedrock for their Meta Llama 3.3 models that have been fine-tuned or distilled in Bedrock. Models customized on or after September 15, 2025 will be eligible.<br /> <br /> This enables Bedrock customers to reduce costs by processing requests in real time without requiring pre-provisioned compute resources. Customers only pay for what they use, eliminating the need for an always-on infrastructure.<br /> <br /> Amazon Bedrock is a fully managed service that offers a choice of high-performing foundation models from leading AI companies via a single API. Amazon Bedrock also provides a broad set of capabilities customers need to build generative AI applications with security, privacy, and responsible AI built in.<br /> <br /> To get started, visit documentation <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/model-customization-use.html\" target=\"_blank\"><u>here</u></a>.</p>", "company": "aws.amazon.com", "_k": "e048d866e4f2cad5143c4542c4cf622df33ec603d365a785a980a81d89968923"}
{"title": "Now generally available: Amazon EC2 R8gn instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/generally-available-amazon-ec2-r8gn-instances/", "published": "2025-09-15T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the general availability of the new Amazon Elastic Compute Cloud (Amazon EC2) R8gn instances. These instances are powered by AWS Graviton4 processors to deliver up to 30% better compute performance than AWS Graviton3 processors. R8gn instances feature the latest 6th generation AWS Nitro Cards, and offer up to 600 Gbps network bandwidth, the highest network bandwidth among network optimized EC2 instances.<br /> <br /> Take advantage of the enhanced networking capabilities of R8gn to scale the performance and throughput of network-intensive workloads such as SQL and NoSQL databases, and in-memory databases. For increased scalability, these instances offer instance sizes up to 48xlarge, including two metal sizes, up to 1,536 GiB of memory, and up to 60 Gbps of bandwidth to Amazon Elastic Block Store (EBS). These instances support Elastic Fabric Adapter (EFA) networking on the 16xlarge, 24xlarge, 48xlarge, metal-24xl, and metal-48xl sizes, which enables lower latency and improved cluster performance for workloads deployed on tightly coupled clusters.<br /> <br /> The new instances are available in the following AWS Regions: US East (N. Virginia), and US West (Oregon). Metal sizes are only available in US East (N. Virginia).<br /> <br /> To learn more, see <a href=\"https://aws.amazon.com/ec2/instance-types/r8g\" target=\"_blank\">Amazon R8gn</a> Instances. To begin your Graviton journey, visit the <a href=\"https://aws.amazon.com/ec2/graviton/level-up-with-graviton/\" target=\"_blank\">Level up your compute with AWS Graviton page</a>. To get started, see <a href=\"https://console.aws.amazon.com/\" target=\"_blank\">AWS Management Console</a>, <a href=\"https://aws.amazon.com/cli/\" target=\"_blank\">AWS Command Line Interface (AWS CLI)</a>, and <a href=\"https://docs.aws.amazon.com/AWSJavaScriptSDK/latest/AWS/EC2.html\" target=\"_blank\">AWS SDKs</a>.</p>", "company": "aws.amazon.com", "_k": "1b66a8f6093d8f7e7ac3d6a40c023d55613bc5a68549d1ff0d53094661c981c9"}
{"title": "AWS Organizations now provides account state information for member accounts", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-organizations-provides-account-state-information-member-accounts/", "published": "2025-09-15T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/organizations/\" target=\"_blank\">AWS Organizations</a> provides a new State field in the AWS Organizations Console and APIs (DescribeAccount, ListAccounts, and ListAccountsForParent) to enhance AWS account lifecycle visibility. With this launch, the account state, a new State field replaced the existing account status, Status field in the AWS Organizations Console, however both Status and State fields will remain available in the APIs until September 9, 2026.<br /> <br /> This launch allows you to have a more granular account state information such as, 'SUSPENDED' for AWS-enforced suspension, 'PENDING_CLOSURE' for in-process closure requests, and 'CLOSED' for accounts in their 90-day reinstatement window, and more. After September, 2026 the Status field will be fully deprecated. Customers using account vending pipelines should update their implementations to reference the State field before the Status field deprecation date. This feature is available in all AWS commercial and AWS GovCloud (US) Regions. To get started managing your accounts, please see the <a href=\"https://aws.amazon.com/blogs/mt/updates-to-account-status-information-in-aws-organizations/\" target=\"_blank\">blog post</a> and <a href=\"https://docs.aws.amazon.com/organizations/latest/userguide/orgs_manage_accounts_account_state.html\" target=\"_blank\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "b8e9078b02484e7a57e9c66d508fc2515ba78b100d9c9a2faef5cbff938ad093"}
{"title": "Amazon Managed Service for Prometheus now available in 11 additional AWS Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-managed-service-prometheus-11-regions/", "published": "2025-09-15T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Managed Service for Prometheus is now available in Asia Pacific (Jakarta), Asia Pacific (Hyderabad), Asia Pacific (Osaka), Asia Pacific (Melbourne), Asia Pacific (Taipei), Canada West (Calgary), Europe (Spain), Israel (Tel Aviv), Mexico (Central), Middle East (Bahrain), and US West (N. California). Amazon Managed Service for Prometheus is a fully managed Prometheus-compatible monitoring service that makes it easy to monitor and alarm on operational metrics at scale.</p> \n<p>The list of all supported regions where Amazon Managed Service for Prometheus is generally available can be found in the <a href=\"https://docs.aws.amazon.com/prometheus/latest/userguide/what-is-Amazon-Managed-Service-Prometheus.html\" target=\"_blank\">user guide</a>. Customers can send up to 1 billion active metrics to a single workspace and can create multiple workspaces per account, where a workspace is a logical space dedicated to the storage and querying of Prometheus metrics.</p> \n<p>To learn more about Amazon Managed Service for Prometheus, visit the user guide or <a href=\"https://aws.amazon.com/prometheus/\" target=\"_blank\">product page</a>.</p>", "company": "aws.amazon.com", "_k": "69f5a7f097b8d07801892d6f54accea4fdfddb307d7c3f46bf2d68466ae5718f"}
{"title": "Amazon ECS Service Connect adds support for cross-account workloads", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ecs-service-connect-cross-account-workloads/", "published": "2025-09-12T19:32:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/service-connect.html\">Amazon ECS Service Connect</a> now supports seamless communication between services residing in different AWS accounts through integration with <a href=\"https://aws.amazon.com/ram/\">AWS Resource Access Manager</a> (AWS RAM). This enhancement simplifies resource sharing, reduces duplication, and promotes consistent service-to-service communication across environments for organizations with multi-account architectures.<br /> <br /> Amazon ECS Service Connect leverages AWS Cloud Map namespaces for storing information about ECS services and tasks. To enable seamless cross-account communication between Amazon ECS Service Connect services, you can now share the underlying AWS Cloud Map namespaces using AWS RAM with individual AWS accounts, specific Organizational Units (OUs), or your entire AWS Organization. To get started, create a resource share in AWS RAM, add the namespaces you want to share, and specify the principals (accounts, OUs, or the organization) that should have access. This enables platform engineers to use the same namespace to register Amazon ECS Service Connect services residing in multiple AWS accounts, simplifying service discovery and connectivity. Application developers can then build services that rely on a consistent, shared registry without worrying about availability or synchronization across accounts. Cross-account connectivity support improves operational efficiency and makes it easier to scale Amazon ECS workloads as your organization grows by reducing duplication and streamlining access to common services.</p> \n<p>This feature is available with both Fargate and EC2 launch modes now in&nbsp;<a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">all commercial AWS Regions</a>&nbsp;via the AWS Management Console, API, SDK, CLI, and CloudFormation. To learn more, please refer to the Amazon ECS Service Connect&nbsp;<a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/service-connect.html\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "5b0e631550017218391e31a7e70e6c6b0a4993dcb48a5abd11725e7e8f9901b9"}
{"title": "AWS Direct Connect support for 4-byte Autonomous System numbers for Virtual interfaces", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-direct-connect-4-byte-autonomous-system-numbers/", "published": "2025-09-12T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Direct Connect now supports 4-byte Autonomous System (AS) numbers for virtual interfaces. Direct Connect uses the standard Border Gateway Protocol to provide customers with private connectivity to the AWS global network. However, customers with complex, multi-tenant network topologies or who need to maintain consistent AS numbering across their entire network can run into challenges with the maximum limit of 65,536 possible 2-byte AS numbers. With 4-byte AS numbers, customers can now use the entire range supported by RFC 6793, up to 4,294,967,294.<br /> Support for 4-byte AS numbers is now available in all AWS regions globally and on all Direct Connect virtual interface types. To get started, visit the AWS Direct Connect Console or use the updated APIs to create virtual interfaces with the new 4-byte AS numbers. For more information, check out the&nbsp;<a href=\"https://docs.aws.amazon.com/directconnect/latest/UserGuide/welcome.html\">AWS Direct Connect documentation</a>.</p>", "company": "aws.amazon.com", "_k": "b14d5588913f4df1ec583f713b588eaf9049e47cd3c01309d3184e6b62059eac"}
{"title": "Announcing general availability of Amazon EC2 M4 and M4 Pro Mac instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-m4-pro-mac-instances-generally-available/", "published": "2025-09-12T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, Amazon Elastic Compute Cloud (Amazon EC2) M4 and M4 Pro Mac instances are now generally available (GA). M4 Mac instances offer up to 20% better application build performance compared to M2 Mac instances, while M4 Pro Mac instances deliver up to 15% better application build performance compared to M2 Pro Mac instances. These instances are ideal for building and testing applications for Apple platforms such as iOS, macOS, iPadOS, tvOS, watchOS, visionOS, and Safari.<br /> <br /> M4 and M4 Pro Mac instances are powered by the AWS Nitro System, providing up to 10 Gbps network bandwidth and 8 Gbps of Amazon Elastic Block Store (Amazon EBS) storage bandwidth. M4 Mac instances are built on Apple M4 Mac Mini computers featuring 10‑core CPU, 10‑core GPU, 24GB unified memory, and 16‑core Neural Engine. M4 Pro Mac instances feature a 14‑core CPU, 20‑core GPU, 48GB unified memory, and 16‑core Neural Engine. Both instance families come with a new 2TB instance store volume per EC2 Mac Dedicated Host, providing low latency storage for improved caching and build/test performance.<br /> <br /> M4 and M4 Pro Mac instances enable Apple developers to migrate their most demanding build and test workloads onto AWS and run significantly more tests in parallel using multiple Xcode simulators. This accelerates application iterations and reduces time to market. Customers now have access to the most advanced Apple silicon Macs on AWS to meet their requirements, while also enabling them to modernize their Apple CI/CD with dozens of AWS services. M4 and M4 Pro Mac instances support macOS Sequoia version 15.6 and newer AMIs (Amazon Machine Images).</p> \n<p>Amazon EC2 M4 and M4 Pro Mac instances are available in US East (N. Virginia) and US West (Oregon). To learn more or get started, see our <a href=\"https://aws.amazon.com/blogs/aws/announcing-amazon-ec2-m4-and-m4-pro-mac-instances/\">launch blog</a>, Amazon <a href=\"https://aws.amazon.com/ec2/instance-types/mac/\" target=\"_blank\">EC2 Mac Instances</a> or visit the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/ec2-mac-instances.html\" target=\"_blank\">EC2 Mac documentation reference</a>.</p>", "company": "aws.amazon.com", "_k": "2a60675e0aadd319a3630af8a903aeae8aa7654ef14290254a862ff5b884ee9c"}
{"title": "Amazon SageMaker notebooks now support P6-B200 instance type", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sagemaker-notebooks-p6-b200-instance-type/", "published": "2025-09-12T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>We are pleased to announce general availability of Amazon EC2 P6-B200 instances on SageMaker notebooks.<br /> <br /> <a href=\"https://aws.amazon.com/ec2/instance-types/p6/\" target=\"_blank\">Amazon EC2 P6-B200 instances</a> are powered by 8 NVIDIA Blackwell GPUs with 1440 GB of high-bandwidth GPU memory and 5th Generation Intel Xeon processors (Emerald Rapids). These instances deliver up to 2x better performance compared to P5en instances for AI training. Customers can use P6-B200 instances to interactively develop and fine-tune large foundation models, including LLMs, mixture of experts models, and multi-modal reasoning models. These instances enable efficient experimentation with larger models directly in JupyterLab or CodeEditor environments for generative AI applications such as enterprise copilots and content generation across text, images, and video.<br /> <br /> Amazon EC2 P6-B200 instances are available for SageMaker notebooks in the AWS US East (Ohio) and US West (Oregon) regions.<br /> <br /> Visit developer guides for instructions on setting up and using <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-updated-jl.html\" target=\"_blank\">JupyterLab</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/code-editor.html\" target=\"_blank\">CodeEditor</a> applications on <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/studio-updated.html\" target=\"_blank\">SageMaker Studio</a> and <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/nbi.html\" target=\"_blank\">SageMaker notebook instances</a>.</p>", "company": "aws.amazon.com", "_k": "6f9503b1736e32920b468a968876073e567584b3e0898717f1019a193a24e6c6"}
{"title": "New EFA metrics for improved observability of AWS networking", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-efa-metrics-improved-observability-networking/", "published": "2025-09-12T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS has introduced five new Elastic Fabric Adapter (EFA) metrics to enhance network observability for AI/ML and High Performance Computing (HPC) workloads. These new metrics help diagnose performance issues by tracking retransmitted packets and bytes, retransmit timeout events, impaired remote connection events, and unresponsive remote receiver events.<br /> <br /> With these new metrics, you can monitor for network congestion or instance configuration issues, allowing for timely action to maintain application performance. The metrics are implemented as counters at the per-EFA device level, accumulating data since instance launch or the most recent driver reset. Stored in the sys filesystem, these metrics counters are accessible via the instance command line. For enhanced monitoring and alerting capabilities, you can integrate these metrics into Prometheus scripts, facilitating export to third-party tools such as Grafana for dashboard creation and alarm setting. The new metrics are available on Nitro v4 (and later) instances and require EFA installer version 1.43.0 or higher. For a full list of metrics and to learn more on how to use them, please visit the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/efa-working-monitor.html\" target=\"_blank\">Monitor an EFA</a> user guide. For a comprehensive list of instances built on different Nitro system versions, please refer to the <a href=\"https://docs.aws.amazon.com/ec2/latest/instancetypes/ec2-nitro-instances.html\" target=\"_blank\">AWS Nitro Systems documentation</a>.<br /> <br /> These new metrics are supported in all commercial AWS Regions, the AWS GovCloud (US) Regions, and the China Regions. To learn more about EFA, please visit the EFA <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/efa.html\" target=\"_blank\">documentation</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "df30c19e1c1f5d956a45b2f847057a4180a0b3caac91e4b94ce730b263c6a055"}
{"title": "Deadline Cloud is now available in Asia Pacific (Seoul) and Europe (London)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/deadline-cloud-in-asia-pacific-seoul-europe-london/", "published": "2025-09-12T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>We are excited to announce that AWS Deadline Cloud is now available in Asia Pacific (Seoul) and Europe (London). Deadline Cloud is a fully managed service that simplifies render management for teams creating computer-generated graphics and visual effects for films, television, broadcasting, web content, and design. Customers can now use Deadline Cloud to scale their render farms in regions that are close to their creative teams, enabling better integration with existing AWS services and creative pipelines.<br /> <br /> Deadline Cloud is now available in 10 AWS regions worldwide: US East (N. Virginia and Ohio), US West (Oregon), Asia Pacific (Seoul, Singapore, Sydney and Tokyo), and Europe (Frankfurt, Ireland, and London). For more information about AWS Regions and where Deadline Cloud is available, see the AWS Region table. To learn more about AWS Deadline Cloud and its regional availability, visit the <a contenteditable=\"false\" href=\"https://aws.amazon.com/deadline-cloud/\" style=\"cursor: pointer;\">AWS Deadline Cloud product page</a> or refer to the <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Regional Services List</a>.</p>", "company": "aws.amazon.com", "_k": "bb0786f3924e2921c4b3db203bc56e1f1bdd55aa05fbaed735a127354c11910e"}
{"title": "Malware Protection for S3 Expands File Size and Archive Scanning Limits", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/malware-protection-s3-file-size-archive-scanning-limits/", "published": "2025-09-12T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces enhanced scanning capabilities for <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/guardduty/latest/ug/gdu-malware-protection-s3.html\" style=\"cursor: pointer;\">GuardDuty Malware Protection for Amazon S3</a>. This launch increases scanning capabilities by raising the maximum file size limit from 5GB to 100 GB. Additionally, the archive processing capacity has been expanded to handle up to 10,000 files per archive, up from the previous limit of 1,000 files.<br /> <br /> GuardDuty Malware Protection for S3 is a fully managed threat detection service that automatically scans objects uploaded to S3 buckets and alerts customers of malware, viruses, and other malicious code before they can impact workloads or downstream processes. With this launch, GuardDuty S3 malware scanning now offers customers even better protection for large files and comprehensive archive collections stored in Amazon S3.<br /> <br /> The enhanced scanning capabilities are automatically enabled in all <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/guardduty/latest/ug/guardduty_regions.html#gd-regional-feature-availability\" style=\"cursor: pointer;\">AWS Regions</a> where GuardDuty Malware Protection for S3 is supported. To learn more about GuardDuty Malware Protection for S3 and its features, please visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/guardduty/latest/ug/how-malware-protection-for-s3-gdu-works.html\" style=\"cursor: pointer;\">AWS Documentation</a>.</p>", "company": "aws.amazon.com", "_k": "be567092a0c1430853c38c4b698467156ed85a128181e6fbcada839fc1ac5fb6"}
{"title": "Amazon SageMaker Unified Studio supports remote connection from VS Code", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/sagemaker-unified-studio-vs-code/", "published": "2025-09-12T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces remote connection from Visual Studio Code (VS Code) to Amazon SageMaker Unified Studio. This new capability allows developers to leverage their VS Code setup while accessing the scalable compute resources of Amazon SageMaker. By connecting VS Code to SageMaker Unified Studio, you can maintain your existing development workflows and configurations within a unified environment for AWS analytics and AI/ML services.<br /> <br /> SageMaker Unified Studio, part of the next generation of Amazon SageMaker, offers a broad set of fully managed cloud interactive development environments (IDE), including JupyterLab and Code Editor based on Code-OSS (Open Source Software) like VS Code. Starting today, you can use your customized local VS Code setup while accessing your compute resources and data in Amazon SageMaker. Authentication is simple and secure using the AWS Toolkit extension in VS Code. This integration provides a streamlined path from your local development environment to scalable infrastructure for running data processing, SQL analytics, and ML workflows.<br /> <br /> This feature is available in all Regions where Amazon SageMaker Unified Studio is available. To learn more, refer to the <a href=\"https://docs.aws.amazon.com/sagemaker-unified-studio/latest/adminguide/what-is-sagemaker-unified-studio.html\">Administrator Guide</a> and <a href=\"https://docs.aws.amazon.com/sagemaker-unified-studio/latest/userguide/what-is-sagemaker-unified-studio.html\">User Guide</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "067cee309d95b1ee41d2e9764c0df6cea43344005f4497a379320f2c9b384a88"}
{"title": "Amazon RDS Proxy announces support for end-to-end IAM authentication", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-proxy-end-to-end-iam-authentication/", "published": "2025-09-12T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a contenteditable=\"false\" href=\"https://aws.amazon.com/rds/proxy/\" style=\"cursor: pointer;\">Amazon Relational Database Service (RDS) Proxy</a> now supports end-to-end IAM authentication for connections to Amazon Aurora and RDS database instances. This feature allows you to connect from your applications to your databases through RDS Proxy using AWS Identity and Access Management (IAM) authentication. End-to-end IAM authentication simplifies credential management, reduces credential rotation overhead, and enables you to leverage IAM's robust authentication and authorization capabilities throughout your database connection path.<br /> <br /> With end-to-end IAM authentication, you can now connect to your databases through RDS Proxy without needing to register or store credentials in Secrets Manager. End-to-end IAM authentication is available for MySQL and PostgreSQL database engines in all AWS Regions where RDS Proxy is supported.<br /> <br /> Many applications, including those built on modern serverless architectures, may need to have a high number of open connections to the database or may frequently open and close database connections, exhausting the database memory and compute resources. Amazon RDS Proxy allows applications to pool and share database connections, improving your database efficiency and application scalability. RDS Proxy helps improve application scalability, resiliency, and security.<br /> <br /> For information on supported database engine versions and regional availability of RDS Proxy, refer to our <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/Concepts.RDS_Fea_Regions_DB-eng.Feature.RDSProxy.html\" style=\"cursor: pointer;\">RDS</a> and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/AmazonRDS/latest/AuroraUserGuide/Concepts.Aurora_Fea_Regions_DB-eng.Feature.RDS_Proxy.html\" style=\"cursor: pointer;\">Aurora</a> documentations.</p>", "company": "aws.amazon.com", "_k": "2b7713aba6e736371e5521447b26feccd95a8535f6588ae14ff9bdb1d5557f99"}
{"title": "Upcoming events", "url": "https://developers.google.com/", "published": "", "source": "https://developers.google.com/events", "company": "developers.google.com", "_k": "af7aa76e9c155f2a183de5dcc301d22de55f927593b2888b41eeedd500388b64"}
{"title": "Introducing Claude Sonnet 4.5 in Amazon Bedrock: Anthropic’s most intelligent model, best for coding and complex agents", "url": "https://aws.amazon.com/blogs/aws/introducing-claude-sonnet-4-5-in-amazon-bedrock-anthropics-most-intelligent-model-best-for-coding-and-complex-agents/", "published": "2025-09-29T17:56:16+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Amazon Web Services announces Claude Sonnet 4.5 in Amazon Bedrock, featuring advanced capabilities in coding, tool handling, and long-horizon tasks, with improvements in memory management, context processing, and industry-specific applications across finance, research, and cybersecurity sectors.", "company": "aws.amazon.com", "_k": "84f5d2e5fc8e83ef7f367e066a5698a0f09fe0cb9b5758a8c01dc9b5da4d81c3"}
{"title": "AWS Weekly Roundup: Amazon S3, Amazon Bedrock AgentCore, AWS X-Ray and more (September 29, 2025)", "url": "https://aws.amazon.com/blogs/aws/aws-weekly-roundup-amazon-s3-amazon-bedrock-agentcore-aws-x-ray-and-more-september-29-2025/", "published": "2025-09-29T16:42:04+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Wow, can you all believe it? We’re nearing the end of the year already. Next thing you know, AWS re:Invent will be here! This is our biggest event that takes place every year in Las Vegas from December 1st to December 5th where we reveal and release many of the things that we’ve been working […]", "company": "aws.amazon.com", "_k": "8817e1bd1f40757264ea663880c390ab25e4b288263346b8278fc17ced69eb67"}
{"title": "Amazon EC2 Auto Scaling now supports Internet Protocol Version 6 (IPv6)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-auto-scaling-ipv6/", "published": "2025-09-29T17:45:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon EC2 Auto Scaling (ASG) now supports Internet Protocol Version 6 (IPv6), enabling dual-stack configuration (IPv4 and IPv6) connectivity for your Auto Scaling groups. <a href=\"https://aws.amazon.com/vpc/ipv6/\" style=\"cursor: pointer;\">IPv6</a> enables an expanded address space, enabling you to scale your application on AWS beyond the typical constraints of the number of IPv4 addresses in your VPC.<br /> <br /> With IPv6, you can assign easy to manage contiguous IP ranges to micro-services and can get virtually unlimited scale for your applications. Moreover, with support for both IPv4 and IPv6, you can gradually transition applications from IPv4 to IPv6, enabling safer migration. IPv6 support is available in all <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">commercial AWS regions</a> (except New Zealand) and GovCloud regions where ASG is available. To learn more about configuring your network to use IPv6 endpoints, see the <a href=\"https://docs.aws.amazon.com/AWSEC2/latest/UserGuide/using-instance-addressing.html#ipv6-addressing\" style=\"cursor: pointer;\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "a07a226e2ee6c07e3bf2b0da014056e62bd28581bcf636da1ebd8a993b3a064c"}
{"title": "Amazon ECS announces IPv6-only support", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ecs-ipv6-only-support/", "published": "2025-09-29T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/ecs/\" target=\"_blank\">Amazon Elastic Container Service</a>&nbsp;(Amazon ECS) now supports running tasks in IPv6-only subnets. With this launch, Amazon ECS tasks and services can run using only IPv6 addresses, without requiring IPv4. This enables customers to deploy containerized applications in IPv6-only environments, scale without being limited by IPv4 address availability, and meet IPv6 compliance requirements through native IPv6 support in Amazon ECS.<br /> <br /> Previously, Amazon ECS tasks always required an IPv4 address, even when launched in dual-stack subnets. This requirement could create scaling and management challenges for customers operating large fleets of containerized applications, where IPv4 address space became a bottleneck. With IPv6-only support, Amazon ECS tasks launched in IPv6-only subnets use only IPv6 addresses. This removes IPv4 as a dependency and helps organizations that must meet IPv6 adoption or regulatory mandates.<br /> <br /> The feature works across all Amazon ECS launch types and can be used with awsvpc, bridge, and host networking modes. To get started, create IPv6-only subnets in your VPC and launch Amazon ECS services or tasks in those subnets. Amazon ECS automatically detects the configuration and provisions the appropriate networking. To learn more about IPv6-only task networking and supported AWS Regions,&nbsp;see the Amazon ECS task networking documentation for&nbsp;<a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/fargate-task-networking.html\" target=\"_blank\">AWS Fargate launch type</a>&nbsp;and&nbsp;<a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/task-networking.html\" target=\"_blank\">EC2 launch type</a>. You can also read our <a href=\"https://aws.amazon.com/blogs/containers/amazon-ecs-announces-ipv6-only-support/\" target=\"_blank\">blog post</a> for a detailed walkthrough and migration strategies.</p>", "company": "aws.amazon.com", "_k": "b183a73df5d7133f07768f75b989821e22e33025741594a605917096c7e918d5"}
{"title": "Amazon EC2 Auto Scaling expands AWS PrivateLink support to FIPS endpoints", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ec2-auto-scaling-privatelink-fips-endpoints/", "published": "2025-09-29T17:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, Amazon EC2 Auto Scaling (ASG) supports Federal Information Processing Standard (FIPS) 140-3 validated VPC endpoints. With this launch, you can use AWS PrivateLink with ASG for regulated workloads that require secure connections using FIPS 140-3 validated cryptographic modules.<br /> <br /> FIPS-compliant endpoints help organizations contracting with the U.S. federal government meet FIPS security requirements for encrypting sensitive data in supported regions. To create a VPC endpoint that connects to an ASG endpoint, see <a href=\"https://docs.aws.amazon.com/autoscaling/ec2/userguide/asg-in-vpc.html\">Setting up a VPC endpoint for Amazon EC2 Auto Scaling</a>.<br /> <br /> This capability is available in the following regions: US East (N. Virginia), US East (Ohio), US West (N. California), US West (Oregon), Canada (Central), and Canada West (Calgary).<br /> <br /> For more information about FIPS 140-3 at AWS, visit <a href=\"https://aws.amazon.com/compliance/fips/\">FIPS 140-3 Compliance</a>. To learn more about Amazon EC2 Auto Scaling, visit the ASG <a href=\"https://aws.amazon.com/ec2/autoscaling/\">product page</a>.</p>", "company": "aws.amazon.com", "_k": "c067b979a315144d91c292c4d531aab70e733098f5928134d8a5370bc1ba4855"}
{"title": "Anthropic’s Claude Sonnet 4.5 is now in Amazon Bedrock", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/anthropics-claude-sonnet-4-5-amazon-bedrock/", "published": "2025-09-29T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Customers can now use Claude Sonnet 4.5 in Amazon Bedrock, a fully managed service that offers a choice of high- performing foundation models from leading AI companies. Claude Sonnet 4.5 is Anthropic's most intelligent model, excelling at complex agents, coding, and long-horizon tasks while maintaining optimal speed and cost-efficiency for high-volume use-cases.<br /> <br /> Claude Sonnet 4.5 currently leads the SWE-bench Verified benchmarks with enhanced instruction following, better code improvement identification, stronger refactoring judgment, and more effective production-ready code generation. This model excels at powering long-running agents that tackle complex, multi-step tasks requiring peak accuracy—like autonomously managing multi-channel marketing campaigns or orchestrating cross-functional enterprise workflows. In cybersecurity, it can help teams shift from reactive detection to proactive defense by autonomously patching vulnerabilities. For financial services, it can handle everything from analysis to advanced predictive modeling.<br /> <br /> Through the Amazon Bedrock API, Claude can now automatically edit context to clear stale information from past tool calls, allowing you to maximize the model’s context. A new memory tool lets Claude store and consult information outside the context window to boost accuracy and performance.<br /> <br /> Claude Sonnet 4.5 is now available in Amazon Bedrock via global cross region inference in multiple locations. To view the full list of available regions, refer to the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-supported.html\" target=\"_blank\">documentation</a>. To get started with Claude Sonnet 4.5 in Amazon Bedrock, read the <a href=\"https://aws.amazon.com/blogs/aws/introducing-claude-sonnet-4-5-in-amazon-bedrock-anthropics-most-intelligent-model-best-for-coding-and-complex-agents/\" target=\"_blank\">News Blog</a>, visit the <a href=\"https://console.aws.amazon.com/bedrock/\" target=\"_blank\">Amazon Bedrock console</a>, Anthropic's Claude in Amazon Bedrock <a href=\"https://aws.amazon.com/bedrock/claude/\" target=\"_blank\">product page</a>, and the Amazon Bedrock <a href=\"https://aws.amazon.com/bedrock/pricing/\" target=\"_blank\">pricing page</a>.</p>", "company": "aws.amazon.com", "_k": "2723b468848ba72b5bc2e6c8379fc0c519223c62c70d8643684a100082de57ef"}
{"title": "Amazon Connect dashboards now support filtering and comparing metrics by any time range", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-connect-dashboards-filtering-comparing-metrics-time-range/", "published": "2025-09-29T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon Connect dashboards now supports selecting and comparing any time ranges enabling you to focus on specific, relevant data and perform in-depth analysis up to a maximum of 35 days in the last 3 months. Additionally, you can now select Week to Date and Month to Date time ranges. For example, if a new sales campaign launches at the start of the current week, a contact center manager can compare the current week's handle time or contact volume with the same time range last week using Week to Date, to decide if additional agents are required to handle the increasing contact volume and maintain service levels.<br /> <br /> Amazon Connect Contact Lens dashboards are available in all AWS commercial and AWS GovCloud (US-West) <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">regions</a> where Amazon Connect is offered. To learn more about dashboards, see the <a href=\"https://docs.aws.amazon.com/connect/latest/adminguide/dashboards.html\" target=\"_blank\">Amazon Connect Administrator Guide</a>. To learn more about Amazon Connect, the AWS cloud-based contact center, please visit the <a href=\"https://aws.amazon.com/connect/\" target=\"_blank\">Amazon Connect website</a>.<br /> </p>", "company": "aws.amazon.com", "_k": "cdcc8aa617f47081cb350dd0cd3ee97a2ec7db93fb1009b0903c58b4380648dd"}
{"title": "Amazon Bedrock now available in the Middle East (UAE) Region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-bedrock-middle-east-uae-region/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Beginning today, customers can use Amazon Bedrock in the Middle East (UAE) region to easily build and scale generative AI applications using a variety of foundation models (FMs) as well as powerful tools to build generative AI applications.<br /> <br /> Amazon Bedrock is a comprehensive and secure service for building generative AI applications and agents. Amazon Bedrock connects you to leading foundation models (FMs) and services to deploy and operate agents, enabling you to quickly move from experimentation to real-world deployment.<br /> <br /> To get started, visit the <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock page</a> and see the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-regions.html\">Amazon Bedrock documentation</a> for more details.</p>", "company": "aws.amazon.com", "_k": "df19c37c0750fcdaf55e06a4926b6ba481bad661e45655a761038fd01207d677"}
{"title": "AWS Network Firewall adds Reject and Alert actions for stateful domain list rule groups", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-network-firewall-reject-alert-domain-list-rule-groups/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS Network Firewall introduces Reject and Alert action support for stateful domain list rule groups, providing customers with more granular control over their network traffic. This enhancement allows customers to create Reject and Alert actions in stateful domain list rule groups using the AWS Network Firewall console, offering more flexible and precise traffic management options within their AWS environments.<br /> <br /> With this new feature, customers can now create more sophisticated and tailored network security policies. The Reject action enables customers to block specific domain-based traffic, while the Alert action allows for monitoring and logging of traffic without interrupting the flow. This granular control helps organizations improve their security posture by fine-tuning their firewall rules to better align with their specific security requirements and compliance needs.<br /> <br /> The new Reject and Alert action support for stateful domain list rule groups is available in all AWS Regions where AWS Network Firewall is offered. You can enable TLS inspection from the <a href=\"https://console.aws.amazon.com/vpc/\">Amazon VPC Console</a> or the <a href=\"https://docs.aws.amazon.com/network-firewall/latest/APIReference/\">Network Firewall API</a><br /> <br /> To learn more about this new feature and other AWS Network Firewall capabilities, visit the AWS Network Firewall <a href=\"https://aws.amazon.com/network-firewall/\">product page</a> and the service <a href=\"https://docs.aws.amazon.com/network-firewall/latest/developerguide/\">documentation</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "6b534f7363c2819c08602fe443565b89b5734ae6b6f9800e0b4017f328b53551"}
{"title": "Amazon Bedrock now available in the Asia Pacific (Thailand, Malaysia, and Taipei) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-bedrock-thailand-malaysia-taipei-regions/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Beginning today, customers can use Amazon Bedrock in the Asia Pacific (Thailand), Asia Pacific (Malaysia), and Asia Pacific (Taipei) regions to easily build and scale generative AI applications using a variety of foundation models (FMs) as well as powerful tools to build generative AI applications.<br /> <br /> Amazon Bedrock is a comprehensive and secure service for building generative AI applications and agents. Amazon Bedrock connects you to leading foundation models (FMs) and services to deploy and operate agents, enabling you to quickly move from experimentation to real-world deployment.<br /> <br /> To get started, visit the <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock page</a> and see the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-regions.html\">Amazon Bedrock documentation</a> for more details.</p>", "company": "aws.amazon.com", "_k": "744acc748d19164d73a47854b9b289d09aa32a1d1a5fe9b613a9345c5c055841"}
{"title": "Amazon Bedrock now available in the Israel (Tel Aviv) Region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-bedrock-israel-tel-aviv-region/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Beginning today, customers can use Amazon Bedrock in the Israel (Tel Aviv) region to easily build and scale generative AI applications using a variety of foundation models (FMs) as well as powerful tools to build generative AI applications.<br /> <br /> Amazon Bedrock is a comprehensive and secure service for building generative AI applications and agents. Amazon Bedrock connects you to leading foundation models (FMs) and services to deploy and operate agents, enabling you to quickly move from experimentation to real-world deployment.<br /> <br /> To get started, visit the <a href=\"https://aws.amazon.com/bedrock/\">Amazon Bedrock page</a> and see the <a href=\"https://docs.aws.amazon.com/bedrock/latest/userguide/models-regions.html\">Amazon Bedrock documentation</a> for more details.</p>", "company": "aws.amazon.com", "_k": "90cd0b6338d9a2ad622c787584143d9b4edc8c2f14e46f9e53ad9ab8042d3798"}
{"title": "AWS Backup is now available in AWS Asia Pacific (New Zealand)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-backup-in-asia-pacific-new-zealand/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Backup is now available in the in the AWS Asia Pacific (New Zealand) Region. AWS Backup is a fully-managed, policy-driven service that allows you to centrally automate data protection across multiple AWS services spanning compute, storage, and databases. Using AWS Backup, you can centrally create and manage backups of your application data, protect your data from inadvertent or malicious actions with immutable recovery points and vaults, and restore your data in the event of a data loss incident.</p> \n<p>You can get started with AWS Backup using the <a contenteditable=\"false\" href=\"https://console.aws.amazon.com/backup\" style=\"cursor: pointer;\">AWS Backup console</a>, SDKs, or CLI by creating a data protection policy and then assigning AWS resources to it using tags or Resource IDs. For more information on the features available in the Asia Pacific (New Zealand) Region, visit the AWS Backup <a contenteditable=\"false\" href=\"https://aws.amazon.com/backup/\" style=\"cursor: pointer;\">product page</a> and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/aws-backup/\" style=\"cursor: pointer;\">documentation</a>. To learn about the Regional availability of AWS Backup, see the <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Regional Services List</a>.</p>", "company": "aws.amazon.com", "_k": "a5105269f759c2e947a16a8fdbb4b086d4499d5fa90d9ad777cf62431926f90b"}
{"title": "Announcing Amazon RDS for PostgreSQL Extended Support versions R2: 12.22-rds.20250814 and 11.22-rds.20250814", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-rds-postgresql-extended-support-versions-12.22-rds-20250814-11.22-rds-20250814/", "published": "2025-09-29T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon RDS for PostgreSQL introduces Extended Support minor versions 12.22-rds.20250814 and 11.22-rds.20250814, which include important security updates and bug fixes for PostgreSQL databases.We recommend upgrading your RDS instances to these latest versions to maintain optimal security and performance of your PostgreSQL deployments.<br /> <br /> Amazon RDS Extended Support provides you more time, up to three years, to upgrade to a new major version to help you meet your business requirements. During Extended Support, Amazon RDS will provide critical security and bug fixes for your RDS for PostgreSQL databases after the community ends support for a major version. You can run your PostgreSQL databases on Amazon RDS with Extended Support for up to three years beyond a major version’s end of standard support date.<br /> <br /> You can use automatic minor version upgrades to automatically upgrade your databases to more recent minor versions during scheduled maintenance windows. You can also use Amazon RDS Blue/Green deployments for RDS for PostgreSQL using physical replication for your minor version upgrades. Learn more about upgrading your database instances, including automatic minor version upgrades and Blue/Green Deployments in the <a href=\"https://docs.aws.amazon.com/AmazonRDS/latest/UserGuide/USER_UpgradeDBInstance.PostgreSQL.html\">Amazon RDS User Guide</a>.<br /> <br /> Amazon RDS for PostgreSQL makes it simple to set up, operate, and scale PostgreSQL deployments in the cloud. See <a href=\"https://aws.amazon.com/rds/postgresql/pricing/\">Amazon RDS for PostgreSQL Pricing</a> for pricing details and regional availability. Create or update a fully managed Amazon RDS database in the <a href=\"https://console.aws.amazon.com/rds/home\">Amazon RDS Management Console</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "31a71970019f859b2c93d76f42b45d2dbd85e3cab26531b7d2e028cc7c3e4dd6"}
{"title": "Announcing Amazon ECS Managed Instances for containerized applications", "url": "https://aws.amazon.com/blogs/aws/announcing-amazon-ecs-managed-instances-for-containerized-applications/", "published": "2025-09-30T18:46:47+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "Amazon ECS Managed Instances is a new compute option that eliminates infrastructure management overhead while giving you access to the broad suite of EC2 capabilities including the flexibility to select instance types, access reserved capacity, and advanced security and observability configurations.", "company": "aws.amazon.com", "_k": "8395c8cb2f32a5d05c8a03e879e83f4aa5d835a4c54a9fa3ec8bffc4650a1cb8"}
{"title": "Announcing AWS Outposts third-party storage integration with Dell and HPE", "url": "https://aws.amazon.com/blogs/aws/announcing-aws-outposts-third-party-storage-integration-with-dell-and-hpe/", "published": "2025-09-30T16:39:54+00:00", "source": "https://aws.amazon.com/blogs/aws/feed/", "summary": "AWS Outposts is now integrated with Dell PowerStore and HPE Alletra MP B10000 systems, enabling customers to seamlessly use their on-premises external storage infrastructure with AWS services while maintaining data residency requirements.", "company": "aws.amazon.com", "_k": "1f830c0b674acb684c9a7502c69273d559028c2b4b2c3bc86e2f0786d5541dc4"}
{"title": "Amazon SageMaker managed MLflow is now available in the AWS GovCloud (US) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sagemaker-mlflow-available-aws-govcloud/", "published": "2025-09-30T18:14:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon SageMaker managed MLflow is now available in both AWS GovCloud (US-West) and AWS GovCloud (US-East) Regions.<br /> <br /> Amazon SageMaker managed MLflow streamlines AI experimentation and accelerates your GenAI journey from idea to production. MLflow is a popular open-source tool that helps customers manage experiment tracking to providing end-to-end observability, reducing time-to-market for generative AI development.<br /> <br /> To learn more, visit the <a href=\"https://docs.aws.amazon.com/sagemaker/latest/dg/mlflow.html\">Amazon SageMaker developer guide</a>.</p>", "company": "aws.amazon.com", "_k": "bb2905f171c76d147e3356214b9cd34366831796222b5d976444563b07d0def2"}
{"title": "Amazon CloudWatch and OpenSearch Service expand region support for integrated analytics experience", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-cloudwatch-opensearch-service-region-integrated-analytics-experience/", "published": "2025-09-30T17:42:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon CloudWatch and OpenSearch Service integrated analytics experience is now available in 5 additional commercial regions: Asia Pacific (Osaka), Asia Pacific (Seoul), Europe (Milan), Europe (Spain), and US West (N. California).<br /> <br /> With this integration, CloudWatch Logs customers have two more query languages for log analytics, in addition to CloudWatch Logs Insights QL. Customers can use SQL to analyze data, correlate logs using JOIN, sub-queries, and use SQL functions, namely, JSON, mathematical, datetime, and string functions for intuitive log analytics. They can also use the OpenSearch PPL to filter, aggregate and analyze their data. With a few clicks, CloudWatch Logs customers can create OpenSearch dashboards for VPC, WAF, and CloudTrail logs to monitor, analyze, and troubleshoot using visualizations derived from the logs. OpenSearch customers no longer have to copy logs from CloudWatch for analysis, or create ETL pipelines. Now, they can use OpenSearch Discover to analyze CloudWatch logs in-place, and build indexes and dashboards on CloudWatch Logs.<br /> <br /> With this launch the integrated experience is now generally available in Asia Pacific (Osaka), Asia Pacific (Seoul), Europe (Milan), Europe (Spain), and US West (N. California) along with regions where&nbsp;<a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/direct-query-s3.html#direct-query-cloudwatch-logs-regions-table\">OpenSearch Service direct query</a>&nbsp;is available. Please read pricing and free tier details on&nbsp;<a href=\"https://aws.amazon.com/cloudwatch/pricing/\">Amazon CloudWatch Pricing</a>, and&nbsp;<a href=\"https://aws.amazon.com/opensearch-service/pricing/\">OpenSearch Service Pricing</a>. To get started, please refer to&nbsp;<a href=\"https://docs.aws.amazon.com/AmazonCloudWatch/latest/logs//CloudWatchLogs-OpenSearch-Dashboards.html\">Amazon CloudWatch Logs vended dashboard</a>&nbsp;and&nbsp;<a href=\"https://docs.aws.amazon.com/opensearch-service/latest/developerguide/direct-query-s3.html\">Amazon OpenSearch Service Developer Guide</a>.</p>", "company": "aws.amazon.com", "_k": "0b5fe6594b7132c64accf1a583104a3d14a32fbe052b467dcebe94885a21e81a"}
{"title": "AWS Direct Connect announces new location in Madrid, Spain", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-direct-connect-madrid-mad3/", "published": "2025-09-30T16:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announced the opening of a new&nbsp;<a href=\"https://aws.amazon.com/directconnect\">AWS Direct Connect</a>&nbsp;location within the Digital Realty MAD3 data center near Madrid, Spain. You can now establish private, direct network access to all public AWS Regions (except those in China), AWS GovCloud Regions, and&nbsp;<a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/\">AWS Local Zones</a>&nbsp;from this location. This site is the third site in Madrid and the fourth AWS Direct Connect location within Spain. This Direct Connect location offers dedicated 10 Gbps and 100 Gbps connections with MACsec encryption available.<br /> <br /> The Direct Connect service enables you to establish a private, physical network connection between AWS and your data center, office, or colocation environment. These private connections can provide a more consistent network experience than those made over the public internet.&nbsp;<br /> <br /> For more information on the over 146 Direct Connect locations worldwide, visit the&nbsp;<a href=\"https://aws.amazon.com/directconnect/locations/\">locations</a>&nbsp;section of the Direct Connect&nbsp;<a href=\"https://aws.amazon.com/directconnect\">product detail pages</a>. Or, visit our&nbsp;<a href=\"https://aws.amazon.com/directconnect/getting-started/\">getting started</a>&nbsp;page to learn more about how to purchase and deploy Direct Connect.</p>", "company": "aws.amazon.com", "_k": "45d2794df9330a7dad2ad65e9e07def90d4d4286b4b0adbe78934cc04237089d"}
{"title": "AWS Direct Connect announces 100G expansion in Bogota, Colombia", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-direct-connect-100g-expansion-bogota/", "published": "2025-09-30T16:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announced the expansion of 10 Gbps and 100 Gbps dedicated connections with MACsec encryption capabilities at the existing&nbsp;<a href=\"https://aws.amazon.com/directconnect\">AWS Direct Connect</a>&nbsp;location in the Equinix BG1 data center near Bogota, Colombia. You can now establish private, direct network access to all public AWS Regions (except those in China), AWS GovCloud Regions, and&nbsp;<a href=\"https://aws.amazon.com/about-aws/global-infrastructure/localzones/\">AWS Local Zones</a>&nbsp;from this location.<br /> <br /> The Direct Connect service enables you to establish a private, physical network connection between AWS and your data center, office, or colocation environment. These private connections can provide a more consistent network experience than those made over the public internet.&nbsp;<br /> <br /> For more information on the over 146 Direct Connect locations worldwide, visit the&nbsp;<a href=\"https://aws.amazon.com/directconnect/locations/\">locations</a>&nbsp;section of the Direct Connect&nbsp;<a href=\"https://aws.amazon.com/directconnect\">product detail pages</a>. Or, visit our&nbsp;<a href=\"https://aws.amazon.com/directconnect/getting-started/\">getting started</a>&nbsp;page to learn more about how to purchase and deploy Direct Connect.</p>", "company": "aws.amazon.com", "_k": "3315ccbeaa8b34111c130c90bcbd02204c1c9426a70da3757c23ab7ca5691d11"}
{"title": "Amazon SNS expands IPv6 support to the AWS GovCloud (US) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sns-ipv6-aws-govcloud/", "published": "2025-09-30T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/sns/\">Amazon Simple Notification Service (Amazon SNS)</a>&nbsp;now allows customers to make API requests over Internet Protocol version 6 (IPv6) in the AWS GovCloud (US) Regions. The new endpoints have also been validated under the Federal Information Processing Standard (FIPS) 140-3 program.<br /> <br /> Amazon SNS is a fully managed messaging service that enables publish/subscribe messaging between distributed systems, microservices, and event-driven serverless applications. With this update, customers have the option of using either IPv6 or IPv4 when sending requests over dual-stack public or VPC endpoints.&nbsp;<br /> <br /> SNS now supports IPv6 in all Regions where the service is available, including AWS Commercial, AWS GovCloud (US), and China Regions. For more information on using IPv6 with Amazon SNS, please refer to our&nbsp;<a href=\"https://docs.aws.amazon.com/sns/latest/dg/sns-dual-stack.html\">developer guide</a>.</p>", "company": "aws.amazon.com", "_k": "a74b34f0df70fc60b1fe12054c50ca3f28b0638c1713c6129476fcb4f540bcf1"}
{"title": "Amazon SNS expands support for FIPS 140-3 endpoints", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-sns-fips-endpoints/", "published": "2025-09-30T15:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p><a href=\"https://aws.amazon.com/sns/\">Amazon Simple Notification Service (Amazon SNS)</a>&nbsp;now supports additional endpoints that have been validated under the Federal Information Processing Standard (FIPS) 140-3 program in AWS Regions in the United States and Canada.<br /> <br /> FIPS compliant endpoints help companies contracting with the US federal government meet the FIPS security requirement to encrypt sensitive data in supported regions. With this expansion, you can use Amazon SNS for workloads that require a FIPS 140-3 validated cryptographic module when sending requests over dual-stack public or VPC endpoints.<br /> <br /> Amazon SNS FIPS compliant endpoints are now available in the following regions: US East (N. Virginia), US East (Ohio), US West (N. California), US West (Oregon), Canada (Central), Canada West (Calgary) and AWS GovCloud (US). To learn more about FIPS 140-3 at AWS, visit&nbsp;<a href=\"https://aws.amazon.com/compliance/fips/\">FIPS 140-3 Compliance</a>.</p>", "company": "aws.amazon.com", "_k": "0bae7cb74f31b51cc0387a6a9cd65e32dc948f536f7c82aed35045aab2309953"}
{"title": "AWS Transform now enables Terraform for VMware network automation", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-transform-terraform-vmware-network-automation/", "published": "2025-09-30T14:04:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Transform now offers Terraform as an additional option to generate network infrastructure code automatically from VMware environments. The service converts your source network definitions into reusable Terraform modules, complementing current AWS CloudFormation and AWS Cloud Development Kit (CDK) support.<br /> <br /> AWS Transform for VMware is an agentic AI service that automates the discovery, planning, and migration of VMware workloads, accelerating infrastructure modernization with increased speed and confidence. These migrations require recreating network configurations while maintaining operational consistency. The service now generates Terraform modules alongside CDK and AWS CloudFormation templates. This addition enables organizations to maintain existing deployment pipelines while using preferred tools for modular, customizable network configurations.</p> \n<p>The Terraform module generation capability is available in all <a href=\"https://docs.aws.amazon.com/transform/latest/userguide/transform-app-vmware-acct-connections.html#transform-app-vmware-target-acct\">AWS Regions where the service is offered</a>.</p> \n<p>To learn more, visit the AWS Transform for VMware <a href=\"https://aws.amazon.com/transform/vmware/\">product page</a>, read the <a href=\"https://docs.aws.amazon.com/transform/latest/userguide/transform-app-vmware.html\">user guide</a>, or get started in the <a href=\"https://console.aws.amazon.com/transform/home\">AWS Transform web experience</a>.</p>", "company": "aws.amazon.com", "_k": "ad7cdb38a6ad35e6fca18c3100a54082f32546e9d4c80dd4dd48bffff5b89794"}
{"title": "AWS Transfer Family adds support for additional IAM condition keys", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-transfer-family-iam-condition-keys/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Transfer Family now supports four new service-specific condition keys for Identity and Access Management (IAM). With this feature, administrators can create more granular IAM policies and service control policies (SCPs) to restrict configurations for Transfer Family resources, enhancing security controls and compliance management.&nbsp;</p> \n<p>IAM condition keys allow you to author policies that enforce access control based on API request context. With these new condition keys, you can now author policies based on Transfer Family context to control which protocols, endpoint types, and storage domains can be configured through policy conditions. For example, you can use transfer:RequestServerEndpointType to prevent the creation of public servers, or transfer:RequestServerProtocols to ensure only SFTP servers can be created, enabling you to define additional permission guardrails for Transfer Family actions.&nbsp;<br /> <br /> The new IAM condition keys are available in all&nbsp;<a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\">AWS Regions where AWS Transfer Family is available.&nbsp;</a>To learn more, visit the<a href=\"https://docs.aws.amazon.com/service-authorization/latest/reference/list_awstransferfamily.html\">&nbsp;IAM Service Authorization Reference</a>&nbsp;and&nbsp;<a href=\"https://docs.aws.amazon.com/transfer/latest/userguide/transfer-condition-keys.html\">Transfer Family User Guide</a>. To learn more about how to manage permissions within your organization through SCPs, visit the&nbsp;<a href=\"https://docs.aws.amazon.com/organizations/latest/userguide/orgs_manage_policies_scps.html\">AWS Organizations User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "ddf293e642f9f1ef4d081d460ee564bf01d27c8339f8d599629b6536f1e48ec0"}
{"title": "AWS Firewall Manager launches in AWS Asia Pacific (Taipei) Region", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-firewall-manager-aws-asia-pacific-taipei-region/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Firewall Manager announces that it is now available in AWS Asia Pacific (Taipei) Region. AWS Firewall Manager helps cloud security administrators and site reliability engineers protect applications while reducing the operational overhead of manually configuring and managing rules.<br /> <br /> Working with AWS Firewall Manager, customers can provide defense in depth policies to address the full range of AWS security services for customers hosting their applications and workloads in AWS Taipei. Customers wishing to establish secured assets using AWS WAF can create and maintain security policies with AWS Firewall Manager.<br /> <br /> To learn more about how AWS Firewall Manager works, see the AWS Firewall Manager <a href=\"https://docs.aws.amazon.com/waf/latest/developerguide/fms-chapter.html\" target=\"_blank\">documentation</a> for more details and the <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" target=\"_blank\">AWS Region Table</a> for the list of regions where AWS Firewall Manager is currently available. To learn more about AWS Firewall Manager, its features, and its pricing, visit the <a href=\"https://aws.amazon.com/firewall-manager/\" target=\"_blank\">AWS Firewall Manager website</a>.</p>", "company": "aws.amazon.com", "_k": "8e0774b727d6007b55981f78e1767f55bf0109718ddc47ab66d84eaf711058d2"}
{"title": "Amazon Elastic VMware Service (Amazon EVS) is now available in Asia Pacific (Singapore) and Europe (London) Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-evs-singapore-london-regions/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, we're announcing that Amazon Elastic VMware Service (Amazon EVS) is now available in all availability zones in the Asia Pacific (Singapore) and Europe (London) Regions. This expansion provides more options to leverage AWS scale and flexibility for running your VMware workloads in the cloud.<br /> <br /> Amazon EVS lets you run VMware Cloud Foundation (VCF) directly within your Amazon Virtual Private Cloud (VPC) on EC2 bare-metal instances, powered by AWS Nitro. Using either our step-by-step configuration workflow or the AWS Command Line Interface (CLI) with automated deployment capabilities, you can set up a complete VCF environment in just a few hours. This rapid deployment enables faster workload migration to AWS, helping you eliminate aging infrastructure, reduce operational risks, and meet critical timelines for exiting your data center.<br /> <br /> The added availability in the Asia Pacific (Singapore) and Europe (London) Regions gives your VMware workloads lower latency through closer proximity to your end users, compliance with data residency or sovereignty requirements, and additional high availability and resiliency options for your enhanced redundancy strategy.<br /> <br /> To get started, visit the Amazon EVS <a href=\"https://aws.amazon.com/evs/\" target=\"_blank\">product detail page</a> and <a href=\"https://docs.aws.amazon.com/evs/latest/userguide/what-is-evs.html\" target=\"_blank\">user guide</a>.&nbsp;</p>", "company": "aws.amazon.com", "_k": "9b2b3b073cca7e76b45e566239b0adb08e53ceea40afa66ac1d58940587c4f8d"}
{"title": "AWS Outposts now supports external block volumes from Dell and HPE storage arrays", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-outposts-external-block-volumes-dell-hpe-storage-arrays/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Starting today, customers can use boot and data volumes backed by Dell PowerStore and HPE Alletra Storage MP B10000 storage arrays with Amazon Elastic Compute Cloud (Amazon EC2) instances on AWS Outposts, including authenticated and encrypted volumes. This enhancement extends our existing support for boot and data volumes to include Dell and HPE storage arrays, alongside our current support for NetApp® on-premises enterprise storage arrays and Pure Storage® FlashArray™. Outposts is a fully managed service that extends AWS infrastructure, AWS services, APIs, and tools to virtually any on-premises or edge location for a truly consistent hybrid experience.<br /> <br /> With Outposts, customers can maximize the value of their on-premises storage investments by leveraging their existing enterprise storage arrays for both boot and data volumes, complementing managed Amazon EBS and Local Instance Store options. This provides significant operational benefits, including streamlined operating system (OS) management via centralized boot volumes and advanced data management features through high-performance data volumes. By integrating their own storage, organizations can also satisfy data residency requirements and benefit from a consistent cloud operational model for their hybrid environments.<br /> <br /> To simplify the process, AWS offers automation scripts through AWS Samples to help customers easily set up and use external block volumes with EC2 instances on Outposts. Customers can use the AWS Management Console or CLI to utilize third-party block volumes with EC2 instances on Outposts.<br /> <br /> Third-party storage integration for Outposts with all compatible storage vendors is available on Outposts 2U servers and Outposts racks at no additional charge in all AWS Regions where Outposts is supported. See the FAQs for <a href=\"https://aws.amazon.com/outposts/servers/faqs/?nc=sn&amp;loc=4\" target=\"_blank\">Outposts servers</a> and <a href=\"https://aws.amazon.com/outposts/rack/faqs/\" target=\"_blank\">Outposts racks</a> for the latest list of supported Regions.<br /> <br /> To learn more about implementation details and best practices, check out <a href=\"https://aws.amazon.com/blogs/compute/deploying-external-boot-volumes-with-aws-outposts/\" target=\"_blank\">this blog post</a> or visit our technical documentation for <a href=\"https://docs.aws.amazon.com/outposts/latest/server-userguide/outpost-third-party-block-storage.html\" target=\"_blank\">Outposts servers</a>, <a href=\"https://docs.aws.amazon.com/outposts/latest/network-userguide/outpost-third-party-block-storage.html\" target=\"_blank\">second-generation Outposts racks</a>, and <a href=\"https://docs.aws.amazon.com/outposts/latest/userguide/outpost-third-party-block-storage.html\" target=\"_blank\">first-generation Outposts racks</a>.</p>", "company": "aws.amazon.com", "_k": "9fb128e5f5eab695d3500e17d927ecd12d4a08bfa5b42d612b60fa859c250d2e"}
{"title": "AWS Storage Gateway now supports VPC endpoint policies", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-storage-gateway-vpc-endpoint-policies/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Storage Gateway now supports Virtual Private Cloud (VPC) endpoint policies for your VPC endpoints. With this feature, administrators can attach endpoint policies to VPC endpoints, allowing granular access control over Storage Gateway direct APIs for improved data protection and security posture.<br /> <br /> AWS Storage Gateway is a hybrid cloud storage service that provides on-premises applications access to virtually unlimited storage in the cloud. You can use AWS Storage Gateway for backing up and archiving data to AWS, providing on-premises file shares backed by cloud storage, and providing on-premises applications low latency access to data in the cloud.<br /> <br /> AWS Storage Gateway support for VPC endpoint policies is available in all AWS Regions where Storage Gateway is available. To learn more, visit our <a href=\"https://docs.aws.amazon.com/storagegateway/?id=docs_gateway\" target=\"_blank\">documentation</a>.</p>", "company": "aws.amazon.com", "_k": "cfbe38d476a26b01df03e52e6fe8ee65ac824902816a6be1b52157e4244c0165"}
{"title": "AWS Step Functions now supports Service Quotas", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-step-functions-service-quotas/", "published": "2025-09-30T14:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the general availability of AWS Service Quotas integration with <a href=\"https://aws.amazon.com/step-functions/\" target=\"_blank\">AWS Step Functions</a>, enabling customers to monitor and manage their Step Functions quotas directly from the Service Quotas console. AWS Service Quotas is a service that helps you view and manage your AWS service quotas from a central location.AWS Step Functions is a visual workflow service that helps customers orchestrate AWS services, automate business processes, and build serverless applications. This integration improves service quota visibility and management for AWS Step Functions users.<br /> <br /> With this launch, you can now view your AWS Step Functions account-level quota values through the Service Quotas console and monitor quota utilization through Amazon CloudWatch metrics. This enhanced visibility is particularly valuable for customers running high-volume workflow operations at scale, helping them proactively monitor resource usage and avoid potential service disruptions. Additionally, you can now request quota increases directly from the Service Quotas console. For eligible requests, quota changes are automatically updated without manual intervention, streamlining the quota management process.<br /> <br /> Service Quotas console integration for AWS Step Functions is available in all commercial AWS Regions and the AWS GovCloud (US) Regions where AWS Step Functions is available.<br /> <br /> To learn more about managing AWS Step Functions quotas, visit the AWS Step Functions <a href=\"https://docs.aws.amazon.com/step-functions/latest/dg/service-quotas.html\" target=\"_blank\">documentation</a>. You can access this feature through the Service Quotas <a href=\"https://console.aws.amazon.com/servicequotas/home\" target=\"_blank\">console</a> or through the CLI.</p>", "company": "aws.amazon.com", "_k": "8fbec6f52b46ead8ff58fc35923580ab41bd73a5db32be46e34811d3b1d34462"}
{"title": "Announcing Amazon ECS Managed Instances", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-ecs-managed-instances/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Today, AWS announces the launch of Amazon Elastic Container Service (Amazon ECS) Managed Instances, a new fully managed compute option designed to eliminate infrastructure management overhead while giving you access to the full capabilities of Amazon EC2. By offloading infrastructure operations to AWS, ECS Managed Instances helps you quickly launch and scale your workloads, while enhancing performance and reducing your total cost of ownership.<br /> <br /> With ECS Managed Instances, you get the application performance you want and the simplicity you need. Simply define your task requirements such as the number of vCPUs, memory size, and CPU architecture, and Amazon ECS automatically provisions, configures and operates most optimal EC2 instances within your AWS account using AWS-controlled access. You can also specify desired instance types in Managed Instances Capacity Provider configuration, including GPU-accelerated, network-optimized, and burstable performance, to run your workloads on the instance families you prefer.<br /> <br /> ECS Managed Instances dynamically scales EC2 instances to match your workload requirements and continuously optimizes task placement to reduce infrastructure costs. It also enhances your security posture through regular security patching initiated every 14 days. You can use EC2 event windows to schedule patching to occur within weekly maintenance windows, minimizing the risk of interruptions during critical hours.<br /> <br /> ECS Managed Instances is now available in six AWS regions: US East (North Virginia), US West (Oregon), Europe (Dublin), Africa (Cape Town), Asia Pacific (Singapore), and Asia Pacific (Tokyo). To get started with ECS Managed Instances, use the AWS Console, Amazon ECS MCP Server, or your favorite infrastructure-as-code tooling to enable it in a new or existing Amazon ECS cluster. You will be charged for the management of compute provisioned, in addition to your regular Amazon EC2 costs. To learn more about ECS Managed Instances, visit the <a href=\"https://aws.amazon.com/ecs/managed-instances/\" style=\"cursor: pointer;\">feature page</a>, <a href=\"https://docs.aws.amazon.com/AmazonECS/latest/developerguide/ManagedInstances.html\" style=\"cursor: pointer;\">documentation</a>, and <a href=\"https://aws.amazon.com/blogs/aws/announcing-amazon-ecs-managed-instances-for-containerized-applications\" style=\"cursor: pointer;\">AWS News launch blog</a>.</p>", "company": "aws.amazon.com", "_k": "962c70a0b67aa7a7d70e13a1486bd93f88d8296b56cc6d9ad52c571880a2dda6"}
{"title": "AWS IAM Identity Center is available in Asia Pacific (Bangkok) and Mexico Central (Querétaro) AWS Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-iam-identity-center-bangkok-and-queretaro-regions/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>You can now deploy AWS IAM Identity Center in 36 AWS Regions, including Asia Pacific (Bangkok) and Mexico Central (Querétaro).</p> \n<p>IAM Identity Center is the recommended service for managing workforce access to AWS applications. It enables you to connect your existing source of workforce identities to AWS once and offer your users single sign on experience across AWS. It powers the personalized experiences offered by AWS applications, such as Amazon Q, and the ability to define and audit user-aware access to data in AWS services, such as Amazon Redshift. It can also help you manage access to multiple AWS accounts from a central place. IAM Identity Center is available at no additional cost in these <a href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\" target=\"_blank\">AWS Regions</a>.</p> \n<p>To learn more about IAM Identity Center, <a href=\"https://aws.amazon.com/iam/identity-center/\" style=\"cursor: pointer;\" target=\"_blank\">visit the product detail page</a>. To get started, see the <a href=\"https://docs.aws.amazon.com/singlesignon/latest/userguide/what-is.html\" style=\"cursor: pointer;\" target=\"_blank\">IAM Identity Center User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "cae24bb9d00b4e968cf7404059ba4a6127e5df6dc09a84d71f1608983ef43da6"}
{"title": "AWS ParallelCluster 3.14 adds P6e-GB200 and P6-B200 instance types", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-parallelcluster-p6e-p6/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS ParallelCluster 3.14 is now generally available. This release includes P6e-GB200 and P6-B200 instance types, prioritized allocation strategies for optimized instance placement, and NICE DCV support for Amazon Linux 2023. Other features included in this release are support for chef-client log visibility in instance console inside the instance's system log and Amazon Linux 2023 with kernel 6.12. To get started using P6e-GB200 instances with ParallelCluster, follow the tutorial in the ParallelCluster User Guide - <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/parallelcluster/latest/ug/support-nvidia-imex-p6e-gb200-instance.html\" style=\"cursor: pointer;\">Using Amazon EC2 P6e-GB200 UltraServers in AWS ParallelCluster</a>.<br /> <br /> For more details on the release, review the AWS ParallelCluster 3.14.0 <a contenteditable=\"false\" href=\"https://github.com/aws/aws-parallelcluster/releases/tag/v3.14.0\" style=\"cursor: pointer;\">release notes</a>.<br /> <br /> ParallelCluster is a fully-supported and maintained open-source cluster management tool that enables R&amp;D customers and their IT administrators to operate high-performance computing (HPC) clusters on AWS. ParallelCluster is designed to automatically and securely provision cloud resources into elastically-scaling HPC clusters capable of running scientific and engineering workloads at scale on AWS.<br /> <br /> ParallelCluster is available at no additional charge in the AWS Regions listed <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/parallelcluster/latest/ug/supported-regions.html\" style=\"cursor: pointer;\">here</a>, and you pay only for the AWS resources needed to run your applications. To learn more about launching HPC clusters on AWS, visit the ParallelCluster <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/parallelcluster/latest/ug/tutorials-v3.html\" style=\"cursor: pointer;\">User Guide</a>. To start using ParallelCluster, see the installation instructions for ParallelCluster <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/parallelcluster/latest/ug/install-pcui-v3.html\" style=\"cursor: pointer;\">UI</a> and <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/parallelcluster/latest/ug/install-v3-parallelcluster.html\" style=\"cursor: pointer;\">CLI</a>.</p>", "company": "aws.amazon.com", "_k": "f4180bf6d59bcadd39bf732f77999850b67b68ae1bb182b88b3e8388271aec0c"}
{"title": "Second-generation Amazon FSx for NetApp ONTAP is now available in four additional AWS Regions", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/second-generation-amazon-fsx-netapp-ontap/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon FSx for NetApp ONTAP second-generation file systems are now available in 4 additional AWS Regions: Europe (Spain, Zurich), Asia Pacific (Seoul), and Canada (Central).<br /> <br /> Amazon FSx makes it easier and more cost effective to launch, run, and scale feature-rich high-performance file systems in the cloud. Second-generation FSx for ONTAP file systems give you more performance scalability and flexibility over first-generation file systems by allowing you to create or expand file systems with up to 12 highly-available (HA) pairs of file servers, providing your workloads with up to 72 GBps of throughput and 1 PiB of provisioned SSD storage.<br /> <br /> With this regional expansion, second-generation FSx for ONTAP file systems are available in the following AWS Regions: US East (N. Virginia, Ohio), US West (N. California, Oregon), Canada (Central), Europe (Frankfurt, Ireland, Spain, Stockholm, Zurich), and Asia Pacific (Mumbai, Seoul, Singapore, Sydney, Tokyo). You can create second-generation Multi-AZ file systems with a single HA pair, and Single-AZ file systems with up to 12 HA pairs. To learn more, visit the <a href=\"https://docs.aws.amazon.com/fsx/latest/ONTAPGuide/what-is-fsx-ontap.html\">FSx for ONTAP user guide</a>.</p>", "company": "aws.amazon.com", "_k": "da61658aa06dc2708167086f8ae5b0cd5bcebe427d7563126571730bcc0d18d6"}
{"title": "Amazon FSx for NetApp ONTAP now supports Internet Protocol Version 6 (IPv6)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-netapp-ontap-ipv6/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for NetApp ONTAP file systems.<br /> <br /> More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.<br /> <br /> IPv6 support for new FSx for NetApp ONTAP file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for NetApp ONTAP file systems coming in an upcoming weekly maintenance window. To learn more, visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/fsx/\" style=\"cursor: pointer;\">Amazon FSx user guide</a>.</p>", "company": "aws.amazon.com", "_k": "abe6a1d19a9618dd4d6e02c9159ce891ba923c45f12e9d2bbd15b230d3d14a27"}
{"title": "Amazon FSx for Windows File Server now supports Internet Protocol Version 6 (IPv6)", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-for-windows-file-server-ipv6/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Amazon FSx now offers customers the option to use Internet Protocol version 6 (IPv6) for access to Amazon FSx for Windows File Server file systems.<br /> <br /> More and more customers are adopting IPv6 to mitigate IPv4 address exhaustion in their private networks or to satisfy government mandates such as the US Office of Management and Budget (OMB) M-21-07 memorandum. With this launch, customers can now access their file systems using IPv4, IPv6, or dual-stack clients without the need for complex infrastructure to handle IPv6 to IPv4 address translation.<br /> <br /> IPv6 support for new FSx for Windows File Server file systems is now available in all AWS Commercial and AWS GovCloud (US) regions where Amazon FSx is available, with IPv6 support for existing FSx for Windows File Server file systems coming in an upcoming weekly maintenance window. To learn more, visit the <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/fsx/\" style=\"cursor: pointer;\">Amazon FSx user guide</a>.</p>", "company": "aws.amazon.com", "_k": "f3eeb9c177f72d7eb325648daedf345e60cbd2e933c9b4031ad0c2ccce02ab42"}
{"title": "AWS Transfer Family now supports VPC endpoint policies and FIPS VPC endpoints", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/aws-transfer-family-vpc-endpoint-policies/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS Transfer Family now supports Virtual Private Cloud (VPC) endpoint policies for your&nbsp;VPC endpoints. With this feature, administrators can attach an endpoint policy to an interface VPC endpoint, allowing granular access control over Transfer Family APIs for improved data protection and security posture. Additionally, Transfer Family now supports Federal Information Processing Standards (FIPS) 140-3 enabled VPC endpoints.&nbsp;<br /> <br /> Previously, customers had full access to Transfer Family APIs through an interface VPC endpoint, powered by AWS PrivateLink. With this launch, you can now manage which Transfer Family API actions (CreateServer, StartServer, DeleteServer, etc) can be performed, which principals can perform them, and which resources they can act upon. These policies work with existing IAM user and role policies and organizational service control policies.&nbsp;<br /> <br /> <a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/vpc/latest/privatelink/vpc-endpoints-access.html\" style=\"cursor: pointer;\" target=\"_blank\">VPC endpoint policy support</a> is available in all&nbsp;<a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Regions where the service is available</a>. To learn more, visit the&nbsp;<a contenteditable=\"false\" href=\"https://docs.aws.amazon.com/transfer/latest/userguide/vpc-api-endpoints.html\" style=\"cursor: pointer;\">Transfer Family User Guide</a>.</p>", "company": "aws.amazon.com", "_k": "8fb59d8b4b44a88c4b72a6bbb5ce2f83b2784f8057fa27ed8444f9e9a2dfd3b3"}
{"title": "AWS B2B Data Interchange introduces new transformation status reporting", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/b2b-data-interchange-transformation-status-reporting/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>AWS B2B Data Interchange introduces new transformation status reporting in the AWS Console, enabling you to monitor and troubleshoot your Electronic Data Interchange (EDI) files processing in a single simple user interface.<br /> <br /> AWS B2B Data Interchange automates validation, transformation, and generation of EDI files such as ANSI X12 documents to and from JSON and XML data formats. With this launch, you can now track and review the status of the most recently performed EDI transformations directly in the AWS Console. For each partnership, AWS B2B Data Interchange now automatically presents information about the transformation status, timelines, and validation results for up to 10,000 most recently processed input-output pairs. This information enables you to easily track the status of your EDI exchanges with trading partners and troubleshoot issues, all in a single interface without needing to manually review log entries.<br /> <br /> Support for transformation status reporting is available in all AWS Regions where the AWS B2B Data Interchange service is available. To get started with monitoring your EDI transformations, visit the <a href=\"https://docs.aws.amazon.com/b2bi/latest/userguide/monitoring-overview.html\">AWS B2B Data Interchange user guide</a> or take our <a href=\"https://catalog.workshops.aws/getting-started-b2b-data-interchange/en-US\">self-paced workshop</a>.</p>", "company": "aws.amazon.com", "_k": "d58f1f513d2679aaab3efb5b771d7298427ea8c6c45a6ac47d436e7478c0f8b0"}
{"title": "Amazon FSx for Lustre is now available in the AWS US West (Phoenix) Local Zone", "url": "https://aws.amazon.com/about-aws/whats-new/2025/09/amazon-fsx-lustre-us-west-phoenix-local-zone/", "published": "2025-09-30T07:00:00+00:00", "source": "https://aws.amazon.com/new/feed/", "summary": "<p>Customers can now create Amazon FSx for Lustre file systems in the AWS US West (Phoenix) Local Zone.<br /> <br /> Amazon FSx makes it easier and more cost effective to launch, run, and scale feature-rich, high-performance file systems in the cloud. It supports a wide range of workloads with its reliability, security, scalability, and broad set of capabilities. Amazon FSx for Lustre provides fully managed shared storage built on the world’s most popular high-performance file system, designed for fast processing of workloads such as machine learning, high performance computing (HPC), video processing, financial modeling, and electronic design automation (EDA).<br /> <br /> To learn more about Amazon FSx for Lustre, visit our <a contenteditable=\"false\" href=\"https://aws.amazon.com/fsx/lustre/\" style=\"cursor: pointer;\">product pag</a><a contenteditable=\"false\" href=\"https://aws.amazon.com/fsx/lustre\" style=\"cursor: pointer;\">e</a>, and see the <a contenteditable=\"false\" href=\"https://aws.amazon.com/about-aws/global-infrastructure/regional-product-services/\" style=\"cursor: pointer;\">AWS Region Table</a> for complete regional availability information.</p>", "company": "aws.amazon.com", "_k": "d15decaef4b3e9cad7908a734349842c1bc6821f8f710b230699011806a7b978"}
